[
  {
    "post_id": "1qh86v9",
    "subreddit": "Palestine",
    "title": "“Alongside radical Islamist elements” and the people on the picture are a couple of white men and women, teenagers and two hijabis. Also why should anti-Israel protests be banned in Australia in the first place?",
    "selftext": "",
    "score": 94,
    "num_comments": 7,
    "created_at": "2026-01-19T16:04:50"
  },
  {
    "post_id": "1qh7znt",
    "subreddit": "Palestine",
    "title": "Israeli settler attempts to prevent the Abu Hammam family from accessing their property",
    "selftext": "",
    "score": 15,
    "num_comments": 1,
    "created_at": "2026-01-19T15:57:57"
  },
  {
    "post_id": "1qh7yg0",
    "subreddit": "Palestine",
    "title": "Israeli arsonist confronted in South America",
    "selftext": "",
    "score": 18,
    "num_comments": 1,
    "created_at": "2026-01-19T15:56:46"
  },
  {
    "post_id": "1qh4o79",
    "subreddit": "Palestine",
    "title": "Luis Hamilton pared with red crescent meets injured palatenians",
    "selftext": "",
    "score": 785,
    "num_comments": 26,
    "created_at": "2026-01-19T13:51:41"
  },
  {
    "post_id": "1qh2yy4",
    "subreddit": "Palestine",
    "title": "The \"Gaza Board of Peace\" is a joke and a desperate attempt to save the already dead PR of the US and Israel",
    "selftext": "I spent 5 hours researching about this, so reading the entire thing would be appreciated :D\n\nIf you have all followed the current events, you probably have seen the list of members thet Trump has assigned for the Gaza Board of Peace, a board that supposedly was made to supervise and manage the reconstruction plan in Gaza. Cool, right? Reconstruction, no more rubble, all aid in... \\*\\*WRONG\\*\\*\n\nSeriously, take a closer look at the members and you will realise just how fucked up this is - it looks like less of a peaceful board that is supposed to govern Gaza and more of a private equity firm and tycoon... \n\nHere is the source that the peace board is being established: \\[The Guardian](https://www.theguardian.com/us-news/2026/jan/16/trump-gaza-board-rubio-blair?hl=en-GB) ... now let is look at some of the actual members, as they are quite problematic for a couple reasons:\n\n1. Marc Rowan - has 9 billion in net worth, and is the CEO of Apollo, one of the world's largest equity firms. \\[Source: Forbes\\](https://www.forbes.com/profile/marc-rowan/?hl=en-US)\n\n2. Steve Witkoff - a well known real estate enthusiast with 2 billion dollars in net worth. \\[Source: Forbes\\](https://www.forbes.com/profile/steven-witkoff/?hl=en-US)\n\n3. Jared Kushner - a real estate heir and investor, whose net worth recently crossed the 1 billion mark. \\[Source: Newsseek\\](https://www.newsweek.com/jared-kushner-joins-billionaire-club-donald-trump-2131421?hl=en-US)\n\n4. Ajay Bonga - the former CEO of Mastercard, and the current president of the World Bank, with around 300 million dollars in net worth. \\[Source: World Bank's official page\\](https://www.worldbank.org/ext/en/who-we-are/leadership/ajay-banga), and \\[some insights on his Mastercard background\\](https://investor.mastercard.com/investor-news/investor-news-details/2010/MasterCard-Names-Ajay-Banga-President-and-Chief-Executive-OfficerSucceeding-Robert-W-Selander/default.aspx)\n\nAnd a fifth bonus, although he is not a real estate mogul like the rest of the people on here: Marco Rubio (I do not need to explain much - you all have seen his fierce support for Israel over the last 51 months) \n\nSide note: we all have noticed how the \"peace board\" lacks any Palestinians and Arabs on board, right? This alone should be beyond telling, as not allowing the OG land owners to participate in the first place is wild. You know what, forget about the Palestinians foe the sake of this argument - \\*\\*why are there no Arabs in this board, and why did Trump monetise the remaining seats of the Board of \"Peace\" if reconstructing Gaza without Hamas being a part of it was really his intention?\\*\\*\n\nThe part that I find the wildest is the fact that Trump monetised the vacant seats in the \"board of peace\" for 1 billion dollars, and no, \\[I swear i wish this was a lie\\](https://www.reuters.com/world/middle-east/trumps-gaza-peace-board-charter-seeks-1-billion-extended-membership-document-2026-01-18/). It was first reported by Bloomberg and picked up by Reuters.",
    "score": 237,
    "num_comments": 9,
    "created_at": "2026-01-19T12:33:53"
  },
  {
    "post_id": "1qh2led",
    "subreddit": "Palestine",
    "title": "They still walk free…",
    "selftext": "January 29, 2024 - Red Crescent volunteers receive and emergency call. A five-year old is trapped in a car under fire in Gaza by IOF soldiers, pleading for her rescue. While trying to keep her on the line, they do everything they can to get an ambulance to her. Her name was Hind Rajab. \n\nThis movie is about her story, it’s called The Voice of Hind Rajab. Never stop demanding justice. ",
    "score": 81,
    "num_comments": 2,
    "created_at": "2026-01-19T12:14:56"
  },
  {
    "post_id": "1qh0ufz",
    "subreddit": "Palestine",
    "title": "This is Zionism",
    "selftext": "",
    "score": 371,
    "num_comments": 11,
    "created_at": "2026-01-19T10:38:32"
  },
  {
    "post_id": "1qh0rn9",
    "subreddit": "Palestine",
    "title": "Germans, famously known for identifying and countering fascism",
    "selftext": "",
    "score": 947,
    "num_comments": 65,
    "created_at": "2026-01-19T10:34:00"
  },
  {
    "post_id": "1qgz8xp",
    "subreddit": "Palestine",
    "title": "The story of a Palestinian man",
    "selftext": "via tawakul sabr on Instagram",
    "score": 446,
    "num_comments": 6,
    "created_at": "2026-01-19T09:01:36"
  },
  {
    "post_id": "1qgytaz",
    "subreddit": "Palestine",
    "title": "Petition - Support and endorse Kairos Palestine II A Moment of Truth: Faith in a Time of Genocide.",
    "selftext": "The Global Kairos For Justice Coalition started a petition calling for support of Kairos Palestine II, a document by Palestinian Christian leaders speaking out against the genocide in Gaza and other injustices in the Holy Land.\n\n  \n",
    "score": 36,
    "num_comments": 2,
    "created_at": "2026-01-19T08:35:03"
  },
  {
    "post_id": "1qgnao7",
    "subreddit": "Palestine",
    "title": "Activists launch global campaign for Palestinian hostages held by the Zionist occupation",
    "selftext": "Red Ribbons Campaign aims to draw attention to more than 9000 Palestinians held in Israeli prisons, including more than 400 children.",
    "score": 535,
    "num_comments": 4,
    "created_at": "2026-01-18T23:07:38"
  },
  {
    "post_id": "1qgmua0",
    "subreddit": "Palestine",
    "title": "Palestinian man uses a sieve to recollect his family's remains following bombing",
    "selftext": "",
    "score": 134,
    "num_comments": 1,
    "created_at": "2026-01-18T22:49:13"
  },
  {
    "post_id": "1qgmtea",
    "subreddit": "Palestine",
    "title": "Palestinian confronts settlers who released their livestock onto citizens’ lands",
    "selftext": "",
    "score": 73,
    "num_comments": 2,
    "created_at": "2026-01-18T22:48:15"
  },
  {
    "post_id": "1qglhoh",
    "subreddit": "Palestine",
    "title": "NFL fines Texans linebacker Azeez Al-Shaair $11,593 for wearing eye black reading “stop the genocide.”",
    "selftext": "",
    "score": 4819,
    "num_comments": 85,
    "created_at": "2026-01-18T21:56:11"
  },
  {
    "post_id": "1qgksjl",
    "subreddit": "Palestine",
    "title": "Gavin Newsom denies the genocide in Gaza",
    "selftext": "Source: Gavin Newsom Podcast",
    "score": 1621,
    "num_comments": 152,
    "created_at": "2026-01-18T21:27:58"
  },
  {
    "post_id": "1qgjraw",
    "subreddit": "Palestine",
    "title": "Last night: Settler pogrom in East Ramallah, four hospitalised. Almost every house in the Palestinian village of Mukhmas has been burned to the ground.",
    "selftext": "",
    "score": 336,
    "num_comments": 2,
    "created_at": "2026-01-18T20:42:10"
  },
  {
    "post_id": "1qgiz3k",
    "subreddit": "Palestine",
    "title": "The world failed Palestinians",
    "selftext": "Just wanted to say as a Canadian, i'm so fucking disgusted about what's been happening right under EVERY country's eyes. We all seen the Childrens starving, civilians getting bombed and sniped in their house. I'm so sad, literally crying right now after seeing a video of a kid failing to collect any food and going back home to his mom with his pot empty.\n\nIt's 2026 how can we fail humanity this badly. I'm embarassed and ashamed that i'm writing this shit from the comfort of my home.These IDF soldiers have their cell phones with them and have been showing off on social media enjoyment bombing and killing innocents. True psychopaths, no methods to avoid Innocent's deaths. I DONT UNDERSTAND HOW THE WORLD WONT PUNISH THEM.\n\nI hope every single leader, Eu , america , asia, realise they have blood on their hands and are complicit to the murder of 10s of thousands of innocents. True number are realistically in 100s of thousands of child and civilians. Embarassing truly, feeling so powerless.",
    "score": 841,
    "num_comments": 18,
    "created_at": "2026-01-18T20:11:25"
  },
  {
    "post_id": "1qgi37v",
    "subreddit": "Palestine",
    "title": "Zionist Orthodox Union (OU) rabbi claims their reality is \"fundamentally different\" when it comes to their enormous destruction.",
    "selftext": "Additional \"we have every right to sing in light of the Gazans' suffering\" since we can see ourselves as good unlike the rest of the entire world.\n\nThese are the guys that have the OU kosher certifications, unfortunately.\n\n\\[[https://www.ou.org/from-ma-nishtana-to-ma-nishtanu-we-are-different/\\](https://www.ou.org/from-ma-nishtana-to-ma-nishtanu-we-are-different/)](https://www.ou.org/from-ma-nishtana-to-ma-nishtanu-we-are-different/%5D(https://www.ou.org/from-ma-nishtana-to-ma-nishtanu-we-are-different/))",
    "score": 91,
    "num_comments": 8,
    "created_at": "2026-01-18T19:37:39"
  },
  {
    "post_id": "1qghyt6",
    "subreddit": "Palestine",
    "title": "Israeli occupation soldiers prevent a young girl from returning to her home.",
    "selftext": "",
    "score": 820,
    "num_comments": 9,
    "created_at": "2026-01-18T19:32:49"
  },
  {
    "post_id": "1qgf5v8",
    "subreddit": "Palestine",
    "title": "Footage of an Israeli paramedic participating in the arrest of a Palestinian in Hawara, occupied Palestine. Not only Israeli paramedics routinely deny treatment to injured Palestinians or delay medical care, they also operate as instruments to enforce apartheid.",
    "selftext": "",
    "score": 480,
    "num_comments": 15,
    "created_at": "2026-01-18T17:49:20"
  },
  {
    "post_id": "1qh840f",
    "subreddit": "IsraelPalestine",
    "title": "Risk Iran is Facing.",
    "selftext": "Hey there! As an ethnic Iranian I would just want to give my concern on the current situation.\n\nI fully support these, as an Iranian Muslim culturally, we are not just Muslims, we are jews, zoroastrians, and many more. Religiously, extremism like this isn't allowed and culturally we are free people.\n\nNot my main concern. My main concern is, And I say this with no offense to any americans or jewish people. My concern is majority of the people have been pushing for Reza Pahlavi, The former shah's son to be the new leader. But this is where I stop supporting him, He has very close ties with Israel and the United States. Which I don't care about, they are good allies but it seems suspicious why only him? A person with close ties to the USA and Israel? It would make sense if they want Iran because of it controlling many prominent things like strong military wise, and Iran controls the northern coast of the Strait of Hormuz with (coincidently) allows 20% of the world's oil to flow through. And not minding the large natural gas and oil reservers.\n\n  \nI want the freedom, We deserved it. But I don't like the fact that our best option of a leader has close ties to USA and Israel. Same thing with why has the US only taken over Venezuela? Coincidently  they want to run Venezuela when it has the largest oil reserves in the world. Thank you for listening. I just wanted to get this off my chest because if that is gonna be the case, this is a lose-lose situation for the Iranian people.\n\n  \nBefore you attack me, Please take into consideration the consequence of this leader being selected.",
    "score": 2,
    "num_comments": 3,
    "created_at": "2026-01-19T16:02:06"
  },
  {
    "post_id": "1qh3nc6",
    "subreddit": "IsraelPalestine",
    "title": "Early Zionist Militias",
    "selftext": "I keep seeing this “argument” online that criticizing Hamas isn’t legitimate because “early Zionist militias were terrorists too.” It’s one of those claims that sounds clever until you unpack it. First off, when does a liberation movement become a “terrorist” organization? There’s no single, universally accepted legal definition. Generally, terrorism is framed as the use of violence against civilians to achieve political goals—but even that is debated depending on context and perspective. So yes, labeling groups is highly subjective.\n\nPeople also extend this logic to the IDF, claiming it’s “terrorist” because it evolved from militias like the Haganah or Irgun. This argument is sloppy at best. Early militias operated in a very different historical and political context: under British Mandate, against hostile forces, in a pre-state environment. Israel’s formal army is a recognized state institution, accountable (at least in principle) to laws and government, unlike insurgent militias operating outside any legal framework.\n\nThe underlying problem with the “both sides did it” approach is that it conflates historical context with contemporary morality. Criticizing Hamas today is about actions in the present, not the imperfect past of another group. History informs ethics, but it doesn’t provide carte blanche to excuse ongoing acts of violence. The reality is messy: legitimacy, terrorism, and liberation aren’t black-and-white—they’re always filtered through perspective, power, and law.\n\nIn short, appealing to early Zionist militias to deflect criticism of Hamas is a weak analogy. Context matters, and historical actions don’t erase present-day responsibilities.",
    "score": 10,
    "num_comments": 44,
    "created_at": "2026-01-19T13:06:22"
  },
  {
    "post_id": "1qgugiq",
    "subreddit": "IsraelPalestine",
    "title": "The two kinds of antizionist justification: They hate Israel for Who Israelis are V. what Israel does",
    "selftext": "I've found that, when you boil it down, there are basically two kinds of justification for antizionism. When an anti-Zionist starts out with one reason and argues with a Zionist and gets out-argued, they typically switch to the other reason.\n\n**1. Israel is bad because of who Jews are**\n\nThis is your basic settler-colonizer buzzword sandwich. Following this logic, Israel is bad because Jews are foreign European people who have no right to be in the Levant in the first place, and certainly no right to seek self determination there.\n\nTherefore, everything the true locals (Palestinians) do --- however much they murder, rape, displace Jews --- is justified, because they are getting rid of this fundamental evil that was never supposed to be there in the first place. Whatever Israelis do is wrong. Israelis cannot possibly do anything in self defense or response to aggression, because their very existence is offensive in the first place. Palestinians are allowed to kill Israelis, and Israelis are not allowed to fight back.\n\n**Where it falls apart:**\n\nThis argument falls apart because Jews are indigenous to Israel. They were displaced and taken away on slave ships, and after getting persecuted and displaced more, they finally returned to their ancestral homeland.\n\nAnyone who thinks an indigenous people should not return to their homeland and try to claim self determination there would have to say that Native Americans have no right to a land back movement, or displaced Palestinians for that matter have no right to go to Israel. Unless they choose some arbitrary number of years for an \"indigenous rightful owner\" to magically turn into a \"foreigner colonizer\", but ask them to give a specific number of years that isn't arbitrary, and they can't do it.\n\nSo when they realize this, they switch to point #1 with some transition line like \"Well, the problem isn't that Jews came back to Israel, the problem is that they displaced/killed so many Palestinians in the process!\"\n\n**2. Israel is bad because of what it does**\n\nThis is your basic genocide apartheid ethnic cleansing buzzword sandwich. Following this, the idea of Jews seeking self determination in their homeland was okay, but the problem is that those Jews turned out to be evil people who displace and murder peaceful Palestinians.\n\n**Where it falls apart:**\n\nThis falls apart because both Jews and Arabs engaged in violence against each other (and Arabs started each new round of the violence.). Pro-Palestinians basically have to leave out half the story.\n\nArabs started murdering and displacing Jews in the 1920s, long before Jews started responding by attacking them back. This pattern continued for the whole conflict: In 1948, Palestinian Arabs were offered their own country for the first time ever. Plus, Jews offered Arabs full citizenship and equal rights in Israel. Arabs responded by starting a war. Similar numbers of Palestinians and Jews were killed in that war. As the decades went on, the pattern continued: Arabs would attack first, and Israelis would fight back.\n\nPalestinians are in a worse situation than Israelis now because they keep starting wars and losing them, not because Israelis are somehow more brutal in their fighting (you could make an argument that Israel was less brutal up until a few years ago but more brutal in this particular war, but I've yet to hear a Pro-Palestinian make that argument).\n\nSo when Pro-Palestinians realize this argument is worthless, they switch to point 1 with some transition line like \"Well, the Palestinians are just fighting back against settler-colonizers!\"",
    "score": 8,
    "num_comments": 92,
    "created_at": "2026-01-19T04:34:19"
  },
  {
    "post_id": "1qglv7m",
    "subreddit": "IsraelPalestine",
    "title": "History Education - The Missing Element",
    "selftext": "I am not Jewish or evangelical Christian. I am a very passionate friend of Israel and the Jewish people. But I wasn't always that way...\n\nFor most of my life I was what I would call a \"non-Zionist.\" A person who really doesn't care strongly either way... Like perhaps Israel has some good and bad points and maybe Hamas has some good and bad points and they both need to stop fighting...\n\nThis is DESPITE having Jewish friends basically my entire life...\n\nAs a long term friend of Israel and Jewish people, I can say, that where the pro-Israel movement has failed in using its strongest weapon, which is simply true and unvarnished history. Not only in defending the position of the Jewish people and the world's only Jewish state, but in educating young people, but especially young Jews...\n\nIsrael and the Jewish people have made a LOT of mistakes throughout history. The prestate militias made a LOT of mistakes. We can't and there is no reason to hide from these. But while expressing regret for such mistakes and missteps, it is important that both Jews and non-Jews understand history from a 360 degree perspective... I do not in any way excuse or explain away any current or past mistakes.\n\nBut when a person has a FULL understanding of history, both the good and bad, it is obvious that Israel and the Jewish people are FAR, FAR more humane than ANY group of random people would have been facing the same situations and provocations and that is why I am myself pro-Israel and feel strongly about it.\n\nWe talk about Jewish mistakes. For example, not allying more with Mustafa al-Khalidi and his faction and WIPING OUT FULLY the pro-N@zi Amin Al-Husseini faction (supporters of the Amin Al-Husseini the Grand Mufti of Jerusalem, and a leading supporter of the N@zis and the Final Solution) during what was essentially the Palestinian civil war -- that is another thing... there is an idea that the Palestinians were a monolith during this time -- they were not... Had the early Zionists ensured al-Khalidi and his faction won BY ANY MEANS NECESSARY. ANY MEANS, had they achieved power, they would have accepted the partition plan and while he was NOT a Zionist at ALL, he didn't believe in throwing all Jews into the sea. It would have been peace albeit a cold peace.\n\nBut at the same time, I do understand the pressures they were under and why the mistakes were made...\n\nSome of the early Zionists had \"understandings\" with not Al-Husseini himself but his family who sold the early Zionists LARGE tracts of land and were regularly selling them land and talking to them... Probably the early Zionist leaders thought that because his family was selling them land and therefore Al-Husseini, the pro-N@zi Grand Mufti of Jerusalem was benefiting from this and most likely he and his family said nice things to them behind the scenes he wasn't such a threat. What a HUGE mistake ...\n\nWe talk about anti-semetism -- let's say you are a young person, let's say you are similar to the way I used to be, I  knew NOTHING about the conflict. Most of Jewish friends and co-workers had NOTHING to say about Israel and nearly all of the ones who DID say anything, said bad things about it... So as a young person who knows nothing, what would myself or someone ELSE in my position think... how could we not be either non-Zionist or anti-Zionist if we are surrounded by an echo chamber of anti-Zionism and even our JEWISH friends, who we go to to get a different viewpoint, don't care or express certain anti-Zionist talking points... I mean how else could you end up...\n\nMy change only occurred when I started doing my OWN research and studying and later making friends with other pro-Israel Zionists who taught me more... But for me, my views are largely shaped by my own personal friendships with Jews for decades, since childhood, but beyond that, a deep understanding of history from BOTH sides. I am intimately familiar with both the arguments of anti-Zionists and certain Zionists and I understand the pluses and minuses of both sides, although of course I am pro-Israel, so I much mostly align with the Zionist arguments in regards to my personal views.\n\nOn the pro-Palesitnian side, from what I see, one reason why I reject them and their movement although I have compassion for Palestinains is I see that they selectively ignore and sometimes completely rewrite history in order to villify Jews. Once I noticed this pattern enough, it was hard for me to take ANYTHING they say seriously... they call Jews immigrating to Israel \"colonialists\" and occupiers. First of all Israel has ALWAYS been the home for the Jewish people. ALways. THey were NEVER recognized as full Europeans in the mid 19th century or earlier. NEVER. They were ALWAYS considered outsiders...\n\nBut let's talk about colonialism -- for centuries, the Ottoman Empire, primarily run by Europeans who CALLED themselves Ottomans, we are talking garden variety white people who were converts to Islam, who ran what was then called Palestine and the entire Middle East and Northern Africa... we talk about white colonialists and occupiers, if they are SOOO upset about occupation and white European invaders, why aren't they upset about the Ottoman Empire who again, was headed and run by people with WHITE EUROPEAN heritage...\n\nI personally don't care WHAT race a person is, but this is made such a big deal -- I can't help but point out the hypocrisy...\n\n  \n\n\nPS. Speaking of history. Another interesting fact. The Jews say they bought the land and the Arab Palestinians were upset because the land was \"stolen.\"\n\nLet me clarify that point... The Al-Husseni family and certain other rich families both in the Levant and in Turkey and in other areas, benefited from the Ottoman Land Act of 1858...\n\nThe \"Ottoman Land Code of 1858 linked land registration to military service, requiring landowners to register their property with the state, which often meant Muslim men faced conscription into the Ottoman Army, while many peasants avoided registration to evade service, taxes, or fees, leading to land being registered by local notables and altering social structures, especially in regions like Palestine. This reform aimed to increase state control and revenue but inadvertently created a system where land often became legally owned by absentee elites, despite peasants working it for generations.\"\n\nThat is it in a nutshell... basically land could have been passed from one generation to another for countless centuries but was in the hands legally of rich Turkish, Palestinian, Syrian or other land owners... in the late 19th century, decades after the Ottomans created this law (the law was again created decades before the advent of Zionism) the early Zionist wanted to BUY legally land in what was then called historical Palestine. The rich land owners who legally owned the land, had absolutely NO respect or care for Palestinian farmers who had been working the land for generations and they were happy to charge Jews 3X the real cost of the land and make a decent profit. They had no problem whatsoever with selling this land and making a quick buck...\n\nBesides various Turkish and other families, one of the many main families engaged in this was the family of the notorious Grand Muti of Jerusalem, the Al-Hussenis who were playing a double game, in regards to making money selling land to the Zionists and then at the same time stirring up ethnic and religious hatred towards them.\n\nSo in a way they are both correct. The Jews legally purchased the land from the owners who were Arab and Turkish elites. These elites did NOT care about the Palestinian farmers.\n\nNaturally if the land was sold, then whoever was there before got kicked out...\n\nMany Palestinians were left completely penniless and destitute, there only source of substance was the land they farmed and Amin Al-Husseni took advantage of this situation that his family and the family of other elites created to generate hatred and get power...",
    "score": 13,
    "num_comments": 37,
    "created_at": "2026-01-18T22:10:51"
  },
  {
    "post_id": "1qgcz0r",
    "subreddit": "IsraelPalestine",
    "title": "Battle of Kadesh: 1274 BCE",
    "selftext": "We get a lot of posts here saying something about how Palestinians are the purest Canaanites genetically and something woo woo about indigenousss. \n\nI keep trying to tell people how absurdly complicated the history of this region is. Being a professional military historian, I have long had a superficial sense of that complexity. \n\nPut off learning the history of the Near East my whole life because it's harder than Chinese algebra. Didn't get less hard in the meantime I'll tell you that. Trying to summarize the cultural and genetic history of what is now Israel is not possible it's so complicated. \n\nHere's an example. Battle of Kadesh. May 1274. Ramses II aka Ramses the Great fought the Hittites in what is now southern Syria. Hittites were centered in what is now Turkey but came south over the years. The first well recorded battle in world history. And actually they were beefing over cedar trees. Egypt didn't have trees, see. \n\nBut the point is that this was a wider war that went on for 100 years. So for a century there, a whole bunch of dudes were rolling between Egypt and Syria through what is now Israel. Dudes from Egypt, Turkey, and all their vassals in between. \n\nOne thing I've noticed about fighting age men, they enjoy sexual intercourse with whatever woman, man, or goat they can find. Some of them sperms worked. Which is always a stunning little miracle. \n\nSo just think about that genetic complexity. Just from that war alone, some cute little story about indigenoussss already makes no sense. ",
    "score": 17,
    "num_comments": 63,
    "created_at": "2026-01-18T16:26:46"
  },
  {
    "post_id": "1qgbebh",
    "subreddit": "IsraelPalestine",
    "title": "The board of peace composition is a good thing for Israel and the Jewish people",
    "selftext": "If you look at the Israeli Press, such as the times of Israel or Jerusalem Post, you would think that the composition of the board of peace executive board is a negative thing for Israel countries such as Qatar and Turkey and Pakistan, which have all been invited to join the board of peace. In addition to that there are other countries such as Canada and United Kingdom, which are western countries, but have also been hostile to Israel over the past couple of years. Given all of this, I could see why some conclude that the way that Trump is composing the board of peace is a negative thing for Israel.\n\nHowever, if you think about the contents of the United Nations security council resolution that ended the war, you would see that they are very favorable to Israel and lead to an outcome that I believe many American Jews want for the state of Israel. it involves Hamas being de radicalized, Gaza being demilitarized. in order for that to happen and in order for there to be legitimacy around this happening, there must be a well balanced board and international coalition driving this forward. There is no way that Hamas would disarm if the Board of peace were composed solely of countries favorable to Israel. There is no way that Gaza would be deradicalized after decades of supposed stewardship by an international organization UNRWA which resulted in a deeply biased and radicalized population due to the education system which the UN had administered. in order for all of this change to be possible the countries that support the Palestinian people must be closely involved in bringing that solution to fruition or making that solution a reality that is why I believe that inviting countries like Qatar, Turkey and Pakistan to the board of peace was a stroke of genius by President Trump and Jared Kushner. \n\nDo you agree? If not, what do you believe Trump should have done when building this board of peace?",
    "score": 0,
    "num_comments": 26,
    "created_at": "2026-01-18T15:26:32"
  },
  {
    "post_id": "1qg9ik2",
    "subreddit": "IsraelPalestine",
    "title": "British Indian Hindu deeply troubled by the oppression of Palestinians",
    "selftext": "Hi all,\n\nI’m a British Indian Hindu and a Kashmiri Pandit, and the Israel–Palestine conflict has caused me a lot of personal grief. Terrorism from Pakistan killed members of my extended family, and because of that I grew up instinctively sympathetic to Israel. Today, I still believe Israel has a fundamental right to exist and value that it is a democratic state.\n\nHowever, I’ve become increasingly appalled by Israel’s policies toward Palestinians. I struggle to reconcile how Israelis can live freely, travel, and pursue high‑tech or entrepreneurial careers, while Palestinians in Gaza and the West Bank are confined to fragmented enclaves with severe restrictions on movement, trade, and economic opportunity. Many Palestinians, despite being educated and capable, can only aspire to low‑wage work in Israel under precarious permits, while their communities remain underdeveloped.\n\nSettler violence in the West Bank is another major concern. Palestinians have no standing army or meaningful protection on their own land, and attacks on homes, farms, and livelihoods often go unpunished or receive minimal response. Meanwhile, even a single Palestinian attack triggers a massive military response. The imbalance is stark and deeply unfair. Settler attacks are very deadly, if someone challenges me I can easily provide statistics on the settler attacks and I can challenge the intifadas as a basis for Israel’s crippling measures. \n\nI understand that some argue that Palestinians elect extremist or militant governments, such as Hamas in Gaza, which complicates governance and security. But this cannot fully justify crippling millions of civilians. Statistically, terror attacks in Israel are relatively rare—comparable to rates of violent crime in developed countries—yet the collective restrictions placed on Palestinians vastly exceed the actual threat.\n\nThe economic and social disparity is heart-wrenching. Israelis can aspire to normal, fulfilling lives, while Palestinian communities are denied basic opportunities. Seeing Israelis live happily under these circumstances makes me feel conflicted and upset, because that happiness comes at the expense of others’ suffering.\n\nI want to do something constructive. I would like to advocate for policies that allow Palestinians greater economic freedom, trade, and mobility. I also wonder if there could be some form of neutral international protection, perhaps through the UN or other multinational arrangements, to reduce settler violence and protect civilians.\n\nI’m not posting to deny Israel’s security concerns, but I am struggling to reconcile support for Israel’s right to exist with the ongoing oppression and suffering of Palestinians. I would deeply appreciate thoughtful discussion: how can people outside the region advocate for Palestinian economic and human development effectively, without escalating conflict?\n\nI call for all Hindus to stop their unlimited support for Israel, just because of our own experience with Pakistan, at least question what is it we are supporting. ",
    "score": 0,
    "num_comments": 29,
    "created_at": "2026-01-18T14:09:35"
  },
  {
    "post_id": "1qg29ow",
    "subreddit": "IsraelPalestine",
    "title": "My 2 state solution",
    "selftext": "My 2 state solution is as follows...\n\nPalestine cedes the Gaza strip to Israel\n\nIsrael cedes the entire unannexed west bank to Palestine + Muslim land the size of the Gaza strip \n\nIsraeli settlers in the west bank will be relocated to the Gaza strip or anywhere else they choose. \n\nAll Gazans can choose to either live in Israel as Israeli Arabs or relocate to the new Palestine \n\nMinor land swaps can be done as needed.\n\nEast Jerusalem and the annexed parts of the west bank will either be under Israeli, International or joint control and remain disputed.\n\nIsrael and Palestine must illegalize any and all parties and organizations that want to wipe the other side off the map and withdraw all claims out side of their own territory and the disputed East Jerusalem and annexed west bank.\n\nPalestine must demilitarize until permission is given by Israel \n\nBoth Palestine and Israel must work with each other in catching any radicals that try to do any terror attacks or crimes. \n\n\nThe entire world will recognize Israel and Palestine \n\nPalestine will be allowed into the UN\n\nHamas and all jihad organizations and parties within Palestine must disband and all other parties within Palestine must abide by the new law of not claiming anymore territory other than the territory and the disputed East Jerusalem and annexed parts.\n\n\nIsrael and Palestine will recognize and have diplomatic relations with each other. \n\n\nIsrael and possibly the UN will pay all Palestinian refugees reputations or have the chance to move into Palestine or a certain amount (enough that Israel can keep its Jewish majority)  can move into Israel and become Israeli Arabs.\n\n\nLet me know if this is a good plan or what needs to be edited.",
    "score": 0,
    "num_comments": 111,
    "created_at": "2026-01-18T07:31:31"
  },
  {
    "post_id": "1qfx3h4",
    "subreddit": "IsraelPalestine",
    "title": "Albert Einstein - a Zionist Activist",
    "selftext": "Albert Einstein the Zionist\n\nAlbert Einstein was a Zionist. A German Jew who was ejected from Germany by the Nazis, Einstein viewed the founding of the state of Israel as a very good thing. He was a sort of a Zionist lobbyist. \n\nIndeed, Einstein lobbied for the creation of the state, as proposed in the UN General Assembly partition plan of 1947. The Arabs of course rejected the plan. Einstein passionately endorsed partition. \n\nIn the months preceding the vote for partition, Einstein wrote a letter to India’s prime minister, pleading for India to vote for partition. Einstein is often described as an “anti Zionist,” but some of the things written by him to the Indian leader would be considered “far right” by today’s leftists.\n\nIn the letter, Einstein essentially says - there is no Palestinian people. They’re part of an Arab nation. The Arabs have many lands. The Jews just want a tiny piece of the land. \n\nHe wrote to India’s prime minister\n\n “At the close of world war 1, 99% of the vast, underpopulated territories liberated from the Turks by the Allies were set aside for the national aspirations of the Arabs. Five independent Arab states have since been established in these territories.Only 1% was reserved for the Jewish people in the land of their origin. The decision which led to the proclamation of the Balfour Declaration was not arbitrary, nor the choice of territory capricious. It took into account the needs and aspirations of both Arab and Jew, and certainly, the lion’s share did not fall to the Jews. In the august scale of justice,which weighs need against need, there is not doubt as to whose is more heavy.  The “small notch” in the land of their fathers, granted the Jewish people, somewhat redresses the balance.” \n\nEinstein endorses the Balfour Declaration, universally viewed by radical leftists as evil, while saying “the Arabs have many states and they’re vast. The Jews only want one state in their ancient homeland”. \nSource: \nhttps://hvk.org/2017/0717/18.html \n\nEinstein’s Zionist lobbying continued after the founding of the state. In the 1950s, Israel’s first prime minister, David Ben Gurion, offered Einstein to become Israel’s president. Ben Gurion and Einstein were quite close. Both were Zionist and both were socialists. While Einstein was more socialistic than Ben Gurion, Ben Gurion were unironically socialist (Ben Gurion actually visited the Soviet Union once and spoke highly of Lenin. Ben Gurion later claimed his wife, Paula Ben Gurion, had a crush of Leon Trotsky when she was a young Jewish anarchist in New York City). \n\nBen Gurion would not have offered the presidency to a man who he didn’t think with a 100% certainty was not worthy of it as a Zionist. \n\nEinstein politely declined. “I’m a scientist, not a politician,” he told Ben Gurion. \n\nNevertheless, Einstein’s Zionist activism continued. In 1955, he was slated to read a speech on the radio in favor of Israel.\n\nThe speech was written by no other than Abba Eben, one of Israel’s most prominent diplomats. The speech condemned Arab hostility towards Israel. It drew a direct line between the Holocaust and Arab states’ aggression towards the Jewish state. A speech written by Abba Eben, this was an unmistakably Zionist speech. \n\nThe speech said: \n\n“The establishment of this State was internationally approved and recognised largely for the purpose of rescuing the remnant of the Jewish people from unspeakable horrors of persecution and oppression .  . Thus, the establishment of Israel is an event which actively engages the conscience of this generation,” he continued. “It is, therefore, a bitter paradox to find that a State which was destined to be a shelter for a martyred people is itself threatened by grave dangers to its own security. The universal conscience cannot be indifferent to such peril” \n\nEinstein strongly condemned Israel’s critics: “It is anomalous that world opinion should only criticize Israel’s response to hostility and should not actively seek to bring an end to the Arab hostility which is the root cause of the tension” \n\nSource \n\nhttps://www.algemeiner.com/2013/04/17/einsteins-never-before-seen-israel-independence-day-speech-revealed/\n\nEinstein died before making the address. After his death, he donated his writings to the Hebrew University in Jerusalem, where his personal files are still stored. To commemorate Einstein’s life and contributions to the Jewish state, Israel printed his image on the 5 Israeli pound bill (Israel’s currency before the shekel was called Israeli pound). \n\n\nSource \nhttps://www.globecoins.com/שטר-5-לירות-1968-איינשטיין-בנק-ישראל\n\n\nSo there you have it - Albert Einstein, a friend of Israel. Next time you read some propaganda piece about Einstein and Zionism, keep this all in mind. When you know the facts, propaganda loses its power. \n\n\n",
    "score": 61,
    "num_comments": 143,
    "created_at": "2026-01-18T03:03:36"
  },
  {
    "post_id": "1qfv46u",
    "subreddit": "IsraelPalestine",
    "title": "Mythbusting: Zionist leaders were \"expansionist\" and wanted to expand borders.",
    "selftext": "Many Pro-Palestinians have to face the reality that Jews really did want peace and were fine with partition. To contradict this well-founded fact, they have to spout out random quotes, and maybe some of the most idiotic contradictions. There are a bunch of quotes from the Israeli side, but I need to clear these up because they are the easiest copy and paste. \n\n1937 Peel Commission\n\nFollowing the publication, in 1938 the Woodhead Commission was appointed to examine it in detail and recommend an actual partition plan. The Jewish Agency accepted the idea of partition, however, didn’t agree with the borders or transfer. Prior to the report’s publication, there was indication that the Nashashibis, backed by Jordan’s Amir Abdullah, were in favor of partition. That was the reason given for the party’s reason to withdraw from the Arab Higher Committee, which were strictly opposed to partition. No Arabs came forward to submit evidence, though king Abdullah of Transjordan wrote to Woodhead giving support for partition as well as receiving the Commission in Amman. Assassination attempts against opposition leaders may have well frightened the Nashashibis too. Even in the Peel plan, it highly doubted that 200,000 Arabs could be moved to the Southern part of the Mandate. They suggested a voluntary movement by promising new opportunities. \n\nThe Woodhead Commission considered three different plans, one of which was based on the Peel plan. Reporting in 1938, the Woodhead Commission rejected the Peel plan primarily on the grounds that it could not be implemented without a massive, forced transfer of Arabs (an option that the British government had already ruled out). Had the Mufti favored the partition, the British would have preferred his rule over Abdullah. In Lebanon the Maronites initially also welcomed a Jewish state, which would break the hostile ring of Muslim Arabs. Ben Gurion thought that had the partition plan been carried out, the Holocaust could have had a different effect. If the British fully endorsed and promoted the plan, it could have been implemented with the support of the local Zionists and Arab armies forces in favor. For 1948, there was indication of certain leaders and institutions willing to cooperate with the UNCOP, however the Arab Higher Committee policy silenced any opposition. \n\nLet's start: \n\n\" I don’t understand your optimism...why would Arabs make peace? If I were an Arab leader, I would never sign an agreement with Israel. It is normal; we have taken their country. It is true God promised it to us, but how could that interest them? Our God is not theirs. There has been antisemitism, the Nazis, Hitler, Auschwitz, but was that their fault? They see but one thing: we have come and we have stolen their country. Why would they accept that?\"\n\nWe actually don’t even know if this quote is real. It’s attributed to Nahum Goldmann, who alleged Ben Gurion said this to him in his book Le Paraddoxe Juif in a private conversation. Ben Gurion was describing the Arab perspective of the conflict; he was not suggesting that he believed those things himself. In fact, Goldmann described Ben Gurion as pessimistic about the prospects for peace specifically because the Arab countries had this opinion of the Jewish state.\n\n\"Let us not ignore the truth among ourselves ... politically we are the aggressors and they defend themselves... The country is theirs, because they inhabit it, whereas we want to come here and settle down, and in their view we want to take away from them their country.\"\n\nThis quote explains the same thing. Ben Gurion definitely understood the Arab world's logic for their disapproval of Israel, but no Zionists ever took it seriously. \n\n\" I saw in the Peel Plan two positive things: the ideas of a state and compulsory transfer... I support compulsory transfer. I don't see in it anything immoral, but compulsory transfer can only be affected by England and not by the Jews... Not only is it inconceivable for us to carry it out, but it is also inconceivable for us to propose it.\"\n\nThe Woodhead Commission in 1938 noted that:\n\n\" On behalf of the Jews it was made clear to us that Jewish opinion was opposed to the exercise of any degree of compulsion.\"\n\nHe restates what he means in his letter to Amos in 1937:\n\n\" When I weigh the advantages and disadvantages of the committee's plan against my plan, I find it overall better. In two major things, whose value cannot be estimated, the committee's proposal excels: a. Handing over the entire Galilee to the Jews and placing our northern border on the Lebanon border. This neighborhood has immense political value, because Lebanon and the Jews are both interested in this neighborhood. The Christians in Lebanon can hardly exist without a Jewish state next to them, and we too are interested in an alliance with Christian Lebanon. b. The proposal of the transfer (relocation) of the Arabs from our valleys. We cannot and are not entitled to propose such a thing, because we never wanted to dispossess the Arabs. But since England is handing over a part of the land, which was promised to us, to an Arab state, it is only fair that the Arabs in our state be transferred to the Arab part.\"\n\n\"The Arabs will have to go, but one needs an opportune moment for making it happen, such as a war.\"\n\nThe reason for the strange internal quotations is likely because this quote is a fabrication. Pappe's quote appears absolutely nowhere, and Ben-Gurion does not say a war is \"necessary\" to expel the Arabs, nor does he mention a war in that sentence or the ones before or after; the quote in fuller context is that, after discussing a hypothetical where the Arab world refuses to allow a Jewish state to be populated by Jews. \n\n\" All of our ambitions are built on the assumption that has proven true throughout all of our activities in the land \\[of Israel\\] — that there is enough room for us and for the Arabs in the land \\[of Israel\\]. And if we will have to use force, not for the sake of evicting the Arabs of the Negev or Transjordan, but rather in order to secure the right that belongs to us to settle there, force will be available to us...We do not want to and we do not have to expel Arabs and take their place.\"\n\nThis fake quotation is a paraphrase by Israeli anti-Zionist Ilan Pappé, which was published in the Journal of Palestine Studies, and attributed to a 1937 letter that Ben Gurion wrote his son.\n\n\"The starting point for a solution of the question of the Arabs in the Jewish State is, in his view, the need to prepare the ground for an Arab—Jewish agreement; he supports \\[the establishment of\\] the Jewish State \\[on a small part of Palestine\\], not because he is satisfied with part of the country, but on the basis of the assumption that after we constitute a large force following the establishment of the state — we will cancel the partition \\[of the country between Jews and Arabs\\] and we will expand throughout the Land of Israel.\n\nMr. Shapira \\[a JAE member\\]: \" By force as well?\"\n\nMr. Ben-Gurion: \" \\[No\\]. Through mutual understanding and Jewish-Arab agreement.\"\n\nThis full quote can be found in Efraim Karsh's \"Falsifying the Record\". The idea was to expand land and the state throughout Palestine by working with the Arabs, not by rejecting partition or using it as a foot in the door.\n\n\" If I knew that it would be possible to save all the children in Germany by transporting them to England, and only half by transporting them to the Land of Israel, then I would opt for the second alternative. For we must weigh not only the life of these children, but also the history of the People of Israel.\"\n\nThis is very well used, so to clear it up, in this context, he's talking about Kristallnacht, during debates within the Zionist movement about how to respond to the growing Nazi threat. If all the Jews were to be taken to Britain, then there is a high chance Jews would have all be murdered because if you know history, Germany was very close to invading England, and Jews were dying in the masses. He was thinking about a permanent solution where Jews can still live.\n\n\" The acceptance of partition does not commit us to renounce Transjordan: one does not demand from anybody to give up his vision. We shall accept a state in the boundaries fixed today, but the boundaries of Zionist aspirations are the concern of the Jewish people, and no external factor will be able to limit them.\"\n\nThis quote, too, is addressed by the above clarification of Ben-Gurion's beliefs. As Karsh talks about with reference to the letter Ben-Gurion sent to his son Amos, which is frequently cited but not actually examined in totality. And again, we are still suffering from opinions made 10 years prior, before the Holocaust and WWII and the like. These things could easily have shifted Ben-Gurion's opinion, especially as he said in 1947:\n\n\" Chairman: \"Do you give preference to a federal State or a partition scheme?\"\n\nBen Gurion: \"We want to have a State of our own, and that State can be federate if the other State or States is or are willing to do so in the mutual interest, on condition that our State is in its own right a Member of the United Nations.\"\n\nNote that he accepts another state in this discussion, indicating favor towards partition and possible federation (i.e. the economic union proposed in UNSCOP). He also says later in his testimony: \n\n\" I will tell you what we told the Government last year and this year while we believe and request that our right, at least to the Western part of Palestine should be granted in full and Western Palestine be made a Jewish State, we believe it is possible. We have a right to it, but we are willing to consider an offer of a Jewish State in an area which means less than the whole of Palestine. We will consider it.\"\n\nNow, note that Ben-Gurion is one of the most prominent leaders in history, but the second-most prominent is not Menachem Begin. It was not Begin who was testifying in front of UNSCOP, it was Chaim Weizmann, who would become the first President of Israel. Weizmann is mentioned by Ben-Gurion in that same testimony.\n\n\" Dr. Weizmann is thought so well of by the Jewish people and occupies such a place in our history and among us that he is entitled to speak for himself without any public mandate.\"\n\nNow, Weizmann is recognized as instrumental in the creation of the Jewish state: he was influential with the United States, well-loved by Jews 'round the world, and a huge leader. The reason Ben-Gurion eclipses him is partially because of Ben-Gurion's leadership of the Histadrut and election as Prime Minister, and partially because Ben-Gurion stayed prominent in politics for a very, very long time, steering the country through everything from the Suez Crisis to the acquisition of arms from the French that helped Israel win in 1967, and he was prominent in commanding forces during the 1948 war. Weizmann was a diplomat and politician but spoke for far more of the Jewish populace than begin. And Weizmann was far more fervent about partition than Ben-Gurion even, as noted by the committee members themselves, who said:\n\n\" I presume that Ben-Gurion has listened to the statement of Dr. Weizmann, which was acknowledged with enthusiastic applause by the public. This statement favors a partition of Palestine into two states.\"\n\nFive days after the UN resolution, on December 3, 1947, Ben-Gurion said in a speech:\n\n\" In our state, there will be non-Jews as well, and all of them will be equal citizens, equal in everything without exception. That is, the state will be their state as well.” Ben-Gurion also called for the implementation of the partition in 1947.\"\n\nHowever, in May 1948, Ben-Gurion rightfully said:\n\n\" We accepted the UN partition, but the Arabs did not. They are preparing to make war on us. If we defeat them and capture western Galilee or territory on both sides of the road to Jerusalem, these areas will become part of the state. Why should we obligate ourselves to accept boundaries that the Arabs don’t accept?\"\n\nConclusion:\n\nThere is no doubt that Zionist leaders were clearly interested in getting more land in the partition. However, they have never stated to conquer the entire Middle East, or Palestine. In their defense, countries, like Britain, promised the Mandate to be a Jewish National Homeland (with continuous Jewish immigration). After the 1929 and 1936, there was shift in British policy, and would later battle the Zionists. \n\nI think it would be hypocritical to not mention Arab leader's ambitions to be the King of Syria like King Abdullah. At the end of the day, he still negotiated with the Jews to not participate in the 48 war (in military terms, not policy). I think if Arab leaders showed interest in negotiating, Zionists would have agreed. The idea that they would still expelled/invaded Arabs with both sides agreeing to peace is just Arab fantasy land. \n\nThough, people like Begin didn't like the partition, because he was a revisionist Zionist, who wanted Jordan to be a Jewish state. However, he was involved with a terrorist group that was hunted by the Hagenah and British. I'm going to be making a post about Britain as well, and their policies. There are a million quotes out there, so comment any I could review! I just wanted to post some about the partition specifically. \n\n",
    "score": 34,
    "num_comments": 78,
    "created_at": "2026-01-18T01:32:18"
  },
  {
    "post_id": "1qfphkt",
    "subreddit": "IsraelPalestine",
    "title": "Why are so many babies being born in Gaza?",
    "selftext": "Two disclaimers!\n\n1. I’m not super knowledgeable on the topic. I’m neither Palestinian or Israeli. I have never been to the Middle East and I do not speak Hebrew or Arabic. So I know that there’s a lot of things I do not understand. I’m asking to get more informed opinions on the topic. \n\n2. I know that life goes on and that people have the right to have children if they want to. I’m not saying that forced sterilisation should happen or anything like that. Please don’t twist my question into a call for people to stop procreating out of a weird racist belief. That’s not what I’m saying at all. \n\nAnyway … on to my question! \n\nI see so many horrific reports of babies and mothers dying in Gaza. Infants being born in active war zones and dying a few days later. So many Palestinian men are talking about their pregnant wives and newborn babies. And it’s horrific. \n\nBut I question these men who keep getting their wives pregnant in an active warzones. I’m guessing that contraception is not as accepted among Palestinians as it seems pretty conservative but the choice to keep impregnating struggling young mothers while everywhere is getting bombed is … kinda horrible? \n\nDoesn’t the safety of your wife take some priority? Or the fear of what could happen during childbirth in a place with limited medical assistance? \n\nIt makes me view all the footage of dying babies quite differently. There’s something exploitative about it. I \n\nAnd I say this as someone who hates to see any women and children suffering. I actively think they are being exploited by Palestinian men and Hamas as martyrs for the international world to see. I don’t see much of an effort to protect women and children or prevent such horrors. \n\nIf you have any opinions, I’d like to hear but please be respectful. I mean no harm towards anyone. ",
    "score": 51,
    "num_comments": 269,
    "created_at": "2026-01-17T21:31:51"
  },
  {
    "post_id": "1qfnxjg",
    "subreddit": "IsraelPalestine",
    "title": "Will the situation in Iran change anything in Gaza?",
    "selftext": "In January 2024 I wrote an opinion called Peace be on Gaza. It suggested that one way to quickly end that war would have been for the Gazans to revolt against Hamas.\n\nThe recent events in Iran where apparently people are willing to risk their lives to overthrow the dictatorship made me think of it. \n\n  \nWhat are the chances the Palestinian in Gaza will be inspired by these events and topple Hamas themselves? ",
    "score": 10,
    "num_comments": 104,
    "created_at": "2026-01-17T20:29:21"
  },
  {
    "post_id": "1qeuv1s",
    "subreddit": "IsraelPalestine",
    "title": "Many Pro-Palestinian protesters arent actually Pro-Palestine. They only want to blame America or Israel or the West for everything.",
    "selftext": "Read this news article : Why the ‘Free Palestine’ crowd goes silent on Iran https://www.afr.com/world/middle-east/why-the-free-palestine-crowd-goes-silent-on-iran-20260114-p5nu0m\n\nYamine Mohammed, a Canadian author of Egyptian and Palestinian background who at 19 was forced into marriage with an Al-Qaeda operative, says progressive left's silence on Iran is a case of mutual convenience.\n\nAn enemy of my enemy is my friend. The Islamic Republic of Iran is anti-Israel, anti-America and anti-West... hence the progressive left embrace Islamic Republic as a \"friend\". Hence the silence when it comes to Iranian people. \n\nThey don’t care about Iranian lives. They don’t care about Yemeni lives. They don’t care about Nigerian lives. They only care if they can blame America or Israel or the West. Their allegiance is to whoever is against them, not to supporting innocent people being killed. \n\nMany pro-Palestinian protesters never knew what they were protesting. They scream about anti-colonialism and then support the ideology that colonised a quarter of the planet.\n\nThey scream about queers for Palestine, not realising homosexuality is punishable by death under sharia law. \n\nI would even argue many progressive left who calls themselves Pro-Palestinian supporters are masqurading to be holier than thou, everyone is equal  but only if it fits their narrative, as long as its anti-Israel, anti-America or anti-West, then its equal, otherwise, it is not equal.\n\nIt took Hamas Ministry of Health 6 weeks into the war to accumulate a death toll of 12,000 casualties which included many Hamas fighters. It only took a few days for Islamic Republic of Iran to kill 12,000 Iranian protesters, all civilians. The silence. The hypocrisy. ",
    "score": 191,
    "num_comments": 241,
    "created_at": "2026-01-16T22:50:33"
  },
  {
    "post_id": "1qetdxc",
    "subreddit": "IsraelPalestine",
    "title": "right-wing zionists",
    "selftext": "as a palestinian non-zionist, i feel that i often share more common ground with left-wing zionists than with right-wing zionists. left-wing zionists (in my opinion) tend to be more willing to criticize israel when israel is wrong, and they show a deeper commitment to the value of human life, regardless of whether responsibility is attributed to hamas.\n\nfrom the original zionist perspective, zionism is the belief in establishing a jewish homeland in their ancestral land, where jews could govern themselves and no longer be subject to antisemitism or violence as they had been for centuries in europe and other parts of the world.\n\n**but my question is specifically for right-wing zionists since these are the kinds of comments i usually see from them:**\n\n\"palestinians are squatters on jewish land\"\n\n\"palestinians are arabs from arabia, jordan, and egypt\" (even though factually most arent and countries like jordan are recent)\n\n\"muslim behavior is the reason for islamophobia\"\n\n\"palestinians are a fake people\"\n\n\"why should palestinians get western treatment when they behave like animals\"\n\nand i can go on with the list.\n\nso right-wing zionists. if you hate the fact that \"zionist\" is used as a slur by many people, if you hate it when people call israel a supremacist state, if you want arabs and people to stop viewing israel as some kind of racist endeavor, etc. why do you say this stuff? im asking out of genuine curiosity. ",
    "score": 19,
    "num_comments": 213,
    "created_at": "2026-01-16T21:51:59"
  },
  {
    "post_id": "1qegiet",
    "subreddit": "IsraelPalestine",
    "title": "why do you think that israel voted against food becoming a human right in 2021?",
    "selftext": "In 2021 this was proposed and the only countries who voted against this were the US (unsurprisingly imo) and israel. I am curious about people’s thoughts on this choice, since i haven’t found it discussed in depth on here before.  I am personally unsurprised by their choice but i especially want to know what people who lean more towards supporting israel think of this decision.",
    "score": 0,
    "num_comments": 121,
    "created_at": "2026-01-16T13:52:29"
  },
  {
    "post_id": "1qeg8so",
    "subreddit": "IsraelPalestine",
    "title": "August 1959: The Day Palestine Was Invented",
    "selftext": "The US State Department (traditionally a hostile entity towards Israel) archives [report a very interesting tidbit:](https://history.state.gov/historicaldocuments/frus1961-63v17/d34)\n\n&gt; At Arab League meeting at Shtaura last August, **decision was made to establish Palestine “personality” or “entity” with implication of Algerian-type movement designed ultimately to eliminate Israel.** While longer range plans include military organization and Palestine government, Arabs apparently plan take steps gradually.\n\nThis is a follow up to their proposed plan in March 1959 in favor of [“reorganizing the Palestinian people and bringing it forward as an entity.\"](https://www.palquest.org/en/overallchronology?show=intro&amp;sideid=5682)\n\nNotice that the purpose of this establishment was not to establish a Palestinian state in the West Bank and Gaza or to resolve the refugee crisis, but to use the concept of a Palestine entity as a method of destroying Israel. \n\nAs every honest person knows, there was no political entity of Palestine prior to this date and for over a decade after the 1948 war, the Arab states had no interest in establishing one. But when it became clear that simply destroying Israel through military means was no longer an option, the Arab League pivoted to an \"Algerian-type movement\", shifting the conflict from Arab nationalists taking over the land of the indigenous Jewish people to an \"anti-colonial\" one along the lines of the Algerians fighting the French. \n\nThis policy created by the Arab League was reinforced by [the PLO Phased Plan](https://en.wikipedia.org/wiki/PLO%27s_Ten_Point_Program), a plan that has never been revoked or changed, in which the goal is the destruction of Israel through any means necessary.\n\nThe creation of a Palestinian entity was and always has been politically anti-Israel, not for human rights or self-determination or any of that other stuff. ",
    "score": 48,
    "num_comments": 202,
    "created_at": "2026-01-16T13:41:36"
  },
  {
    "post_id": "1qe7jn7",
    "subreddit": "IsraelPalestine",
    "title": "The Ethical and Geopolitical Implications of the Iranian Protests that the General Public is Ignoring",
    "selftext": "The current protest in Iran threatening the Islamic Republic Regime is the most inspiring geopolitical event of the 21st century.\n\nUnfortunately we live in a world where hard leftists (particularly democratic socialists) and the so-called \"woke right\" don't seem to care.  They'll scream about freeing Palestine from \"the river to the sea\" (a pejorative term and call for destruction of jews and Israelis by the way), but I only hear radio silence on this issue.\n\nNon-interventionalism is a core tenant of my political beliefs (left-leaning libertarian) but I break with that belief when it comes to gross human rights violations.  The wars in Iraq/Afghanistan/Vietnam etc. were obvious failures for example, but we have a duty as Americans to support the toppling of the Iranian regime (similarly to why fighting the Nazis was an imperative intervention).  \n\nThey have oppressed the Iranian people since the Islamic Revolution of 1979.  For the moronic liberals who dont seem to care, there are many examples of the persecution the people over there are facing.  For example, gay rights don't exist under the Islamic Republic.  At best gay people are subjected to flogging (100 lashes), imprisonment, and torture.  At its worst, they are subjected to hanging from cranes, lynchings, sexual torture, or forced hormonal and surgical transitions to the opposite sex.  Women are also treated as second class citizens.\n\nIt does make me wonder whether radical leftists are simply ignorant (a common problem), or alternatively, just as insidious as the \"America first\" woke right.  Based on their views on Israel, I'm inclined to believe its the latter.\n\nLet's not forget the additional benefits regarding the fall of the Islamic Republic: if the head of the snake is cut off, the Houthis of Yemen, Hezbollah of Lebanon, Hamas of Gaza, etc. will fall as well without the support of the regime.  There will be an unprecedented shift toward peace and prosperity across the middle east as a whole.\n\nThe Iranian people are taking back their country from the IRGC and Ayatollah Khomeini; it's unbelievably admirable that they are successfully doing it on their own, but we owe them our support.  Jews and Persians have been friends for over 2,700 years. The United States and (especially) Israel have a duty to intervene in Iran and support His Imperial Majesty, the Shahanshah of Iran, Reza Pahlavi and his vow to make Iran a democracy.\n\nAs they say, \"prove me wrong\" in the comments if you'd like to try.  My guess is that the radical leftists and woke right didn't understand most of my post anyway, so you're already at a disadvantage 😉.",
    "score": 5,
    "num_comments": 92,
    "created_at": "2026-01-16T05:35:03"
  },
  {
    "post_id": "1qe5iay",
    "subreddit": "IsraelPalestine",
    "title": "Seeing how the Pro-Palestine people are silent on Iran actually make me feel a bit better",
    "selftext": "For a long time, I thought that Pro-Palestinian protesters legitimately thought they cared about Palestinians because they genuinely cared about oppressed people around the world and wanted them to have rights. Obviously they were ignorant and naive, but at least they thought that. It was kind of maddening, seeing such morally self righteous people support such obviously bigotry and violence.\n\nBut seeing them ignore Iranian protests, and in some cases, actually support the Iranian government, I am realizing that the core of the movement never even thought they cared about oppressed people. 12,000, perhaps 20,000 people killed in a matter of days, by an oppressive government, (and unlike the horrifying events in Sudan and Yemen, FULLY in Western new) and not a peep from them.\n\nI realize now that they knew full well these were just buzzwords they were using because they were having a good time attacking their symbolic villain, the country full of \"what just so happens to be full of Jews, what a weird coincidence, that has nothing to do with my obsession at all even though I only and exclusively obsess over the one Jewish country.\"\n\nI wonder, are Pro-Palestinians on the fringes of the movement who were ignorant about the motives of the core starting to realize that the movement has nothing to do with human rights? Have they started to ask each other \"Wait a minute, why aren't we protesting this?\" Or is their need to please their community so strong, they are simply going to put this out of their minds? Either way, they can't be totally ignorant about it anymore. If they were simply naive in the past, they know better now.\n\nI'm upset that the Iranian people aren't getting more support. But it is something of a relief to know that deep down, Pro-Palestinians know they aren't part of a human rights movement.\n\nNote: Palestinian Pro-Palestinian protesters are an exception to this rule, as fairly pointed out by a Palestinian in another post. They are openly fighting for themselves, not for human rights generally.",
    "score": 188,
    "num_comments": 537,
    "created_at": "2026-01-16T03:52:17"
  },
  {
    "post_id": "1qdwkz1",
    "subreddit": "IsraelPalestine",
    "title": "Iranian Revolution would change Middle East forever",
    "selftext": "Iran is a huge country with a population of eighty million people. It has vast oil reserves. It has influence beyond its borders in neighboring countries with blood or culture ties to Iran. It was once a global power. Even today, it is a major regional power. However, it is not working out very well. \n\nRegime change can change it all. \n\nIranians don’t hate Israel. They aren’t Arab, so they don’t really care. Shiite Islam doesn’t even believe that Jerusalem is the third holiest place. In any case, many Iranians are secular. Many of them are Azeris or Kurds. Indeed, close to a third of Iranian are either Azeri or Kurdish. Azerbaijan is the friendliest Muslim state for Israel. Kurdistan remains unrecognized but it’s also quite friendly to Israel. Secular Persians in the cities are also famously friendly towards Israel. \n\nIran and Israel would be close allies in a normal world. Both have a history of hostility with the neighboring Arabs. Both have been allies in the past actually. They have a shared political interest. There’s a lot of political potential for a new Israeli, Iranian, and Emirati axis. \n\nThis new axis would counteract Turkey, another huge country in the Middle East who’s not Arab. The Turks are trying to take over, but they aren’t that great. Turkey and Qatar support the Muslim brotherhood, an Islamic Sunni movement who remains a fellow jihadi traveler of the Shiite radicals. Realigning the Middle East away from this Turkish Qatari axis towards an Israeli Iranian axis would dramatically change things for the better. \n\nSaudi Arabia would remain stuck between the two sides, struggling to decide whether it wants to become a Turkey (ie a two faced Islamic regime playing a double game) or become something new. So far, we’ve seen a mixed signals from the Saudis. \n\nThe Iranian regime is very weak. It lost all legitimacy. The war with Israel showed its military is a paper tiger unable to defend Iran’s most sensitive military installations from Israeli strikes. Its ballistic missiles have done damage, but only minimal damage. It lost its nuclear program. Its proxies have been severely mutilated. \n\n People smell the weakness because it was laid bare for everyone to see. For decades we’ve been told that Iran is so strong a war with it would cost many lives on the Israeli and American side. We see now that this was just not true. They are in fact very weak. \n\nAnd also very stupid. They have diverted billions from the economy towards a military buildup that proved absolutely useless. Spending so much on such a useless military project is only one of many stupid decisions taken by the evil regime. \n\nThe Middle East and the rest of the world have nothing but good things to gain from the collapse of this regime. It’s the best chance to create real lasting change in the Middle East. \n\n",
    "score": 41,
    "num_comments": 162,
    "created_at": "2026-01-15T21:34:36"
  },
  {
    "post_id": "1qd7n4v",
    "subreddit": "IsraelPalestine",
    "title": "How do people think Israel is in the wrong?",
    "selftext": "Correct my statements if they are wrong as I am still learning about the war.\nFrom what I know, Britain promised the region to the Jews and the Arabs at the same time, of course this will start a war! How would that be Israel’s fault for coming back to their ancestral homeland when the owner of the land tells you that you can have it? Despite this Israel tries to have a 2 state solution 4 different times. Palestine denies it every time and starts wars with Israel. Israel wins every time and Palestine loses land because of it. Again I ask, how does that make Israel the bad guy?\n\nTo add on, Israel’s ideology is not kill all Palestinians and their civilians, however the power in Palestine (Hamas) wants to kill all Jews and their civilians. In 2005 they give Palestine gaza and what happens? Hamas uses it to build miles of tunnels and send hundreds or thousands of missiles to Israel. On October 7th 3,000 Hamas members come into Israel and burn babies and r**e women. Israel starts bombing Hamas who have built their operations in with the civilians, and civilians die. Is it also true that 90% of deaths in modern urban warfare are civilian deaths, according to Hamas around 80% of deaths in gaza are civilian. A good amount of this was also done by Hamas but they don’t seem to mention that in their numbers, strange right?\n\nIf the leaders of the country next to mine wanted to kill all my civilians then I would take their country to make sure they couldn’t rebuild and try it again. What would you have done if you were Israel?",
    "score": 19,
    "num_comments": 374,
    "created_at": "2026-01-15T02:45:18"
  },
  {
    "post_id": "1dph3cc",
    "subreddit": "IsraelUnderAttack",
    "title": "Spain's leftist government blood libel-accuses Israel of \"genocide\" ? They need a mirror instead",
    "selftext": "",
    "score": 10,
    "num_comments": 12,
    "created_at": "2024-06-27T03:00:52"
  },
  {
    "post_id": "1dpel13",
    "subreddit": "IsraelUnderAttack",
    "title": "Jamaal Bowman’s Defeat Is a Fatal Blow to the Anti-Israel Left",
    "selftext": "",
    "score": 29,
    "num_comments": 5,
    "created_at": "2024-06-27T00:53:17"
  },
  {
    "post_id": "1dpd3ub",
    "subreddit": "IsraelUnderAttack",
    "title": "No famine in Gaza, previous assumptions were wrong, though risk remains, key report by UN-linked group finds",
    "selftext": "",
    "score": 21,
    "num_comments": 0,
    "created_at": "2024-06-26T23:41:25"
  },
  {
    "post_id": "1doivrn",
    "subreddit": "IsraelUnderAttack",
    "title": "Who do not want peace? It is more than obvious",
    "selftext": "",
    "score": 18,
    "num_comments": 1,
    "created_at": "2024-06-25T22:33:41"
  },
  {
    "post_id": "1doay64",
    "subreddit": "IsraelUnderAttack",
    "title": "Well done",
    "selftext": "",
    "score": 1,
    "num_comments": 0,
    "created_at": "2024-06-25T17:00:36"
  },
  {
    "post_id": "1do7o60",
    "subreddit": "IsraelUnderAttack",
    "title": "Simple as such",
    "selftext": "",
    "score": 37,
    "num_comments": 1,
    "created_at": "2024-06-25T14:41:59"
  },
  {
    "post_id": "1do6onc",
    "subreddit": "IsraelUnderAttack",
    "title": "Lest we forget –",
    "selftext": "",
    "score": 19,
    "num_comments": 1,
    "created_at": "2024-06-25T13:59:19"
  },
  {
    "post_id": "1dnbijw",
    "subreddit": "IsraelUnderAttack",
    "title": "Bring them home –",
    "selftext": "",
    "score": 15,
    "num_comments": 1,
    "created_at": "2024-06-24T11:46:43"
  },
  {
    "post_id": "1dn0wcf",
    "subreddit": "IsraelUnderAttack",
    "title": "The earliest mentions",
    "selftext": "",
    "score": 16,
    "num_comments": 1,
    "created_at": "2024-06-24T00:45:22"
  },
  {
    "post_id": "1dmnctu",
    "subreddit": "IsraelUnderAttack",
    "title": "Israeli’s: What happened to the Israeli Invincibility?",
    "selftext": "Throughout my research of the past Arab-Israeli wars, I remember reading about the Israel that won in 1948 and the stunning dominance over multiple arab countries in 1967. \n\nThe 1973 Yom Kippur war was stunning in of itself but despite the harsh first few weeks, Israel managed to still win. The IDF has the best up to date technology that any country can have. \n\nHowever, this type of Israel-Gaza war is entirely different. Gaza is choked off with a blockade from both Egypt and Israel, land, sea, and there are restrictions as much as possible. No one and I mean no one could have expected Hamas to pull off what it pulled off in October. How can Israel allow Hamas to dictate the terms and deal of a so called ceasefire? How did Israel defeat Egypt, Syria, Jordan in past wars but can’t defeat Hamas? I see that Hezbollah and Israel might go to war, and there may thousands of iran backed fighters entering Lebanon to fight. What the heck happened to Israel Invincibility? This is a serious question and I don’t pick sides here.",
    "score": 0,
    "num_comments": 4,
    "created_at": "2024-06-23T14:27:30"
  },
  {
    "post_id": "1dkrvx0",
    "subreddit": "IsraelUnderAttack",
    "title": "Western Hamasniks must come to terms with Israel’s existence",
    "selftext": "",
    "score": 12,
    "num_comments": 0,
    "created_at": "2024-06-21T01:16:13"
  },
  {
    "post_id": "1dk0rn9",
    "subreddit": "IsraelUnderAttack",
    "title": "Israel-haters, master liars",
    "selftext": "",
    "score": 23,
    "num_comments": 0,
    "created_at": "2024-06-20T02:21:03"
  },
  {
    "post_id": "1djuyvq",
    "subreddit": "IsraelUnderAttack",
    "title": "Hezbollah threatens war against Cyprus if it helps Israel",
    "selftext": "",
    "score": 6,
    "num_comments": 0,
    "created_at": "2024-06-19T21:44:41"
  },
  {
    "post_id": "1djgrw0",
    "subreddit": "IsraelUnderAttack",
    "title": "Well said",
    "selftext": "",
    "score": 7,
    "num_comments": 0,
    "created_at": "2024-06-19T11:24:42"
  },
  {
    "post_id": "1djcmfq",
    "subreddit": "IsraelUnderAttack",
    "title": "Prophecy Of A Severe Earthquake Coming To Strike The Temple Mount In Israel - June 6, 2024",
    "selftext": "",
    "score": 0,
    "num_comments": 0,
    "created_at": "2024-06-19T06:41:51"
  },
  {
    "post_id": "1dj7837",
    "subreddit": "IsraelUnderAttack",
    "title": "The more they boycott, the more we support 🇮🇱",
    "selftext": "",
    "score": 6,
    "num_comments": 0,
    "created_at": "2024-06-19T01:28:54"
  },
  {
    "post_id": "1dj6sbm",
    "subreddit": "IsraelUnderAttack",
    "title": "No wonder those Western academic Marxists concentrated in humanities' departments are getting so mad",
    "selftext": "",
    "score": 13,
    "num_comments": 0,
    "created_at": "2024-06-19T01:06:42"
  },
  {
    "post_id": "1dj25wk",
    "subreddit": "IsraelUnderAttack",
    "title": "God bless them. Salute –",
    "selftext": "",
    "score": 9,
    "num_comments": 0,
    "created_at": "2024-06-18T21:33:01"
  },
  {
    "post_id": "1diu1q9",
    "subreddit": "IsraelUnderAttack",
    "title": "Western academic Marxists concentrated in the faculty of humanities simply ignore it because of their hatred of Jews",
    "selftext": "",
    "score": 16,
    "num_comments": 0,
    "created_at": "2024-06-18T15:54:17"
  },
  {
    "post_id": "1dito9g",
    "subreddit": "IsraelUnderAttack",
    "title": "Extremist Islamist group infiltrates Australia’s pro-Palestine movement",
    "selftext": "",
    "score": 20,
    "num_comments": 5,
    "created_at": "2024-06-18T15:37:57"
  },
  {
    "post_id": "1qh86v9",
    "subreddit": "Palestine",
    "title": "“Alongside radical Islamist elements” and the people on the picture are a couple of white men and women, teenagers and two hijabis. Also why should anti-Israel protests be banned in Australia in the first place?",
    "selftext": "",
    "score": 112,
    "num_comments": 7,
    "created_at": "2026-01-19T16:04:50"
  },
  {
    "post_id": "1qh7znt",
    "subreddit": "Palestine",
    "title": "Israeli settler attempts to prevent the Abu Hammam family from accessing their property",
    "selftext": "",
    "score": 20,
    "num_comments": 1,
    "created_at": "2026-01-19T15:57:57"
  },
  {
    "post_id": "1qh840f",
    "subreddit": "IsraelPalestine",
    "title": "Risk Iran is Facing.",
    "selftext": "Hey there! As an ethnic Iranian I would just want to give my concern on the current situation.\n\nI fully support these, as an Iranian Muslim culturally, we are not just Muslims, we are jews, zoroastrians, and many more. Religiously, extremism like this isn't allowed and culturally we are free people.\n\nNot my main concern. My main concern is, And I say this with no offense to any americans or jewish people. My concern is majority of the people have been pushing for Reza Pahlavi, The former shah's son to be the new leader. But this is where I stop supporting him, He has very close ties with Israel and the United States. Which I don't care about, they are good allies but it seems suspicious why only him? A person with close ties to the USA and Israel? It would make sense if they want Iran because of it controlling many prominent things like strong military wise, and Iran controls the northern coast of the Strait of Hormuz with (coincidently) allows 20% of the world's oil to flow through. And not minding the large natural gas and oil reservers.\n\n  \nI want the freedom, We deserved it. But I don't like the fact that our best option of a leader has close ties to USA and Israel. Same thing with why has the US only taken over Venezuela? Coincidently  they want to run Venezuela when it has the largest oil reserves in the world. Thank you for listening. I just wanted to get this off my chest because if that is gonna be the case, this is a lose-lose situation for the Iranian people.\n\n  \nBefore you attack me, Please take into consideration the consequence of this leader being selected.",
    "score": 3,
    "num_comments": 3,
    "created_at": "2026-01-19T16:02:06"
  },
  {
    "post_id": "1qh86v9",
    "subreddit": "Palestine",
    "title": "“Alongside radical Islamist elements” and the people on the picture are a couple of white men and women, teenagers and two hijabis. Also why should anti-Israel protests be banned in Australia in the first place?",
    "selftext": "",
    "score": 133,
    "num_comments": 7,
    "created_at": "2026-01-19T16:04:50"
  },
  {
    "post_id": "1qh7znt",
    "subreddit": "Palestine",
    "title": "Israeli settler attempts to prevent the Abu Hammam family from accessing their property",
    "selftext": "",
    "score": 25,
    "num_comments": 1,
    "created_at": "2026-01-19T15:57:57"
  },
  {
    "post_id": "1qh4o79",
    "subreddit": "Palestine",
    "title": "Luis Hamilton pared with red crescent meets injured palatenians",
    "selftext": "",
    "score": 865,
    "num_comments": 26,
    "created_at": "2026-01-19T13:51:41"
  },
  {
    "post_id": "1qh2yy4",
    "subreddit": "Palestine",
    "title": "The \"Gaza Board of Peace\" is a joke and a desperate attempt to save the already dead PR of the US and Israel",
    "selftext": "I spent 5 hours researching about this, so reading the entire thing would be appreciated :D\n\nIf you have all followed the current events, you probably have seen the list of members thet Trump has assigned for the Gaza Board of Peace, a board that supposedly was made to supervise and manage the reconstruction plan in Gaza. Cool, right? Reconstruction, no more rubble, all aid in... \\*\\*WRONG\\*\\*\n\nSeriously, take a closer look at the members and you will realise just how fucked up this is - it looks like less of a peaceful board that is supposed to govern Gaza and more of a private equity firm and tycoon... \n\nHere is the source that the peace board is being established: \\[The Guardian](https://www.theguardian.com/us-news/2026/jan/16/trump-gaza-board-rubio-blair?hl=en-GB) ... now let is look at some of the actual members, as they are quite problematic for a couple reasons:\n\n1. Marc Rowan - has 9 billion in net worth, and is the CEO of Apollo, one of the world's largest equity firms. \\[Source: Forbes\\](https://www.forbes.com/profile/marc-rowan/?hl=en-US)\n\n2. Steve Witkoff - a well known real estate enthusiast with 2 billion dollars in net worth. \\[Source: Forbes\\](https://www.forbes.com/profile/steven-witkoff/?hl=en-US)\n\n3. Jared Kushner - a real estate heir and investor, whose net worth recently crossed the 1 billion mark. \\[Source: Newsseek\\](https://www.newsweek.com/jared-kushner-joins-billionaire-club-donald-trump-2131421?hl=en-US)\n\n4. Ajay Bonga - the former CEO of Mastercard, and the current president of the World Bank, with around 300 million dollars in net worth. \\[Source: World Bank's official page\\](https://www.worldbank.org/ext/en/who-we-are/leadership/ajay-banga), and \\[some insights on his Mastercard background\\](https://investor.mastercard.com/investor-news/investor-news-details/2010/MasterCard-Names-Ajay-Banga-President-and-Chief-Executive-OfficerSucceeding-Robert-W-Selander/default.aspx)\n\nAnd a fifth bonus, although he is not a real estate mogul like the rest of the people on here: Marco Rubio (I do not need to explain much - you all have seen his fierce support for Israel over the last 51 months) \n\nSide note: we all have noticed how the \"peace board\" lacks any Palestinians and Arabs on board, right? This alone should be beyond telling, as not allowing the OG land owners to participate in the first place is wild. You know what, forget about the Palestinians foe the sake of this argument - \\*\\*why are there no Arabs in this board, and why did Trump monetise the remaining seats of the Board of \"Peace\" if reconstructing Gaza without Hamas being a part of it was really his intention?\\*\\*\n\nThe part that I find the wildest is the fact that Trump monetised the vacant seats in the \"board of peace\" for 1 billion dollars, and no, \\[I swear i wish this was a lie\\](https://www.reuters.com/world/middle-east/trumps-gaza-peace-board-charter-seeks-1-billion-extended-membership-document-2026-01-18/). It was first reported by Bloomberg and picked up by Reuters.",
    "score": 253,
    "num_comments": 9,
    "created_at": "2026-01-19T12:33:53"
  },
  {
    "post_id": "1qh2led",
    "subreddit": "Palestine",
    "title": "They still walk free…",
    "selftext": "January 29, 2024 - Red Crescent volunteers receive and emergency call. A five-year old is trapped in a car under fire in Gaza by IOF soldiers, pleading for her rescue. While trying to keep her on the line, they do everything they can to get an ambulance to her. Her name was Hind Rajab. \n\nThis movie is about her story, it’s called The Voice of Hind Rajab. Never stop demanding justice. ",
    "score": 93,
    "num_comments": 2,
    "created_at": "2026-01-19T12:14:56"
  },
  {
    "post_id": "1qh0ufz",
    "subreddit": "Palestine",
    "title": "This is Zionism",
    "selftext": "",
    "score": 378,
    "num_comments": 11,
    "created_at": "2026-01-19T10:38:32"
  },
  {
    "post_id": "1qh0rn9",
    "subreddit": "Palestine",
    "title": "Germans, famously known for identifying and countering fascism",
    "selftext": "",
    "score": 1008,
    "num_comments": 67,
    "created_at": "2026-01-19T10:34:00"
  },
  {
    "post_id": "1qgz8xp",
    "subreddit": "Palestine",
    "title": "The story of a Palestinian man",
    "selftext": "via tawakul sabr on Instagram",
    "score": 461,
    "num_comments": 6,
    "created_at": "2026-01-19T09:01:36"
  },
  {
    "post_id": "1qgytaz",
    "subreddit": "Palestine",
    "title": "Petition - Support and endorse Kairos Palestine II A Moment of Truth: Faith in a Time of Genocide.",
    "selftext": "The Global Kairos For Justice Coalition started a petition calling for support of Kairos Palestine II, a document by Palestinian Christian leaders speaking out against the genocide in Gaza and other injustices in the Holy Land.\n\n  \n",
    "score": 37,
    "num_comments": 2,
    "created_at": "2026-01-19T08:35:03"
  },
  {
    "post_id": "1qgnao7",
    "subreddit": "Palestine",
    "title": "Activists launch global campaign for Palestinian hostages held by the Zionist occupation",
    "selftext": "Red Ribbons Campaign aims to draw attention to more than 9000 Palestinians held in Israeli prisons, including more than 400 children.",
    "score": 541,
    "num_comments": 4,
    "created_at": "2026-01-18T23:07:38"
  },
  {
    "post_id": "1qgmua0",
    "subreddit": "Palestine",
    "title": "Palestinian man uses a sieve to recollect his family's remains following bombing",
    "selftext": "",
    "score": 136,
    "num_comments": 1,
    "created_at": "2026-01-18T22:49:13"
  },
  {
    "post_id": "1qgmtea",
    "subreddit": "Palestine",
    "title": "Palestinian confronts settlers who released their livestock onto citizens’ lands",
    "selftext": "",
    "score": 76,
    "num_comments": 2,
    "created_at": "2026-01-18T22:48:15"
  },
  {
    "post_id": "1qglhoh",
    "subreddit": "Palestine",
    "title": "NFL fines Texans linebacker Azeez Al-Shaair $11,593 for wearing eye black reading “stop the genocide.”",
    "selftext": "",
    "score": 4861,
    "num_comments": 85,
    "created_at": "2026-01-18T21:56:11"
  },
  {
    "post_id": "1qgksjl",
    "subreddit": "Palestine",
    "title": "Gavin Newsom denies the genocide in Gaza",
    "selftext": "Source: Gavin Newsom Podcast",
    "score": 1629,
    "num_comments": 153,
    "created_at": "2026-01-18T21:27:58"
  },
  {
    "post_id": "1qgjraw",
    "subreddit": "Palestine",
    "title": "Last night: Settler pogrom in East Ramallah, four hospitalised. Almost every house in the Palestinian village of Mukhmas has been burned to the ground.",
    "selftext": "",
    "score": 335,
    "num_comments": 2,
    "created_at": "2026-01-18T20:42:10"
  },
  {
    "post_id": "1qgiz3k",
    "subreddit": "Palestine",
    "title": "The world failed Palestinians",
    "selftext": "Just wanted to say as a Canadian, i'm so fucking disgusted about what's been happening right under EVERY country's eyes. We all seen the Childrens starving, civilians getting bombed and sniped in their house. I'm so sad, literally crying right now after seeing a video of a kid failing to collect any food and going back home to his mom with his pot empty.\n\nIt's 2026 how can we fail humanity this badly. I'm embarassed and ashamed that i'm writing this shit from the comfort of my home.These IDF soldiers have their cell phones with them and have been showing off on social media enjoyment bombing and killing innocents. True psychopaths, no methods to avoid Innocent's deaths. I DONT UNDERSTAND HOW THE WORLD WONT PUNISH THEM.\n\nI hope every single leader, Eu , america , asia, realise they have blood on their hands and are complicit to the murder of 10s of thousands of innocents. True number are realistically in 100s of thousands of child and civilians. Embarassing truly, feeling so powerless.",
    "score": 847,
    "num_comments": 18,
    "created_at": "2026-01-18T20:11:25"
  },
  {
    "post_id": "1qgi37v",
    "subreddit": "Palestine",
    "title": "Zionist Orthodox Union (OU) rabbi claims their reality is \"fundamentally different\" when it comes to their enormous destruction.",
    "selftext": "Additional \"we have every right to sing in light of the Gazans' suffering\" since we can see ourselves as good unlike the rest of the entire world.\n\nThese are the guys that have the OU kosher certifications, unfortunately.\n\n\\[[https://www.ou.org/from-ma-nishtana-to-ma-nishtanu-we-are-different/\\](https://www.ou.org/from-ma-nishtana-to-ma-nishtanu-we-are-different/)](https://www.ou.org/from-ma-nishtana-to-ma-nishtanu-we-are-different/%5D(https://www.ou.org/from-ma-nishtana-to-ma-nishtanu-we-are-different/))",
    "score": 90,
    "num_comments": 8,
    "created_at": "2026-01-18T19:37:39"
  },
  {
    "post_id": "1qghyt6",
    "subreddit": "Palestine",
    "title": "Israeli occupation soldiers prevent a young girl from returning to her home.",
    "selftext": "",
    "score": 823,
    "num_comments": 10,
    "created_at": "2026-01-18T19:32:49"
  },
  {
    "post_id": "1qgf5v8",
    "subreddit": "Palestine",
    "title": "Footage of an Israeli paramedic participating in the arrest of a Palestinian in Hawara, occupied Palestine. Not only Israeli paramedics routinely deny treatment to injured Palestinians or delay medical care, they also operate as instruments to enforce apartheid.",
    "selftext": "",
    "score": 486,
    "num_comments": 15,
    "created_at": "2026-01-18T17:49:20"
  },
  {
    "post_id": "1qgefnu",
    "subreddit": "Palestine",
    "title": "Source: Azeez Al-Shaair fined for 'stop the genocide' eye black",
    "selftext": "I know this will get taken down but let’s all buy his jersey!!!",
    "score": 252,
    "num_comments": 7,
    "created_at": "2026-01-18T17:21:50"
  },
  {
    "post_id": "1qh840f",
    "subreddit": "IsraelPalestine",
    "title": "Risk Iran is Facing.",
    "selftext": "Hey there! As an ethnic Iranian I would just want to give my concern on the current situation.\n\nI fully support these, as an Iranian Muslim culturally, we are not just Muslims, we are jews, zoroastrians, and many more. Religiously, extremism like this isn't allowed and culturally we are free people.\n\nNot my main concern. My main concern is, And I say this with no offense to any americans or jewish people. My concern is majority of the people have been pushing for Reza Pahlavi, The former shah's son to be the new leader. But this is where I stop supporting him, He has very close ties with Israel and the United States. Which I don't care about, they are good allies but it seems suspicious why only him? A person with close ties to the USA and Israel? It would make sense if they want Iran because of it controlling many prominent things like strong military wise, and Iran controls the northern coast of the Strait of Hormuz with (coincidently) allows 20% of the world's oil to flow through. And not minding the large natural gas and oil reservers.\n\n  \nI want the freedom, We deserved it. But I don't like the fact that our best option of a leader has close ties to USA and Israel. Same thing with why has the US only taken over Venezuela? Coincidently  they want to run Venezuela when it has the largest oil reserves in the world. Thank you for listening. I just wanted to get this off my chest because if that is gonna be the case, this is a lose-lose situation for the Iranian people.\n\n  \nBefore you attack me, Please take into consideration the consequence of this leader being selected.",
    "score": 4,
    "num_comments": 3,
    "created_at": "2026-01-19T16:02:06"
  },
  {
    "post_id": "1qh3nc6",
    "subreddit": "IsraelPalestine",
    "title": "Early Zionist Militias",
    "selftext": "I keep seeing this “argument” online that criticizing Hamas isn’t legitimate because “early Zionist militias were terrorists too.” It’s one of those claims that sounds clever until you unpack it. First off, when does a liberation movement become a “terrorist” organization? There’s no single, universally accepted legal definition. Generally, terrorism is framed as the use of violence against civilians to achieve political goals—but even that is debated depending on context and perspective. So yes, labeling groups is highly subjective.\n\nPeople also extend this logic to the IDF, claiming it’s “terrorist” because it evolved from militias like the Haganah or Irgun. This argument is sloppy at best. Early militias operated in a very different historical and political context: under British Mandate, against hostile forces, in a pre-state environment. Israel’s formal army is a recognized state institution, accountable (at least in principle) to laws and government, unlike insurgent militias operating outside any legal framework.\n\nThe underlying problem with the “both sides did it” approach is that it conflates historical context with contemporary morality. Criticizing Hamas today is about actions in the present, not the imperfect past of another group. History informs ethics, but it doesn’t provide carte blanche to excuse ongoing acts of violence. The reality is messy: legitimacy, terrorism, and liberation aren’t black-and-white—they’re always filtered through perspective, power, and law.\n\nIn short, appealing to early Zionist militias to deflect criticism of Hamas is a weak analogy. Context matters, and historical actions don’t erase present-day responsibilities.",
    "score": 13,
    "num_comments": 66,
    "created_at": "2026-01-19T13:06:22"
  },
  {
    "post_id": "1qgugiq",
    "subreddit": "IsraelPalestine",
    "title": "The two kinds of antizionist justification: They hate Israel for Who Israelis are V. what Israel does",
    "selftext": "I've found that, when you boil it down, there are basically two kinds of justification for antizionism. When an anti-Zionist starts out with one reason and argues with a Zionist and gets out-argued, they typically switch to the other reason.\n\n**1. Israel is bad because of who Jews are**\n\nThis is your basic settler-colonizer buzzword sandwich. Following this logic, Israel is bad because Jews are foreign European people who have no right to be in the Levant in the first place, and certainly no right to seek self determination there.\n\nTherefore, everything the true locals (Palestinians) do --- however much they murder, rape, displace Jews --- is justified, because they are getting rid of this fundamental evil that was never supposed to be there in the first place. Whatever Israelis do is wrong. Israelis cannot possibly do anything in self defense or response to aggression, because their very existence is offensive in the first place. Palestinians are allowed to kill Israelis, and Israelis are not allowed to fight back.\n\n**Where it falls apart:**\n\nThis argument falls apart because Jews are indigenous to Israel. They were displaced and taken away on slave ships, and after getting persecuted and displaced more, they finally returned to their ancestral homeland.\n\nAnyone who thinks an indigenous people should not return to their homeland and try to claim self determination there would have to say that Native Americans have no right to a land back movement, or displaced Palestinians for that matter have no right to go to Israel. Unless they choose some arbitrary number of years for an \"indigenous rightful owner\" to magically turn into a \"foreigner colonizer\", but ask them to give a specific number of years that isn't arbitrary, and they can't do it.\n\nSo when they realize this, they switch to point #1 with some transition line like \"Well, the problem isn't that Jews came back to Israel, the problem is that they displaced/killed so many Palestinians in the process!\"\n\n**2. Israel is bad because of what it does**\n\nThis is your basic genocide apartheid ethnic cleansing buzzword sandwich. Following this, the idea of Jews seeking self determination in their homeland was okay, but the problem is that those Jews turned out to be evil people who displace and murder peaceful Palestinians.\n\n**Where it falls apart:**\n\nThis falls apart because both Jews and Arabs engaged in violence against each other (and Arabs started each new round of the violence.). Pro-Palestinians basically have to leave out half the story.\n\nArabs started murdering and displacing Jews in the 1920s, long before Jews started responding by attacking them back. This pattern continued for the whole conflict: In 1948, Palestinian Arabs were offered their own country for the first time ever. Plus, Jews offered Arabs full citizenship and equal rights in Israel. Arabs responded by starting a war. Similar numbers of Palestinians and Jews were killed in that war. As the decades went on, the pattern continued: Arabs would attack first, and Israelis would fight back.\n\nPalestinians are in a worse situation than Israelis now because they keep starting wars and losing them, not because Israelis are somehow more brutal in their fighting (you could make an argument that Israel was less brutal up until a few years ago but more brutal in this particular war, but I've yet to hear a Pro-Palestinian make that argument).\n\nSo when Pro-Palestinians realize this argument is worthless, they switch to point 1 with some transition line like \"Well, the Palestinians are just fighting back against settler-colonizers!\"",
    "score": 11,
    "num_comments": 98,
    "created_at": "2026-01-19T04:34:19"
  },
  {
    "post_id": "1qglv7m",
    "subreddit": "IsraelPalestine",
    "title": "History Education - The Missing Element",
    "selftext": "I am not Jewish or evangelical Christian. I am a very passionate friend of Israel and the Jewish people. But I wasn't always that way...\n\nFor most of my life I was what I would call a \"non-Zionist.\" A person who really doesn't care strongly either way... Like perhaps Israel has some good and bad points and maybe Hamas has some good and bad points and they both need to stop fighting...\n\nThis is DESPITE having Jewish friends basically my entire life...\n\nAs a long term friend of Israel and Jewish people, I can say, that where the pro-Israel movement has failed in using its strongest weapon, which is simply true and unvarnished history. Not only in defending the position of the Jewish people and the world's only Jewish state, but in educating young people, but especially young Jews...\n\nIsrael and the Jewish people have made a LOT of mistakes throughout history. The prestate militias made a LOT of mistakes. We can't and there is no reason to hide from these. But while expressing regret for such mistakes and missteps, it is important that both Jews and non-Jews understand history from a 360 degree perspective... I do not in any way excuse or explain away any current or past mistakes.\n\nBut when a person has a FULL understanding of history, both the good and bad, it is obvious that Israel and the Jewish people are FAR, FAR more humane than ANY group of random people would have been facing the same situations and provocations and that is why I am myself pro-Israel and feel strongly about it.\n\nWe talk about Jewish mistakes. For example, not allying more with Mustafa al-Khalidi and his faction and WIPING OUT FULLY the pro-N@zi Amin Al-Husseini faction (supporters of the Amin Al-Husseini the Grand Mufti of Jerusalem, and a leading supporter of the N@zis and the Final Solution) during what was essentially the Palestinian civil war -- that is another thing... there is an idea that the Palestinians were a monolith during this time -- they were not... Had the early Zionists ensured al-Khalidi and his faction won BY ANY MEANS NECESSARY. ANY MEANS, had they achieved power, they would have accepted the partition plan and while he was NOT a Zionist at ALL, he didn't believe in throwing all Jews into the sea. It would have been peace albeit a cold peace.\n\nBut at the same time, I do understand the pressures they were under and why the mistakes were made...\n\nSome of the early Zionists had \"understandings\" with not Al-Husseini himself but his family who sold the early Zionists LARGE tracts of land and were regularly selling them land and talking to them... Probably the early Zionist leaders thought that because his family was selling them land and therefore Al-Husseini, the pro-N@zi Grand Mufti of Jerusalem was benefiting from this and most likely he and his family said nice things to them behind the scenes he wasn't such a threat. What a HUGE mistake ...\n\nWe talk about anti-semetism -- let's say you are a young person, let's say you are similar to the way I used to be, I  knew NOTHING about the conflict. Most of Jewish friends and co-workers had NOTHING to say about Israel and nearly all of the ones who DID say anything, said bad things about it... So as a young person who knows nothing, what would myself or someone ELSE in my position think... how could we not be either non-Zionist or anti-Zionist if we are surrounded by an echo chamber of anti-Zionism and even our JEWISH friends, who we go to to get a different viewpoint, don't care or express certain anti-Zionist talking points... I mean how else could you end up...\n\nMy change only occurred when I started doing my OWN research and studying and later making friends with other pro-Israel Zionists who taught me more... But for me, my views are largely shaped by my own personal friendships with Jews for decades, since childhood, but beyond that, a deep understanding of history from BOTH sides. I am intimately familiar with both the arguments of anti-Zionists and certain Zionists and I understand the pluses and minuses of both sides, although of course I am pro-Israel, so I much mostly align with the Zionist arguments in regards to my personal views.\n\nOn the pro-Palesitnian side, from what I see, one reason why I reject them and their movement although I have compassion for Palestinains is I see that they selectively ignore and sometimes completely rewrite history in order to villify Jews. Once I noticed this pattern enough, it was hard for me to take ANYTHING they say seriously... they call Jews immigrating to Israel \"colonialists\" and occupiers. First of all Israel has ALWAYS been the home for the Jewish people. ALways. THey were NEVER recognized as full Europeans in the mid 19th century or earlier. NEVER. They were ALWAYS considered outsiders...\n\nBut let's talk about colonialism -- for centuries, the Ottoman Empire, primarily run by Europeans who CALLED themselves Ottomans, we are talking garden variety white people who were converts to Islam, who ran what was then called Palestine and the entire Middle East and Northern Africa... we talk about white colonialists and occupiers, if they are SOOO upset about occupation and white European invaders, why aren't they upset about the Ottoman Empire who again, was headed and run by people with WHITE EUROPEAN heritage...\n\nI personally don't care WHAT race a person is, but this is made such a big deal -- I can't help but point out the hypocrisy...\n\n  \n\n\nPS. Speaking of history. Another interesting fact. The Jews say they bought the land and the Arab Palestinians were upset because the land was \"stolen.\"\n\nLet me clarify that point... The Al-Husseni family and certain other rich families both in the Levant and in Turkey and in other areas, benefited from the Ottoman Land Act of 1858...\n\nThe \"Ottoman Land Code of 1858 linked land registration to military service, requiring landowners to register their property with the state, which often meant Muslim men faced conscription into the Ottoman Army, while many peasants avoided registration to evade service, taxes, or fees, leading to land being registered by local notables and altering social structures, especially in regions like Palestine. This reform aimed to increase state control and revenue but inadvertently created a system where land often became legally owned by absentee elites, despite peasants working it for generations.\"\n\nThat is it in a nutshell... basically land could have been passed from one generation to another for countless centuries but was in the hands legally of rich Turkish, Palestinian, Syrian or other land owners... in the late 19th century, decades after the Ottomans created this law (the law was again created decades before the advent of Zionism) the early Zionist wanted to BUY legally land in what was then called historical Palestine. The rich land owners who legally owned the land, had absolutely NO respect or care for Palestinian farmers who had been working the land for generations and they were happy to charge Jews 3X the real cost of the land and make a decent profit. They had no problem whatsoever with selling this land and making a quick buck...\n\nBesides various Turkish and other families, one of the many main families engaged in this was the family of the notorious Grand Muti of Jerusalem, the Al-Hussenis who were playing a double game, in regards to making money selling land to the Zionists and then at the same time stirring up ethnic and religious hatred towards them.\n\nSo in a way they are both correct. The Jews legally purchased the land from the owners who were Arab and Turkish elites. These elites did NOT care about the Palestinian farmers.\n\nNaturally if the land was sold, then whoever was there before got kicked out...\n\nMany Palestinians were left completely penniless and destitute, there only source of substance was the land they farmed and Amin Al-Husseni took advantage of this situation that his family and the family of other elites created to generate hatred and get power...",
    "score": 13,
    "num_comments": 37,
    "created_at": "2026-01-18T22:10:51"
  },
  {
    "post_id": "1qgcz0r",
    "subreddit": "IsraelPalestine",
    "title": "Battle of Kadesh: 1274 BCE",
    "selftext": "We get a lot of posts here saying something about how Palestinians are the purest Canaanites genetically and something woo woo about indigenousss. \n\nI keep trying to tell people how absurdly complicated the history of this region is. Being a professional military historian, I have long had a superficial sense of that complexity. \n\nPut off learning the history of the Near East my whole life because it's harder than Chinese algebra. Didn't get less hard in the meantime I'll tell you that. Trying to summarize the cultural and genetic history of what is now Israel is not possible it's so complicated. \n\nHere's an example. Battle of Kadesh. May 1274. Ramses II aka Ramses the Great fought the Hittites in what is now southern Syria. Hittites were centered in what is now Turkey but came south over the years. The first well recorded battle in world history. And actually they were beefing over cedar trees. Egypt didn't have trees, see. \n\nBut the point is that this was a wider war that went on for 100 years. So for a century there, a whole bunch of dudes were rolling between Egypt and Syria through what is now Israel. Dudes from Egypt, Turkey, and all their vassals in between. \n\nOne thing I've noticed about fighting age men, they enjoy sexual intercourse with whatever woman, man, or goat they can find. Some of them sperms worked. Which is always a stunning little miracle. \n\nSo just think about that genetic complexity. Just from that war alone, some cute little story about indigenoussss already makes no sense. ",
    "score": 14,
    "num_comments": 64,
    "created_at": "2026-01-18T16:26:46"
  },
  {
    "post_id": "1qgbebh",
    "subreddit": "IsraelPalestine",
    "title": "The board of peace composition is a good thing for Israel and the Jewish people",
    "selftext": "If you look at the Israeli Press, such as the times of Israel or Jerusalem Post, you would think that the composition of the board of peace executive board is a negative thing for Israel countries such as Qatar and Turkey and Pakistan, which have all been invited to join the board of peace. In addition to that there are other countries such as Canada and United Kingdom, which are western countries, but have also been hostile to Israel over the past couple of years. Given all of this, I could see why some conclude that the way that Trump is composing the board of peace is a negative thing for Israel.\n\nHowever, if you think about the contents of the United Nations security council resolution that ended the war, you would see that they are very favorable to Israel and lead to an outcome that I believe many American Jews want for the state of Israel. it involves Hamas being de radicalized, Gaza being demilitarized. in order for that to happen and in order for there to be legitimacy around this happening, there must be a well balanced board and international coalition driving this forward. There is no way that Hamas would disarm if the Board of peace were composed solely of countries favorable to Israel. There is no way that Gaza would be deradicalized after decades of supposed stewardship by an international organization UNRWA which resulted in a deeply biased and radicalized population due to the education system which the UN had administered. in order for all of this change to be possible the countries that support the Palestinian people must be closely involved in bringing that solution to fruition or making that solution a reality that is why I believe that inviting countries like Qatar, Turkey and Pakistan to the board of peace was a stroke of genius by President Trump and Jared Kushner. \n\nDo you agree? If not, what do you believe Trump should have done when building this board of peace?",
    "score": 0,
    "num_comments": 26,
    "created_at": "2026-01-18T15:26:32"
  },
  {
    "post_id": "1qg9ik2",
    "subreddit": "IsraelPalestine",
    "title": "British Indian Hindu deeply troubled by the oppression of Palestinians",
    "selftext": "Hi all,\n\nI’m a British Indian Hindu and a Kashmiri Pandit, and the Israel–Palestine conflict has caused me a lot of personal grief. Terrorism from Pakistan killed members of my extended family, and because of that I grew up instinctively sympathetic to Israel. Today, I still believe Israel has a fundamental right to exist and value that it is a democratic state.\n\nHowever, I’ve become increasingly appalled by Israel’s policies toward Palestinians. I struggle to reconcile how Israelis can live freely, travel, and pursue high‑tech or entrepreneurial careers, while Palestinians in Gaza and the West Bank are confined to fragmented enclaves with severe restrictions on movement, trade, and economic opportunity. Many Palestinians, despite being educated and capable, can only aspire to low‑wage work in Israel under precarious permits, while their communities remain underdeveloped.\n\nSettler violence in the West Bank is another major concern. Palestinians have no standing army or meaningful protection on their own land, and attacks on homes, farms, and livelihoods often go unpunished or receive minimal response. Meanwhile, even a single Palestinian attack triggers a massive military response. The imbalance is stark and deeply unfair. Settler attacks are very deadly, if someone challenges me I can easily provide statistics on the settler attacks and I can challenge the intifadas as a basis for Israel’s crippling measures. \n\nI understand that some argue that Palestinians elect extremist or militant governments, such as Hamas in Gaza, which complicates governance and security. But this cannot fully justify crippling millions of civilians. Statistically, terror attacks in Israel are relatively rare—comparable to rates of violent crime in developed countries—yet the collective restrictions placed on Palestinians vastly exceed the actual threat.\n\nThe economic and social disparity is heart-wrenching. Israelis can aspire to normal, fulfilling lives, while Palestinian communities are denied basic opportunities. Seeing Israelis live happily under these circumstances makes me feel conflicted and upset, because that happiness comes at the expense of others’ suffering.\n\nI want to do something constructive. I would like to advocate for policies that allow Palestinians greater economic freedom, trade, and mobility. I also wonder if there could be some form of neutral international protection, perhaps through the UN or other multinational arrangements, to reduce settler violence and protect civilians.\n\nI’m not posting to deny Israel’s security concerns, but I am struggling to reconcile support for Israel’s right to exist with the ongoing oppression and suffering of Palestinians. I would deeply appreciate thoughtful discussion: how can people outside the region advocate for Palestinian economic and human development effectively, without escalating conflict?\n\nI call for all Hindus to stop their unlimited support for Israel, just because of our own experience with Pakistan, at least question what is it we are supporting. ",
    "score": 0,
    "num_comments": 29,
    "created_at": "2026-01-18T14:09:35"
  },
  {
    "post_id": "1qg29ow",
    "subreddit": "IsraelPalestine",
    "title": "My 2 state solution",
    "selftext": "My 2 state solution is as follows...\n\nPalestine cedes the Gaza strip to Israel\n\nIsrael cedes the entire unannexed west bank to Palestine + Muslim land the size of the Gaza strip \n\nIsraeli settlers in the west bank will be relocated to the Gaza strip or anywhere else they choose. \n\nAll Gazans can choose to either live in Israel as Israeli Arabs or relocate to the new Palestine \n\nMinor land swaps can be done as needed.\n\nEast Jerusalem and the annexed parts of the west bank will either be under Israeli, International or joint control and remain disputed.\n\nIsrael and Palestine must illegalize any and all parties and organizations that want to wipe the other side off the map and withdraw all claims out side of their own territory and the disputed East Jerusalem and annexed west bank.\n\nPalestine must demilitarize until permission is given by Israel \n\nBoth Palestine and Israel must work with each other in catching any radicals that try to do any terror attacks or crimes. \n\n\nThe entire world will recognize Israel and Palestine \n\nPalestine will be allowed into the UN\n\nHamas and all jihad organizations and parties within Palestine must disband and all other parties within Palestine must abide by the new law of not claiming anymore territory other than the territory and the disputed East Jerusalem and annexed parts.\n\n\nIsrael and Palestine will recognize and have diplomatic relations with each other. \n\n\nIsrael and possibly the UN will pay all Palestinian refugees reputations or have the chance to move into Palestine or a certain amount (enough that Israel can keep its Jewish majority)  can move into Israel and become Israeli Arabs.\n\n\nLet me know if this is a good plan or what needs to be edited.",
    "score": 0,
    "num_comments": 114,
    "created_at": "2026-01-18T07:31:31"
  },
  {
    "post_id": "1qfx3h4",
    "subreddit": "IsraelPalestine",
    "title": "Albert Einstein - a Zionist Activist",
    "selftext": "Albert Einstein the Zionist\n\nAlbert Einstein was a Zionist. A German Jew who was ejected from Germany by the Nazis, Einstein viewed the founding of the state of Israel as a very good thing. He was a sort of a Zionist lobbyist. \n\nIndeed, Einstein lobbied for the creation of the state, as proposed in the UN General Assembly partition plan of 1947. The Arabs of course rejected the plan. Einstein passionately endorsed partition. \n\nIn the months preceding the vote for partition, Einstein wrote a letter to India’s prime minister, pleading for India to vote for partition. Einstein is often described as an “anti Zionist,” but some of the things written by him to the Indian leader would be considered “far right” by today’s leftists.\n\nIn the letter, Einstein essentially says - there is no Palestinian people. They’re part of an Arab nation. The Arabs have many lands. The Jews just want a tiny piece of the land. \n\nHe wrote to India’s prime minister\n\n “At the close of world war 1, 99% of the vast, underpopulated territories liberated from the Turks by the Allies were set aside for the national aspirations of the Arabs. Five independent Arab states have since been established in these territories.Only 1% was reserved for the Jewish people in the land of their origin. The decision which led to the proclamation of the Balfour Declaration was not arbitrary, nor the choice of territory capricious. It took into account the needs and aspirations of both Arab and Jew, and certainly, the lion’s share did not fall to the Jews. In the august scale of justice,which weighs need against need, there is not doubt as to whose is more heavy.  The “small notch” in the land of their fathers, granted the Jewish people, somewhat redresses the balance.” \n\nEinstein endorses the Balfour Declaration, universally viewed by radical leftists as evil, while saying “the Arabs have many states and they’re vast. The Jews only want one state in their ancient homeland”. \nSource: \nhttps://hvk.org/2017/0717/18.html \n\nEinstein’s Zionist lobbying continued after the founding of the state. In the 1950s, Israel’s first prime minister, David Ben Gurion, offered Einstein to become Israel’s president. Ben Gurion and Einstein were quite close. Both were Zionist and both were socialists. While Einstein was more socialistic than Ben Gurion, Ben Gurion were unironically socialist (Ben Gurion actually visited the Soviet Union once and spoke highly of Lenin. Ben Gurion later claimed his wife, Paula Ben Gurion, had a crush of Leon Trotsky when she was a young Jewish anarchist in New York City). \n\nBen Gurion would not have offered the presidency to a man who he didn’t think with a 100% certainty was not worthy of it as a Zionist. \n\nEinstein politely declined. “I’m a scientist, not a politician,” he told Ben Gurion. \n\nNevertheless, Einstein’s Zionist activism continued. In 1955, he was slated to read a speech on the radio in favor of Israel.\n\nThe speech was written by no other than Abba Eben, one of Israel’s most prominent diplomats. The speech condemned Arab hostility towards Israel. It drew a direct line between the Holocaust and Arab states’ aggression towards the Jewish state. A speech written by Abba Eben, this was an unmistakably Zionist speech. \n\nThe speech said: \n\n“The establishment of this State was internationally approved and recognised largely for the purpose of rescuing the remnant of the Jewish people from unspeakable horrors of persecution and oppression .  . Thus, the establishment of Israel is an event which actively engages the conscience of this generation,” he continued. “It is, therefore, a bitter paradox to find that a State which was destined to be a shelter for a martyred people is itself threatened by grave dangers to its own security. The universal conscience cannot be indifferent to such peril” \n\nEinstein strongly condemned Israel’s critics: “It is anomalous that world opinion should only criticize Israel’s response to hostility and should not actively seek to bring an end to the Arab hostility which is the root cause of the tension” \n\nSource \n\nhttps://www.algemeiner.com/2013/04/17/einsteins-never-before-seen-israel-independence-day-speech-revealed/\n\nEinstein died before making the address. After his death, he donated his writings to the Hebrew University in Jerusalem, where his personal files are still stored. To commemorate Einstein’s life and contributions to the Jewish state, Israel printed his image on the 5 Israeli pound bill (Israel’s currency before the shekel was called Israeli pound). \n\n\nSource \nhttps://www.globecoins.com/שטר-5-לירות-1968-איינשטיין-בנק-ישראל\n\n\nSo there you have it - Albert Einstein, a friend of Israel. Next time you read some propaganda piece about Einstein and Zionism, keep this all in mind. When you know the facts, propaganda loses its power. \n\n\n",
    "score": 61,
    "num_comments": 143,
    "created_at": "2026-01-18T03:03:36"
  },
  {
    "post_id": "1qfv46u",
    "subreddit": "IsraelPalestine",
    "title": "Mythbusting: Zionist leaders were \"expansionist\" and wanted to expand borders.",
    "selftext": "Many Pro-Palestinians have to face the reality that Jews really did want peace and were fine with partition. To contradict this well-founded fact, they have to spout out random quotes, and maybe some of the most idiotic contradictions. There are a bunch of quotes from the Israeli side, but I need to clear these up because they are the easiest copy and paste. \n\n1937 Peel Commission\n\nFollowing the publication, in 1938 the Woodhead Commission was appointed to examine it in detail and recommend an actual partition plan. The Jewish Agency accepted the idea of partition, however, didn’t agree with the borders or transfer. Prior to the report’s publication, there was indication that the Nashashibis, backed by Jordan’s Amir Abdullah, were in favor of partition. That was the reason given for the party’s reason to withdraw from the Arab Higher Committee, which were strictly opposed to partition. No Arabs came forward to submit evidence, though king Abdullah of Transjordan wrote to Woodhead giving support for partition as well as receiving the Commission in Amman. Assassination attempts against opposition leaders may have well frightened the Nashashibis too. Even in the Peel plan, it highly doubted that 200,000 Arabs could be moved to the Southern part of the Mandate. They suggested a voluntary movement by promising new opportunities. \n\nThe Woodhead Commission considered three different plans, one of which was based on the Peel plan. Reporting in 1938, the Woodhead Commission rejected the Peel plan primarily on the grounds that it could not be implemented without a massive, forced transfer of Arabs (an option that the British government had already ruled out). Had the Mufti favored the partition, the British would have preferred his rule over Abdullah. In Lebanon the Maronites initially also welcomed a Jewish state, which would break the hostile ring of Muslim Arabs. Ben Gurion thought that had the partition plan been carried out, the Holocaust could have had a different effect. If the British fully endorsed and promoted the plan, it could have been implemented with the support of the local Zionists and Arab armies forces in favor. For 1948, there was indication of certain leaders and institutions willing to cooperate with the UNCOP, however the Arab Higher Committee policy silenced any opposition. \n\nLet's start: \n\n\" I don’t understand your optimism...why would Arabs make peace? If I were an Arab leader, I would never sign an agreement with Israel. It is normal; we have taken their country. It is true God promised it to us, but how could that interest them? Our God is not theirs. There has been antisemitism, the Nazis, Hitler, Auschwitz, but was that their fault? They see but one thing: we have come and we have stolen their country. Why would they accept that?\"\n\nWe actually don’t even know if this quote is real. It’s attributed to Nahum Goldmann, who alleged Ben Gurion said this to him in his book Le Paraddoxe Juif in a private conversation. Ben Gurion was describing the Arab perspective of the conflict; he was not suggesting that he believed those things himself. In fact, Goldmann described Ben Gurion as pessimistic about the prospects for peace specifically because the Arab countries had this opinion of the Jewish state.\n\n\"Let us not ignore the truth among ourselves ... politically we are the aggressors and they defend themselves... The country is theirs, because they inhabit it, whereas we want to come here and settle down, and in their view we want to take away from them their country.\"\n\nThis quote explains the same thing. Ben Gurion definitely understood the Arab world's logic for their disapproval of Israel, but no Zionists ever took it seriously. \n\n\" I saw in the Peel Plan two positive things: the ideas of a state and compulsory transfer... I support compulsory transfer. I don't see in it anything immoral, but compulsory transfer can only be affected by England and not by the Jews... Not only is it inconceivable for us to carry it out, but it is also inconceivable for us to propose it.\"\n\nThe Woodhead Commission in 1938 noted that:\n\n\" On behalf of the Jews it was made clear to us that Jewish opinion was opposed to the exercise of any degree of compulsion.\"\n\nHe restates what he means in his letter to Amos in 1937:\n\n\" When I weigh the advantages and disadvantages of the committee's plan against my plan, I find it overall better. In two major things, whose value cannot be estimated, the committee's proposal excels: a. Handing over the entire Galilee to the Jews and placing our northern border on the Lebanon border. This neighborhood has immense political value, because Lebanon and the Jews are both interested in this neighborhood. The Christians in Lebanon can hardly exist without a Jewish state next to them, and we too are interested in an alliance with Christian Lebanon. b. The proposal of the transfer (relocation) of the Arabs from our valleys. We cannot and are not entitled to propose such a thing, because we never wanted to dispossess the Arabs. But since England is handing over a part of the land, which was promised to us, to an Arab state, it is only fair that the Arabs in our state be transferred to the Arab part.\"\n\n\"The Arabs will have to go, but one needs an opportune moment for making it happen, such as a war.\"\n\nThe reason for the strange internal quotations is likely because this quote is a fabrication. Pappe's quote appears absolutely nowhere, and Ben-Gurion does not say a war is \"necessary\" to expel the Arabs, nor does he mention a war in that sentence or the ones before or after; the quote in fuller context is that, after discussing a hypothetical where the Arab world refuses to allow a Jewish state to be populated by Jews. \n\n\" All of our ambitions are built on the assumption that has proven true throughout all of our activities in the land \\[of Israel\\] — that there is enough room for us and for the Arabs in the land \\[of Israel\\]. And if we will have to use force, not for the sake of evicting the Arabs of the Negev or Transjordan, but rather in order to secure the right that belongs to us to settle there, force will be available to us...We do not want to and we do not have to expel Arabs and take their place.\"\n\nThis fake quotation is a paraphrase by Israeli anti-Zionist Ilan Pappé, which was published in the Journal of Palestine Studies, and attributed to a 1937 letter that Ben Gurion wrote his son.\n\n\"The starting point for a solution of the question of the Arabs in the Jewish State is, in his view, the need to prepare the ground for an Arab—Jewish agreement; he supports \\[the establishment of\\] the Jewish State \\[on a small part of Palestine\\], not because he is satisfied with part of the country, but on the basis of the assumption that after we constitute a large force following the establishment of the state — we will cancel the partition \\[of the country between Jews and Arabs\\] and we will expand throughout the Land of Israel.\n\nMr. Shapira \\[a JAE member\\]: \" By force as well?\"\n\nMr. Ben-Gurion: \" \\[No\\]. Through mutual understanding and Jewish-Arab agreement.\"\n\nThis full quote can be found in Efraim Karsh's \"Falsifying the Record\". The idea was to expand land and the state throughout Palestine by working with the Arabs, not by rejecting partition or using it as a foot in the door.\n\n\" If I knew that it would be possible to save all the children in Germany by transporting them to England, and only half by transporting them to the Land of Israel, then I would opt for the second alternative. For we must weigh not only the life of these children, but also the history of the People of Israel.\"\n\nThis is very well used, so to clear it up, in this context, he's talking about Kristallnacht, during debates within the Zionist movement about how to respond to the growing Nazi threat. If all the Jews were to be taken to Britain, then there is a high chance Jews would have all be murdered because if you know history, Germany was very close to invading England, and Jews were dying in the masses. He was thinking about a permanent solution where Jews can still live.\n\n\" The acceptance of partition does not commit us to renounce Transjordan: one does not demand from anybody to give up his vision. We shall accept a state in the boundaries fixed today, but the boundaries of Zionist aspirations are the concern of the Jewish people, and no external factor will be able to limit them.\"\n\nThis quote, too, is addressed by the above clarification of Ben-Gurion's beliefs. As Karsh talks about with reference to the letter Ben-Gurion sent to his son Amos, which is frequently cited but not actually examined in totality. And again, we are still suffering from opinions made 10 years prior, before the Holocaust and WWII and the like. These things could easily have shifted Ben-Gurion's opinion, especially as he said in 1947:\n\n\" Chairman: \"Do you give preference to a federal State or a partition scheme?\"\n\nBen Gurion: \"We want to have a State of our own, and that State can be federate if the other State or States is or are willing to do so in the mutual interest, on condition that our State is in its own right a Member of the United Nations.\"\n\nNote that he accepts another state in this discussion, indicating favor towards partition and possible federation (i.e. the economic union proposed in UNSCOP). He also says later in his testimony: \n\n\" I will tell you what we told the Government last year and this year while we believe and request that our right, at least to the Western part of Palestine should be granted in full and Western Palestine be made a Jewish State, we believe it is possible. We have a right to it, but we are willing to consider an offer of a Jewish State in an area which means less than the whole of Palestine. We will consider it.\"\n\nNow, note that Ben-Gurion is one of the most prominent leaders in history, but the second-most prominent is not Menachem Begin. It was not Begin who was testifying in front of UNSCOP, it was Chaim Weizmann, who would become the first President of Israel. Weizmann is mentioned by Ben-Gurion in that same testimony.\n\n\" Dr. Weizmann is thought so well of by the Jewish people and occupies such a place in our history and among us that he is entitled to speak for himself without any public mandate.\"\n\nNow, Weizmann is recognized as instrumental in the creation of the Jewish state: he was influential with the United States, well-loved by Jews 'round the world, and a huge leader. The reason Ben-Gurion eclipses him is partially because of Ben-Gurion's leadership of the Histadrut and election as Prime Minister, and partially because Ben-Gurion stayed prominent in politics for a very, very long time, steering the country through everything from the Suez Crisis to the acquisition of arms from the French that helped Israel win in 1967, and he was prominent in commanding forces during the 1948 war. Weizmann was a diplomat and politician but spoke for far more of the Jewish populace than begin. And Weizmann was far more fervent about partition than Ben-Gurion even, as noted by the committee members themselves, who said:\n\n\" I presume that Ben-Gurion has listened to the statement of Dr. Weizmann, which was acknowledged with enthusiastic applause by the public. This statement favors a partition of Palestine into two states.\"\n\nFive days after the UN resolution, on December 3, 1947, Ben-Gurion said in a speech:\n\n\" In our state, there will be non-Jews as well, and all of them will be equal citizens, equal in everything without exception. That is, the state will be their state as well.” Ben-Gurion also called for the implementation of the partition in 1947.\"\n\nHowever, in May 1948, Ben-Gurion rightfully said:\n\n\" We accepted the UN partition, but the Arabs did not. They are preparing to make war on us. If we defeat them and capture western Galilee or territory on both sides of the road to Jerusalem, these areas will become part of the state. Why should we obligate ourselves to accept boundaries that the Arabs don’t accept?\"\n\nConclusion:\n\nThere is no doubt that Zionist leaders were clearly interested in getting more land in the partition. However, they have never stated to conquer the entire Middle East, or Palestine. In their defense, countries, like Britain, promised the Mandate to be a Jewish National Homeland (with continuous Jewish immigration). After the 1929 and 1936, there was shift in British policy, and would later battle the Zionists. \n\nI think it would be hypocritical to not mention Arab leader's ambitions to be the King of Syria like King Abdullah. At the end of the day, he still negotiated with the Jews to not participate in the 48 war (in military terms, not policy). I think if Arab leaders showed interest in negotiating, Zionists would have agreed. The idea that they would still expelled/invaded Arabs with both sides agreeing to peace is just Arab fantasy land. \n\nThough, people like Begin didn't like the partition, because he was a revisionist Zionist, who wanted Jordan to be a Jewish state. However, he was involved with a terrorist group that was hunted by the Hagenah and British. I'm going to be making a post about Britain as well, and their policies. There are a million quotes out there, so comment any I could review! I just wanted to post some about the partition specifically. \n\n",
    "score": 34,
    "num_comments": 79,
    "created_at": "2026-01-18T01:32:18"
  },
  {
    "post_id": "1qfphkt",
    "subreddit": "IsraelPalestine",
    "title": "Why are so many babies being born in Gaza?",
    "selftext": "Two disclaimers!\n\n1. I’m not super knowledgeable on the topic. I’m neither Palestinian or Israeli. I have never been to the Middle East and I do not speak Hebrew or Arabic. So I know that there’s a lot of things I do not understand. I’m asking to get more informed opinions on the topic. \n\n2. I know that life goes on and that people have the right to have children if they want to. I’m not saying that forced sterilisation should happen or anything like that. Please don’t twist my question into a call for people to stop procreating out of a weird racist belief. That’s not what I’m saying at all. \n\nAnyway … on to my question! \n\nI see so many horrific reports of babies and mothers dying in Gaza. Infants being born in active war zones and dying a few days later. So many Palestinian men are talking about their pregnant wives and newborn babies. And it’s horrific. \n\nBut I question these men who keep getting their wives pregnant in an active warzones. I’m guessing that contraception is not as accepted among Palestinians as it seems pretty conservative but the choice to keep impregnating struggling young mothers while everywhere is getting bombed is … kinda horrible? \n\nDoesn’t the safety of your wife take some priority? Or the fear of what could happen during childbirth in a place with limited medical assistance? \n\nIt makes me view all the footage of dying babies quite differently. There’s something exploitative about it. I \n\nAnd I say this as someone who hates to see any women and children suffering. I actively think they are being exploited by Palestinian men and Hamas as martyrs for the international world to see. I don’t see much of an effort to protect women and children or prevent such horrors. \n\nIf you have any opinions, I’d like to hear but please be respectful. I mean no harm towards anyone. ",
    "score": 51,
    "num_comments": 270,
    "created_at": "2026-01-17T21:31:51"
  },
  {
    "post_id": "1qfnxjg",
    "subreddit": "IsraelPalestine",
    "title": "Will the situation in Iran change anything in Gaza?",
    "selftext": "In January 2024 I wrote an opinion called Peace be on Gaza. It suggested that one way to quickly end that war would have been for the Gazans to revolt against Hamas.\n\nThe recent events in Iran where apparently people are willing to risk their lives to overthrow the dictatorship made me think of it. \n\n  \nWhat are the chances the Palestinian in Gaza will be inspired by these events and topple Hamas themselves? ",
    "score": 10,
    "num_comments": 104,
    "created_at": "2026-01-17T20:29:21"
  },
  {
    "post_id": "1qeuv1s",
    "subreddit": "IsraelPalestine",
    "title": "Many Pro-Palestinian protesters arent actually Pro-Palestine. They only want to blame America or Israel or the West for everything.",
    "selftext": "Read this news article : Why the ‘Free Palestine’ crowd goes silent on Iran https://www.afr.com/world/middle-east/why-the-free-palestine-crowd-goes-silent-on-iran-20260114-p5nu0m\n\nYamine Mohammed, a Canadian author of Egyptian and Palestinian background who at 19 was forced into marriage with an Al-Qaeda operative, says progressive left's silence on Iran is a case of mutual convenience.\n\nAn enemy of my enemy is my friend. The Islamic Republic of Iran is anti-Israel, anti-America and anti-West... hence the progressive left embrace Islamic Republic as a \"friend\". Hence the silence when it comes to Iranian people. \n\nThey don’t care about Iranian lives. They don’t care about Yemeni lives. They don’t care about Nigerian lives. They only care if they can blame America or Israel or the West. Their allegiance is to whoever is against them, not to supporting innocent people being killed. \n\nMany pro-Palestinian protesters never knew what they were protesting. They scream about anti-colonialism and then support the ideology that colonised a quarter of the planet.\n\nThey scream about queers for Palestine, not realising homosexuality is punishable by death under sharia law. \n\nI would even argue many progressive left who calls themselves Pro-Palestinian supporters are masqurading to be holier than thou, everyone is equal  but only if it fits their narrative, as long as its anti-Israel, anti-America or anti-West, then its equal, otherwise, it is not equal.\n\nIt took Hamas Ministry of Health 6 weeks into the war to accumulate a death toll of 12,000 casualties which included many Hamas fighters. It only took a few days for Islamic Republic of Iran to kill 12,000 Iranian protesters, all civilians. The silence. The hypocrisy. ",
    "score": 192,
    "num_comments": 241,
    "created_at": "2026-01-16T22:50:33"
  },
  {
    "post_id": "1qetdxc",
    "subreddit": "IsraelPalestine",
    "title": "right-wing zionists",
    "selftext": "as a palestinian non-zionist, i feel that i often share more common ground with left-wing zionists than with right-wing zionists. left-wing zionists (in my opinion) tend to be more willing to criticize israel when israel is wrong, and they show a deeper commitment to the value of human life, regardless of whether responsibility is attributed to hamas.\n\nfrom the original zionist perspective, zionism is the belief in establishing a jewish homeland in their ancestral land, where jews could govern themselves and no longer be subject to antisemitism or violence as they had been for centuries in europe and other parts of the world.\n\n**but my question is specifically for right-wing zionists since these are the kinds of comments i usually see from them:**\n\n\"palestinians are squatters on jewish land\"\n\n\"palestinians are arabs from arabia, jordan, and egypt\" (even though factually most arent and countries like jordan are recent)\n\n\"muslim behavior is the reason for islamophobia\"\n\n\"palestinians are a fake people\"\n\n\"why should palestinians get western treatment when they behave like animals\"\n\nand i can go on with the list.\n\nso right-wing zionists. if you hate the fact that \"zionist\" is used as a slur by many people, if you hate it when people call israel a supremacist state, if you want arabs and people to stop viewing israel as some kind of racist endeavor, etc. why do you say this stuff? im asking out of genuine curiosity. ",
    "score": 23,
    "num_comments": 213,
    "created_at": "2026-01-16T21:51:59"
  },
  {
    "post_id": "1qegiet",
    "subreddit": "IsraelPalestine",
    "title": "why do you think that israel voted against food becoming a human right in 2021?",
    "selftext": "In 2021 this was proposed and the only countries who voted against this were the US (unsurprisingly imo) and israel. I am curious about people’s thoughts on this choice, since i haven’t found it discussed in depth on here before.  I am personally unsurprised by their choice but i especially want to know what people who lean more towards supporting israel think of this decision.",
    "score": 0,
    "num_comments": 121,
    "created_at": "2026-01-16T13:52:29"
  },
  {
    "post_id": "1qeg8so",
    "subreddit": "IsraelPalestine",
    "title": "August 1959: The Day Palestine Was Invented",
    "selftext": "The US State Department (traditionally a hostile entity towards Israel) archives [report a very interesting tidbit:](https://history.state.gov/historicaldocuments/frus1961-63v17/d34)\n\n&gt; At Arab League meeting at Shtaura last August, **decision was made to establish Palestine “personality” or “entity” with implication of Algerian-type movement designed ultimately to eliminate Israel.** While longer range plans include military organization and Palestine government, Arabs apparently plan take steps gradually.\n\nThis is a follow up to their proposed plan in March 1959 in favor of [“reorganizing the Palestinian people and bringing it forward as an entity.\"](https://www.palquest.org/en/overallchronology?show=intro&amp;sideid=5682)\n\nNotice that the purpose of this establishment was not to establish a Palestinian state in the West Bank and Gaza or to resolve the refugee crisis, but to use the concept of a Palestine entity as a method of destroying Israel. \n\nAs every honest person knows, there was no political entity of Palestine prior to this date and for over a decade after the 1948 war, the Arab states had no interest in establishing one. But when it became clear that simply destroying Israel through military means was no longer an option, the Arab League pivoted to an \"Algerian-type movement\", shifting the conflict from Arab nationalists taking over the land of the indigenous Jewish people to an \"anti-colonial\" one along the lines of the Algerians fighting the French. \n\nThis policy created by the Arab League was reinforced by [the PLO Phased Plan](https://en.wikipedia.org/wiki/PLO%27s_Ten_Point_Program), a plan that has never been revoked or changed, in which the goal is the destruction of Israel through any means necessary.\n\nThe creation of a Palestinian entity was and always has been politically anti-Israel, not for human rights or self-determination or any of that other stuff. ",
    "score": 48,
    "num_comments": 202,
    "created_at": "2026-01-16T13:41:36"
  },
  {
    "post_id": "1qe7jn7",
    "subreddit": "IsraelPalestine",
    "title": "The Ethical and Geopolitical Implications of the Iranian Protests that the General Public is Ignoring",
    "selftext": "The current protest in Iran threatening the Islamic Republic Regime is the most inspiring geopolitical event of the 21st century.\n\nUnfortunately we live in a world where hard leftists (particularly democratic socialists) and the so-called \"woke right\" don't seem to care.  They'll scream about freeing Palestine from \"the river to the sea\" (a pejorative term and call for destruction of jews and Israelis by the way), but I only hear radio silence on this issue.\n\nNon-interventionalism is a core tenant of my political beliefs (left-leaning libertarian) but I break with that belief when it comes to gross human rights violations.  The wars in Iraq/Afghanistan/Vietnam etc. were obvious failures for example, but we have a duty as Americans to support the toppling of the Iranian regime (similarly to why fighting the Nazis was an imperative intervention).  \n\nThey have oppressed the Iranian people since the Islamic Revolution of 1979.  For the moronic liberals who dont seem to care, there are many examples of the persecution the people over there are facing.  For example, gay rights don't exist under the Islamic Republic.  At best gay people are subjected to flogging (100 lashes), imprisonment, and torture.  At its worst, they are subjected to hanging from cranes, lynchings, sexual torture, or forced hormonal and surgical transitions to the opposite sex.  Women are also treated as second class citizens.\n\nIt does make me wonder whether radical leftists are simply ignorant (a common problem), or alternatively, just as insidious as the \"America first\" woke right.  Based on their views on Israel, I'm inclined to believe its the latter.\n\nLet's not forget the additional benefits regarding the fall of the Islamic Republic: if the head of the snake is cut off, the Houthis of Yemen, Hezbollah of Lebanon, Hamas of Gaza, etc. will fall as well without the support of the regime.  There will be an unprecedented shift toward peace and prosperity across the middle east as a whole.\n\nThe Iranian people are taking back their country from the IRGC and Ayatollah Khomeini; it's unbelievably admirable that they are successfully doing it on their own, but we owe them our support.  Jews and Persians have been friends for over 2,700 years. The United States and (especially) Israel have a duty to intervene in Iran and support His Imperial Majesty, the Shahanshah of Iran, Reza Pahlavi and his vow to make Iran a democracy.\n\nAs they say, \"prove me wrong\" in the comments if you'd like to try.  My guess is that the radical leftists and woke right didn't understand most of my post anyway, so you're already at a disadvantage 😉.",
    "score": 6,
    "num_comments": 92,
    "created_at": "2026-01-16T05:35:03"
  },
  {
    "post_id": "1qe5iay",
    "subreddit": "IsraelPalestine",
    "title": "Seeing how the Pro-Palestine people are silent on Iran actually make me feel a bit better",
    "selftext": "For a long time, I thought that Pro-Palestinian protesters legitimately thought they cared about Palestinians because they genuinely cared about oppressed people around the world and wanted them to have rights. Obviously they were ignorant and naive, but at least they thought that. It was kind of maddening, seeing such morally self righteous people support such obviously bigotry and violence.\n\nBut seeing them ignore Iranian protests, and in some cases, actually support the Iranian government, I am realizing that the core of the movement never even thought they cared about oppressed people. 12,000, perhaps 20,000 people killed in a matter of days, by an oppressive government, (and unlike the horrifying events in Sudan and Yemen, FULLY in Western new) and not a peep from them.\n\nI realize now that they knew full well these were just buzzwords they were using because they were having a good time attacking their symbolic villain, the country full of \"what just so happens to be full of Jews, what a weird coincidence, that has nothing to do with my obsession at all even though I only and exclusively obsess over the one Jewish country.\"\n\nI wonder, are Pro-Palestinians on the fringes of the movement who were ignorant about the motives of the core starting to realize that the movement has nothing to do with human rights? Have they started to ask each other \"Wait a minute, why aren't we protesting this?\" Or is their need to please their community so strong, they are simply going to put this out of their minds? Either way, they can't be totally ignorant about it anymore. If they were simply naive in the past, they know better now.\n\nI'm upset that the Iranian people aren't getting more support. But it is something of a relief to know that deep down, Pro-Palestinians know they aren't part of a human rights movement.\n\nNote: Palestinian Pro-Palestinian protesters are an exception to this rule, as fairly pointed out by a Palestinian in another post. They are openly fighting for themselves, not for human rights generally.",
    "score": 194,
    "num_comments": 537,
    "created_at": "2026-01-16T03:52:17"
  },
  {
    "post_id": "1qdwkz1",
    "subreddit": "IsraelPalestine",
    "title": "Iranian Revolution would change Middle East forever",
    "selftext": "Iran is a huge country with a population of eighty million people. It has vast oil reserves. It has influence beyond its borders in neighboring countries with blood or culture ties to Iran. It was once a global power. Even today, it is a major regional power. However, it is not working out very well. \n\nRegime change can change it all. \n\nIranians don’t hate Israel. They aren’t Arab, so they don’t really care. Shiite Islam doesn’t even believe that Jerusalem is the third holiest place. In any case, many Iranians are secular. Many of them are Azeris or Kurds. Indeed, close to a third of Iranian are either Azeri or Kurdish. Azerbaijan is the friendliest Muslim state for Israel. Kurdistan remains unrecognized but it’s also quite friendly to Israel. Secular Persians in the cities are also famously friendly towards Israel. \n\nIran and Israel would be close allies in a normal world. Both have a history of hostility with the neighboring Arabs. Both have been allies in the past actually. They have a shared political interest. There’s a lot of political potential for a new Israeli, Iranian, and Emirati axis. \n\nThis new axis would counteract Turkey, another huge country in the Middle East who’s not Arab. The Turks are trying to take over, but they aren’t that great. Turkey and Qatar support the Muslim brotherhood, an Islamic Sunni movement who remains a fellow jihadi traveler of the Shiite radicals. Realigning the Middle East away from this Turkish Qatari axis towards an Israeli Iranian axis would dramatically change things for the better. \n\nSaudi Arabia would remain stuck between the two sides, struggling to decide whether it wants to become a Turkey (ie a two faced Islamic regime playing a double game) or become something new. So far, we’ve seen a mixed signals from the Saudis. \n\nThe Iranian regime is very weak. It lost all legitimacy. The war with Israel showed its military is a paper tiger unable to defend Iran’s most sensitive military installations from Israeli strikes. Its ballistic missiles have done damage, but only minimal damage. It lost its nuclear program. Its proxies have been severely mutilated. \n\n People smell the weakness because it was laid bare for everyone to see. For decades we’ve been told that Iran is so strong a war with it would cost many lives on the Israeli and American side. We see now that this was just not true. They are in fact very weak. \n\nAnd also very stupid. They have diverted billions from the economy towards a military buildup that proved absolutely useless. Spending so much on such a useless military project is only one of many stupid decisions taken by the evil regime. \n\nThe Middle East and the rest of the world have nothing but good things to gain from the collapse of this regime. It’s the best chance to create real lasting change in the Middle East. \n\n",
    "score": 39,
    "num_comments": 162,
    "created_at": "2026-01-15T21:34:36"
  },
  {
    "post_id": "1qd7n4v",
    "subreddit": "IsraelPalestine",
    "title": "How do people think Israel is in the wrong?",
    "selftext": "Correct my statements if they are wrong as I am still learning about the war.\nFrom what I know, Britain promised the region to the Jews and the Arabs at the same time, of course this will start a war! How would that be Israel’s fault for coming back to their ancestral homeland when the owner of the land tells you that you can have it? Despite this Israel tries to have a 2 state solution 4 different times. Palestine denies it every time and starts wars with Israel. Israel wins every time and Palestine loses land because of it. Again I ask, how does that make Israel the bad guy?\n\nTo add on, Israel’s ideology is not kill all Palestinians and their civilians, however the power in Palestine (Hamas) wants to kill all Jews and their civilians. In 2005 they give Palestine gaza and what happens? Hamas uses it to build miles of tunnels and send hundreds or thousands of missiles to Israel. On October 7th 3,000 Hamas members come into Israel and burn babies and r**e women. Israel starts bombing Hamas who have built their operations in with the civilians, and civilians die. Is it also true that 90% of deaths in modern urban warfare are civilian deaths, according to Hamas around 80% of deaths in gaza are civilian. A good amount of this was also done by Hamas but they don’t seem to mention that in their numbers, strange right?\n\nIf the leaders of the country next to mine wanted to kill all my civilians then I would take their country to make sure they couldn’t rebuild and try it again. What would you have done if you were Israel?",
    "score": 23,
    "num_comments": 374,
    "created_at": "2026-01-15T02:45:18"
  },
  {
    "post_id": "1dph3cc",
    "subreddit": "IsraelUnderAttack",
    "title": "Spain's leftist government blood libel-accuses Israel of \"genocide\" ? They need a mirror instead",
    "selftext": "",
    "score": 9,
    "num_comments": 12,
    "created_at": "2024-06-27T03:00:52"
  },
  {
    "post_id": "1dpel13",
    "subreddit": "IsraelUnderAttack",
    "title": "Jamaal Bowman’s Defeat Is a Fatal Blow to the Anti-Israel Left",
    "selftext": "",
    "score": 26,
    "num_comments": 5,
    "created_at": "2024-06-27T00:53:17"
  },
  {
    "post_id": "1dpd3ub",
    "subreddit": "IsraelUnderAttack",
    "title": "No famine in Gaza, previous assumptions were wrong, though risk remains, key report by UN-linked group finds",
    "selftext": "",
    "score": 23,
    "num_comments": 0,
    "created_at": "2024-06-26T23:41:25"
  },
  {
    "post_id": "1doivrn",
    "subreddit": "IsraelUnderAttack",
    "title": "Who do not want peace? It is more than obvious",
    "selftext": "",
    "score": 14,
    "num_comments": 1,
    "created_at": "2024-06-25T22:33:41"
  },
  {
    "post_id": "1doay64",
    "subreddit": "IsraelUnderAttack",
    "title": "Well done",
    "selftext": "",
    "score": 1,
    "num_comments": 0,
    "created_at": "2024-06-25T17:00:36"
  },
  {
    "post_id": "1do7o60",
    "subreddit": "IsraelUnderAttack",
    "title": "Simple as such",
    "selftext": "",
    "score": 39,
    "num_comments": 1,
    "created_at": "2024-06-25T14:41:59"
  },
  {
    "post_id": "1do6onc",
    "subreddit": "IsraelUnderAttack",
    "title": "Lest we forget –",
    "selftext": "",
    "score": 20,
    "num_comments": 1,
    "created_at": "2024-06-25T13:59:19"
  },
  {
    "post_id": "1dnbijw",
    "subreddit": "IsraelUnderAttack",
    "title": "Bring them home –",
    "selftext": "",
    "score": 17,
    "num_comments": 1,
    "created_at": "2024-06-24T11:46:43"
  },
  {
    "post_id": "1dn0wcf",
    "subreddit": "IsraelUnderAttack",
    "title": "The earliest mentions",
    "selftext": "",
    "score": 17,
    "num_comments": 1,
    "created_at": "2024-06-24T00:45:22"
  },
  {
    "post_id": "1dmnctu",
    "subreddit": "IsraelUnderAttack",
    "title": "Israeli’s: What happened to the Israeli Invincibility?",
    "selftext": "Throughout my research of the past Arab-Israeli wars, I remember reading about the Israel that won in 1948 and the stunning dominance over multiple arab countries in 1967. \n\nThe 1973 Yom Kippur war was stunning in of itself but despite the harsh first few weeks, Israel managed to still win. The IDF has the best up to date technology that any country can have. \n\nHowever, this type of Israel-Gaza war is entirely different. Gaza is choked off with a blockade from both Egypt and Israel, land, sea, and there are restrictions as much as possible. No one and I mean no one could have expected Hamas to pull off what it pulled off in October. How can Israel allow Hamas to dictate the terms and deal of a so called ceasefire? How did Israel defeat Egypt, Syria, Jordan in past wars but can’t defeat Hamas? I see that Hezbollah and Israel might go to war, and there may thousands of iran backed fighters entering Lebanon to fight. What the heck happened to Israel Invincibility? This is a serious question and I don’t pick sides here.",
    "score": 0,
    "num_comments": 4,
    "created_at": "2024-06-23T14:27:30"
  },
  {
    "post_id": "1dkrvx0",
    "subreddit": "IsraelUnderAttack",
    "title": "Western Hamasniks must come to terms with Israel’s existence",
    "selftext": "",
    "score": 10,
    "num_comments": 0,
    "created_at": "2024-06-21T01:16:13"
  },
  {
    "post_id": "1dk0rn9",
    "subreddit": "IsraelUnderAttack",
    "title": "Israel-haters, master liars",
    "selftext": "",
    "score": 23,
    "num_comments": 0,
    "created_at": "2024-06-20T02:21:03"
  },
  {
    "post_id": "1djuyvq",
    "subreddit": "IsraelUnderAttack",
    "title": "Hezbollah threatens war against Cyprus if it helps Israel",
    "selftext": "",
    "score": 3,
    "num_comments": 0,
    "created_at": "2024-06-19T21:44:41"
  },
  {
    "post_id": "1djgrw0",
    "subreddit": "IsraelUnderAttack",
    "title": "Well said",
    "selftext": "",
    "score": 9,
    "num_comments": 0,
    "created_at": "2024-06-19T11:24:42"
  },
  {
    "post_id": "1djcmfq",
    "subreddit": "IsraelUnderAttack",
    "title": "Prophecy Of A Severe Earthquake Coming To Strike The Temple Mount In Israel - June 6, 2024",
    "selftext": "",
    "score": 0,
    "num_comments": 0,
    "created_at": "2024-06-19T06:41:51"
  },
  {
    "post_id": "1dj7837",
    "subreddit": "IsraelUnderAttack",
    "title": "The more they boycott, the more we support 🇮🇱",
    "selftext": "",
    "score": 7,
    "num_comments": 0,
    "created_at": "2024-06-19T01:28:54"
  },
  {
    "post_id": "1dj6sbm",
    "subreddit": "IsraelUnderAttack",
    "title": "No wonder those Western academic Marxists concentrated in humanities' departments are getting so mad",
    "selftext": "",
    "score": 11,
    "num_comments": 0,
    "created_at": "2024-06-19T01:06:42"
  },
  {
    "post_id": "1dj25wk",
    "subreddit": "IsraelUnderAttack",
    "title": "God bless them. Salute –",
    "selftext": "",
    "score": 10,
    "num_comments": 0,
    "created_at": "2024-06-18T21:33:01"
  },
  {
    "post_id": "1diu1q9",
    "subreddit": "IsraelUnderAttack",
    "title": "Western academic Marxists concentrated in the faculty of humanities simply ignore it because of their hatred of Jews",
    "selftext": "",
    "score": 16,
    "num_comments": 0,
    "created_at": "2024-06-18T15:54:17"
  },
  {
    "post_id": "1dito9g",
    "subreddit": "IsraelUnderAttack",
    "title": "Extremist Islamist group infiltrates Australia’s pro-Palestine movement",
    "selftext": "",
    "score": 22,
    "num_comments": 5,
    "created_at": "2024-06-18T15:37:57"
  },
  {
    "post_id": "1qh86v9",
    "subreddit": "Palestine",
    "title": "“Alongside radical Islamist elements” and the people on the picture are a couple of white men and women, teenagers and two hijabis. Also why should anti-Israel protests be banned in Australia in the first place?",
    "selftext": "",
    "score": 137,
    "num_comments": 7,
    "created_at": "2026-01-19T16:04:50"
  },
  {
    "post_id": "1qh7znt",
    "subreddit": "Palestine",
    "title": "Israeli settler attempts to prevent the Abu Hammam family from accessing their property",
    "selftext": "",
    "score": 26,
    "num_comments": 1,
    "created_at": "2026-01-19T15:57:57"
  },
  {
    "post_id": "1qh4o79",
    "subreddit": "Palestine",
    "title": "Luis Hamilton pared with red crescent meets injured palatenians",
    "selftext": "",
    "score": 867,
    "num_comments": 26,
    "created_at": "2026-01-19T13:51:41"
  },
  {
    "post_id": "1qh2yy4",
    "subreddit": "Palestine",
    "title": "The \"Gaza Board of Peace\" is a joke and a desperate attempt to save the already dead PR of the US and Israel",
    "selftext": "I spent 5 hours researching about this, so reading the entire thing would be appreciated :D\n\nIf you have all followed the current events, you probably have seen the list of members thet Trump has assigned for the Gaza Board of Peace, a board that supposedly was made to supervise and manage the reconstruction plan in Gaza. Cool, right? Reconstruction, no more rubble, all aid in... \\*\\*WRONG\\*\\*\n\nSeriously, take a closer look at the members and you will realise just how fucked up this is - it looks like less of a peaceful board that is supposed to govern Gaza and more of a private equity firm and tycoon... \n\nHere is the source that the peace board is being established: \\[The Guardian](https://www.theguardian.com/us-news/2026/jan/16/trump-gaza-board-rubio-blair?hl=en-GB) ... now let is look at some of the actual members, as they are quite problematic for a couple reasons:\n\n1. Marc Rowan - has 9 billion in net worth, and is the CEO of Apollo, one of the world's largest equity firms. \\[Source: Forbes\\](https://www.forbes.com/profile/marc-rowan/?hl=en-US)\n\n2. Steve Witkoff - a well known real estate enthusiast with 2 billion dollars in net worth. \\[Source: Forbes\\](https://www.forbes.com/profile/steven-witkoff/?hl=en-US)\n\n3. Jared Kushner - a real estate heir and investor, whose net worth recently crossed the 1 billion mark. \\[Source: Newsseek\\](https://www.newsweek.com/jared-kushner-joins-billionaire-club-donald-trump-2131421?hl=en-US)\n\n4. Ajay Bonga - the former CEO of Mastercard, and the current president of the World Bank, with around 300 million dollars in net worth. \\[Source: World Bank's official page\\](https://www.worldbank.org/ext/en/who-we-are/leadership/ajay-banga), and \\[some insights on his Mastercard background\\](https://investor.mastercard.com/investor-news/investor-news-details/2010/MasterCard-Names-Ajay-Banga-President-and-Chief-Executive-OfficerSucceeding-Robert-W-Selander/default.aspx)\n\nAnd a fifth bonus, although he is not a real estate mogul like the rest of the people on here: Marco Rubio (I do not need to explain much - you all have seen his fierce support for Israel over the last 51 months) \n\nSide note: we all have noticed how the \"peace board\" lacks any Palestinians and Arabs on board, right? This alone should be beyond telling, as not allowing the OG land owners to participate in the first place is wild. You know what, forget about the Palestinians foe the sake of this argument - \\*\\*why are there no Arabs in this board, and why did Trump monetise the remaining seats of the Board of \"Peace\" if reconstructing Gaza without Hamas being a part of it was really his intention?\\*\\*\n\nThe part that I find the wildest is the fact that Trump monetised the vacant seats in the \"board of peace\" for 1 billion dollars, and no, \\[I swear i wish this was a lie\\](https://www.reuters.com/world/middle-east/trumps-gaza-peace-board-charter-seeks-1-billion-extended-membership-document-2026-01-18/). It was first reported by Bloomberg and picked up by Reuters.",
    "score": 250,
    "num_comments": 9,
    "created_at": "2026-01-19T12:33:53"
  },
  {
    "post_id": "1qh2led",
    "subreddit": "Palestine",
    "title": "They still walk free…",
    "selftext": "January 29, 2024 - Red Crescent volunteers receive and emergency call. A five-year old is trapped in a car under fire in Gaza by IOF soldiers, pleading for her rescue. While trying to keep her on the line, they do everything they can to get an ambulance to her. Her name was Hind Rajab. \n\nThis movie is about her story, it’s called The Voice of Hind Rajab. Never stop demanding justice. ",
    "score": 93,
    "num_comments": 2,
    "created_at": "2026-01-19T12:14:56"
  },
  {
    "post_id": "1qh0ufz",
    "subreddit": "Palestine",
    "title": "This is Zionism",
    "selftext": "",
    "score": 385,
    "num_comments": 11,
    "created_at": "2026-01-19T10:38:32"
  },
  {
    "post_id": "1qh0rn9",
    "subreddit": "Palestine",
    "title": "Germans, famously known for identifying and countering fascism",
    "selftext": "",
    "score": 1010,
    "num_comments": 67,
    "created_at": "2026-01-19T10:34:00"
  },
  {
    "post_id": "1qgz8xp",
    "subreddit": "Palestine",
    "title": "The story of a Palestinian man",
    "selftext": "via tawakul sabr on Instagram",
    "score": 463,
    "num_comments": 6,
    "created_at": "2026-01-19T09:01:36"
  },
  {
    "post_id": "1qgytaz",
    "subreddit": "Palestine",
    "title": "Petition - Support and endorse Kairos Palestine II A Moment of Truth: Faith in a Time of Genocide.",
    "selftext": "The Global Kairos For Justice Coalition started a petition calling for support of Kairos Palestine II, a document by Palestinian Christian leaders speaking out against the genocide in Gaza and other injustices in the Holy Land.\n\n  \n",
    "score": 39,
    "num_comments": 2,
    "created_at": "2026-01-19T08:35:03"
  },
  {
    "post_id": "1qgnao7",
    "subreddit": "Palestine",
    "title": "Activists launch global campaign for Palestinian hostages held by the Zionist occupation",
    "selftext": "Red Ribbons Campaign aims to draw attention to more than 9000 Palestinians held in Israeli prisons, including more than 400 children.",
    "score": 544,
    "num_comments": 4,
    "created_at": "2026-01-18T23:07:38"
  },
  {
    "post_id": "1qgmua0",
    "subreddit": "Palestine",
    "title": "Palestinian man uses a sieve to recollect his family's remains following bombing",
    "selftext": "",
    "score": 137,
    "num_comments": 1,
    "created_at": "2026-01-18T22:49:13"
  },
  {
    "post_id": "1qgmtea",
    "subreddit": "Palestine",
    "title": "Palestinian confronts settlers who released their livestock onto citizens’ lands",
    "selftext": "",
    "score": 78,
    "num_comments": 2,
    "created_at": "2026-01-18T22:48:15"
  },
  {
    "post_id": "1qglhoh",
    "subreddit": "Palestine",
    "title": "NFL fines Texans linebacker Azeez Al-Shaair $11,593 for wearing eye black reading “stop the genocide.”",
    "selftext": "",
    "score": 4864,
    "num_comments": 85,
    "created_at": "2026-01-18T21:56:11"
  },
  {
    "post_id": "1qgksjl",
    "subreddit": "Palestine",
    "title": "Gavin Newsom denies the genocide in Gaza",
    "selftext": "Source: Gavin Newsom Podcast",
    "score": 1633,
    "num_comments": 153,
    "created_at": "2026-01-18T21:27:58"
  },
  {
    "post_id": "1qgjraw",
    "subreddit": "Palestine",
    "title": "Last night: Settler pogrom in East Ramallah, four hospitalised. Almost every house in the Palestinian village of Mukhmas has been burned to the ground.",
    "selftext": "",
    "score": 342,
    "num_comments": 2,
    "created_at": "2026-01-18T20:42:10"
  },
  {
    "post_id": "1qgiz3k",
    "subreddit": "Palestine",
    "title": "The world failed Palestinians",
    "selftext": "Just wanted to say as a Canadian, i'm so fucking disgusted about what's been happening right under EVERY country's eyes. We all seen the Childrens starving, civilians getting bombed and sniped in their house. I'm so sad, literally crying right now after seeing a video of a kid failing to collect any food and going back home to his mom with his pot empty.\n\nIt's 2026 how can we fail humanity this badly. I'm embarassed and ashamed that i'm writing this shit from the comfort of my home.These IDF soldiers have their cell phones with them and have been showing off on social media enjoyment bombing and killing innocents. True psychopaths, no methods to avoid Innocent's deaths. I DONT UNDERSTAND HOW THE WORLD WONT PUNISH THEM.\n\nI hope every single leader, Eu , america , asia, realise they have blood on their hands and are complicit to the murder of 10s of thousands of innocents. True number are realistically in 100s of thousands of child and civilians. Embarassing truly, feeling so powerless.",
    "score": 850,
    "num_comments": 18,
    "created_at": "2026-01-18T20:11:25"
  },
  {
    "post_id": "1qgi37v",
    "subreddit": "Palestine",
    "title": "Zionist Orthodox Union (OU) rabbi claims their reality is \"fundamentally different\" when it comes to their enormous destruction.",
    "selftext": "Additional \"we have every right to sing in light of the Gazans' suffering\" since we can see ourselves as good unlike the rest of the entire world.\n\nThese are the guys that have the OU kosher certifications, unfortunately.\n\n\\[[https://www.ou.org/from-ma-nishtana-to-ma-nishtanu-we-are-different/\\](https://www.ou.org/from-ma-nishtana-to-ma-nishtanu-we-are-different/)](https://www.ou.org/from-ma-nishtana-to-ma-nishtanu-we-are-different/%5D(https://www.ou.org/from-ma-nishtana-to-ma-nishtanu-we-are-different/))",
    "score": 94,
    "num_comments": 8,
    "created_at": "2026-01-18T19:37:39"
  },
  {
    "post_id": "1qghyt6",
    "subreddit": "Palestine",
    "title": "Israeli occupation soldiers prevent a young girl from returning to her home.",
    "selftext": "",
    "score": 819,
    "num_comments": 10,
    "created_at": "2026-01-18T19:32:49"
  },
  {
    "post_id": "1qgf5v8",
    "subreddit": "Palestine",
    "title": "Footage of an Israeli paramedic participating in the arrest of a Palestinian in Hawara, occupied Palestine. Not only Israeli paramedics routinely deny treatment to injured Palestinians or delay medical care, they also operate as instruments to enforce apartheid.",
    "selftext": "",
    "score": 488,
    "num_comments": 15,
    "created_at": "2026-01-18T17:49:20"
  },
  {
    "post_id": "1qgefnu",
    "subreddit": "Palestine",
    "title": "Source: Azeez Al-Shaair fined for 'stop the genocide' eye black",
    "selftext": "I know this will get taken down but let’s all buy his jersey!!!",
    "score": 255,
    "num_comments": 7,
    "created_at": "2026-01-18T17:21:50"
  },
  {
    "post_id": "1qh840f",
    "subreddit": "IsraelPalestine",
    "title": "Risk Iran is Facing.",
    "selftext": "Hey there! As an ethnic Iranian I would just want to give my concern on the current situation.\n\nI fully support these, as an Iranian Muslim culturally, we are not just Muslims, we are jews, zoroastrians, and many more. Religiously, extremism like this isn't allowed and culturally we are free people.\n\nNot my main concern. My main concern is, And I say this with no offense to any americans or jewish people. My concern is majority of the people have been pushing for Reza Pahlavi, The former shah's son to be the new leader. But this is where I stop supporting him, He has very close ties with Israel and the United States. Which I don't care about, they are good allies but it seems suspicious why only him? A person with close ties to the USA and Israel? It would make sense if they want Iran because of it controlling many prominent things like strong military wise, and Iran controls the northern coast of the Strait of Hormuz with (coincidently) allows 20% of the world's oil to flow through. And not minding the large natural gas and oil reservers.\n\n  \nI want the freedom, We deserved it. But I don't like the fact that our best option of a leader has close ties to USA and Israel. Same thing with why has the US only taken over Venezuela? Coincidently  they want to run Venezuela when it has the largest oil reserves in the world. Thank you for listening. I just wanted to get this off my chest because if that is gonna be the case, this is a lose-lose situation for the Iranian people.\n\n  \nBefore you attack me, Please take into consideration the consequence of this leader being selected.",
    "score": 4,
    "num_comments": 3,
    "created_at": "2026-01-19T16:02:06"
  },
  {
    "post_id": "1qh3nc6",
    "subreddit": "IsraelPalestine",
    "title": "Early Zionist Militias",
    "selftext": "I keep seeing this “argument” online that criticizing Hamas isn’t legitimate because “early Zionist militias were terrorists too.” It’s one of those claims that sounds clever until you unpack it. First off, when does a liberation movement become a “terrorist” organization? There’s no single, universally accepted legal definition. Generally, terrorism is framed as the use of violence against civilians to achieve political goals—but even that is debated depending on context and perspective. So yes, labeling groups is highly subjective.\n\nPeople also extend this logic to the IDF, claiming it’s “terrorist” because it evolved from militias like the Haganah or Irgun. This argument is sloppy at best. Early militias operated in a very different historical and political context: under British Mandate, against hostile forces, in a pre-state environment. Israel’s formal army is a recognized state institution, accountable (at least in principle) to laws and government, unlike insurgent militias operating outside any legal framework.\n\nThe underlying problem with the “both sides did it” approach is that it conflates historical context with contemporary morality. Criticizing Hamas today is about actions in the present, not the imperfect past of another group. History informs ethics, but it doesn’t provide carte blanche to excuse ongoing acts of violence. The reality is messy: legitimacy, terrorism, and liberation aren’t black-and-white—they’re always filtered through perspective, power, and law.\n\nIn short, appealing to early Zionist militias to deflect criticism of Hamas is a weak analogy. Context matters, and historical actions don’t erase present-day responsibilities.",
    "score": 12,
    "num_comments": 66,
    "created_at": "2026-01-19T13:06:22"
  },
  {
    "post_id": "1qgugiq",
    "subreddit": "IsraelPalestine",
    "title": "The two kinds of antizionist justification: They hate Israel for Who Israelis are V. what Israel does",
    "selftext": "I've found that, when you boil it down, there are basically two kinds of justification for antizionism. When an anti-Zionist starts out with one reason and argues with a Zionist and gets out-argued, they typically switch to the other reason.\n\n**1. Israel is bad because of who Jews are**\n\nThis is your basic settler-colonizer buzzword sandwich. Following this logic, Israel is bad because Jews are foreign European people who have no right to be in the Levant in the first place, and certainly no right to seek self determination there.\n\nTherefore, everything the true locals (Palestinians) do --- however much they murder, rape, displace Jews --- is justified, because they are getting rid of this fundamental evil that was never supposed to be there in the first place. Whatever Israelis do is wrong. Israelis cannot possibly do anything in self defense or response to aggression, because their very existence is offensive in the first place. Palestinians are allowed to kill Israelis, and Israelis are not allowed to fight back.\n\n**Where it falls apart:**\n\nThis argument falls apart because Jews are indigenous to Israel. They were displaced and taken away on slave ships, and after getting persecuted and displaced more, they finally returned to their ancestral homeland.\n\nAnyone who thinks an indigenous people should not return to their homeland and try to claim self determination there would have to say that Native Americans have no right to a land back movement, or displaced Palestinians for that matter have no right to go to Israel. Unless they choose some arbitrary number of years for an \"indigenous rightful owner\" to magically turn into a \"foreigner colonizer\", but ask them to give a specific number of years that isn't arbitrary, and they can't do it.\n\nSo when they realize this, they switch to point #1 with some transition line like \"Well, the problem isn't that Jews came back to Israel, the problem is that they displaced/killed so many Palestinians in the process!\"\n\n**2. Israel is bad because of what it does**\n\nThis is your basic genocide apartheid ethnic cleansing buzzword sandwich. Following this, the idea of Jews seeking self determination in their homeland was okay, but the problem is that those Jews turned out to be evil people who displace and murder peaceful Palestinians.\n\n**Where it falls apart:**\n\nThis falls apart because both Jews and Arabs engaged in violence against each other (and Arabs started each new round of the violence.). Pro-Palestinians basically have to leave out half the story.\n\nArabs started murdering and displacing Jews in the 1920s, long before Jews started responding by attacking them back. This pattern continued for the whole conflict: In 1948, Palestinian Arabs were offered their own country for the first time ever. Plus, Jews offered Arabs full citizenship and equal rights in Israel. Arabs responded by starting a war. Similar numbers of Palestinians and Jews were killed in that war. As the decades went on, the pattern continued: Arabs would attack first, and Israelis would fight back.\n\nPalestinians are in a worse situation than Israelis now because they keep starting wars and losing them, not because Israelis are somehow more brutal in their fighting (you could make an argument that Israel was less brutal up until a few years ago but more brutal in this particular war, but I've yet to hear a Pro-Palestinian make that argument).\n\nSo when Pro-Palestinians realize this argument is worthless, they switch to point 1 with some transition line like \"Well, the Palestinians are just fighting back against settler-colonizers!\"",
    "score": 9,
    "num_comments": 98,
    "created_at": "2026-01-19T04:34:19"
  },
  {
    "post_id": "1qglv7m",
    "subreddit": "IsraelPalestine",
    "title": "History Education - The Missing Element",
    "selftext": "I am not Jewish or evangelical Christian. I am a very passionate friend of Israel and the Jewish people. But I wasn't always that way...\n\nFor most of my life I was what I would call a \"non-Zionist.\" A person who really doesn't care strongly either way... Like perhaps Israel has some good and bad points and maybe Hamas has some good and bad points and they both need to stop fighting...\n\nThis is DESPITE having Jewish friends basically my entire life...\n\nAs a long term friend of Israel and Jewish people, I can say, that where the pro-Israel movement has failed in using its strongest weapon, which is simply true and unvarnished history. Not only in defending the position of the Jewish people and the world's only Jewish state, but in educating young people, but especially young Jews...\n\nIsrael and the Jewish people have made a LOT of mistakes throughout history. The prestate militias made a LOT of mistakes. We can't and there is no reason to hide from these. But while expressing regret for such mistakes and missteps, it is important that both Jews and non-Jews understand history from a 360 degree perspective... I do not in any way excuse or explain away any current or past mistakes.\n\nBut when a person has a FULL understanding of history, both the good and bad, it is obvious that Israel and the Jewish people are FAR, FAR more humane than ANY group of random people would have been facing the same situations and provocations and that is why I am myself pro-Israel and feel strongly about it.\n\nWe talk about Jewish mistakes. For example, not allying more with Mustafa al-Khalidi and his faction and WIPING OUT FULLY the pro-N@zi Amin Al-Husseini faction (supporters of the Amin Al-Husseini the Grand Mufti of Jerusalem, and a leading supporter of the N@zis and the Final Solution) during what was essentially the Palestinian civil war -- that is another thing... there is an idea that the Palestinians were a monolith during this time -- they were not... Had the early Zionists ensured al-Khalidi and his faction won BY ANY MEANS NECESSARY. ANY MEANS, had they achieved power, they would have accepted the partition plan and while he was NOT a Zionist at ALL, he didn't believe in throwing all Jews into the sea. It would have been peace albeit a cold peace.\n\nBut at the same time, I do understand the pressures they were under and why the mistakes were made...\n\nSome of the early Zionists had \"understandings\" with not Al-Husseini himself but his family who sold the early Zionists LARGE tracts of land and were regularly selling them land and talking to them... Probably the early Zionist leaders thought that because his family was selling them land and therefore Al-Husseini, the pro-N@zi Grand Mufti of Jerusalem was benefiting from this and most likely he and his family said nice things to them behind the scenes he wasn't such a threat. What a HUGE mistake ...\n\nWe talk about anti-semetism -- let's say you are a young person, let's say you are similar to the way I used to be, I  knew NOTHING about the conflict. Most of Jewish friends and co-workers had NOTHING to say about Israel and nearly all of the ones who DID say anything, said bad things about it... So as a young person who knows nothing, what would myself or someone ELSE in my position think... how could we not be either non-Zionist or anti-Zionist if we are surrounded by an echo chamber of anti-Zionism and even our JEWISH friends, who we go to to get a different viewpoint, don't care or express certain anti-Zionist talking points... I mean how else could you end up...\n\nMy change only occurred when I started doing my OWN research and studying and later making friends with other pro-Israel Zionists who taught me more... But for me, my views are largely shaped by my own personal friendships with Jews for decades, since childhood, but beyond that, a deep understanding of history from BOTH sides. I am intimately familiar with both the arguments of anti-Zionists and certain Zionists and I understand the pluses and minuses of both sides, although of course I am pro-Israel, so I much mostly align with the Zionist arguments in regards to my personal views.\n\nOn the pro-Palesitnian side, from what I see, one reason why I reject them and their movement although I have compassion for Palestinains is I see that they selectively ignore and sometimes completely rewrite history in order to villify Jews. Once I noticed this pattern enough, it was hard for me to take ANYTHING they say seriously... they call Jews immigrating to Israel \"colonialists\" and occupiers. First of all Israel has ALWAYS been the home for the Jewish people. ALways. THey were NEVER recognized as full Europeans in the mid 19th century or earlier. NEVER. They were ALWAYS considered outsiders...\n\nBut let's talk about colonialism -- for centuries, the Ottoman Empire, primarily run by Europeans who CALLED themselves Ottomans, we are talking garden variety white people who were converts to Islam, who ran what was then called Palestine and the entire Middle East and Northern Africa... we talk about white colonialists and occupiers, if they are SOOO upset about occupation and white European invaders, why aren't they upset about the Ottoman Empire who again, was headed and run by people with WHITE EUROPEAN heritage...\n\nI personally don't care WHAT race a person is, but this is made such a big deal -- I can't help but point out the hypocrisy...\n\n  \n\n\nPS. Speaking of history. Another interesting fact. The Jews say they bought the land and the Arab Palestinians were upset because the land was \"stolen.\"\n\nLet me clarify that point... The Al-Husseni family and certain other rich families both in the Levant and in Turkey and in other areas, benefited from the Ottoman Land Act of 1858...\n\nThe \"Ottoman Land Code of 1858 linked land registration to military service, requiring landowners to register their property with the state, which often meant Muslim men faced conscription into the Ottoman Army, while many peasants avoided registration to evade service, taxes, or fees, leading to land being registered by local notables and altering social structures, especially in regions like Palestine. This reform aimed to increase state control and revenue but inadvertently created a system where land often became legally owned by absentee elites, despite peasants working it for generations.\"\n\nThat is it in a nutshell... basically land could have been passed from one generation to another for countless centuries but was in the hands legally of rich Turkish, Palestinian, Syrian or other land owners... in the late 19th century, decades after the Ottomans created this law (the law was again created decades before the advent of Zionism) the early Zionist wanted to BUY legally land in what was then called historical Palestine. The rich land owners who legally owned the land, had absolutely NO respect or care for Palestinian farmers who had been working the land for generations and they were happy to charge Jews 3X the real cost of the land and make a decent profit. They had no problem whatsoever with selling this land and making a quick buck...\n\nBesides various Turkish and other families, one of the many main families engaged in this was the family of the notorious Grand Muti of Jerusalem, the Al-Hussenis who were playing a double game, in regards to making money selling land to the Zionists and then at the same time stirring up ethnic and religious hatred towards them.\n\nSo in a way they are both correct. The Jews legally purchased the land from the owners who were Arab and Turkish elites. These elites did NOT care about the Palestinian farmers.\n\nNaturally if the land was sold, then whoever was there before got kicked out...\n\nMany Palestinians were left completely penniless and destitute, there only source of substance was the land they farmed and Amin Al-Husseni took advantage of this situation that his family and the family of other elites created to generate hatred and get power...",
    "score": 12,
    "num_comments": 37,
    "created_at": "2026-01-18T22:10:51"
  },
  {
    "post_id": "1qgcz0r",
    "subreddit": "IsraelPalestine",
    "title": "Battle of Kadesh: 1274 BCE",
    "selftext": "We get a lot of posts here saying something about how Palestinians are the purest Canaanites genetically and something woo woo about indigenousss. \n\nI keep trying to tell people how absurdly complicated the history of this region is. Being a professional military historian, I have long had a superficial sense of that complexity. \n\nPut off learning the history of the Near East my whole life because it's harder than Chinese algebra. Didn't get less hard in the meantime I'll tell you that. Trying to summarize the cultural and genetic history of what is now Israel is not possible it's so complicated. \n\nHere's an example. Battle of Kadesh. May 1274. Ramses II aka Ramses the Great fought the Hittites in what is now southern Syria. Hittites were centered in what is now Turkey but came south over the years. The first well recorded battle in world history. And actually they were beefing over cedar trees. Egypt didn't have trees, see. \n\nBut the point is that this was a wider war that went on for 100 years. So for a century there, a whole bunch of dudes were rolling between Egypt and Syria through what is now Israel. Dudes from Egypt, Turkey, and all their vassals in between. \n\nOne thing I've noticed about fighting age men, they enjoy sexual intercourse with whatever woman, man, or goat they can find. Some of them sperms worked. Which is always a stunning little miracle. \n\nSo just think about that genetic complexity. Just from that war alone, some cute little story about indigenoussss already makes no sense. ",
    "score": 14,
    "num_comments": 64,
    "created_at": "2026-01-18T16:26:46"
  },
  {
    "post_id": "1qgbebh",
    "subreddit": "IsraelPalestine",
    "title": "The board of peace composition is a good thing for Israel and the Jewish people",
    "selftext": "If you look at the Israeli Press, such as the times of Israel or Jerusalem Post, you would think that the composition of the board of peace executive board is a negative thing for Israel countries such as Qatar and Turkey and Pakistan, which have all been invited to join the board of peace. In addition to that there are other countries such as Canada and United Kingdom, which are western countries, but have also been hostile to Israel over the past couple of years. Given all of this, I could see why some conclude that the way that Trump is composing the board of peace is a negative thing for Israel.\n\nHowever, if you think about the contents of the United Nations security council resolution that ended the war, you would see that they are very favorable to Israel and lead to an outcome that I believe many American Jews want for the state of Israel. it involves Hamas being de radicalized, Gaza being demilitarized. in order for that to happen and in order for there to be legitimacy around this happening, there must be a well balanced board and international coalition driving this forward. There is no way that Hamas would disarm if the Board of peace were composed solely of countries favorable to Israel. There is no way that Gaza would be deradicalized after decades of supposed stewardship by an international organization UNRWA which resulted in a deeply biased and radicalized population due to the education system which the UN had administered. in order for all of this change to be possible the countries that support the Palestinian people must be closely involved in bringing that solution to fruition or making that solution a reality that is why I believe that inviting countries like Qatar, Turkey and Pakistan to the board of peace was a stroke of genius by President Trump and Jared Kushner. \n\nDo you agree? If not, what do you believe Trump should have done when building this board of peace?",
    "score": 0,
    "num_comments": 26,
    "created_at": "2026-01-18T15:26:32"
  },
  {
    "post_id": "1qg9ik2",
    "subreddit": "IsraelPalestine",
    "title": "British Indian Hindu deeply troubled by the oppression of Palestinians",
    "selftext": "Hi all,\n\nI’m a British Indian Hindu and a Kashmiri Pandit, and the Israel–Palestine conflict has caused me a lot of personal grief. Terrorism from Pakistan killed members of my extended family, and because of that I grew up instinctively sympathetic to Israel. Today, I still believe Israel has a fundamental right to exist and value that it is a democratic state.\n\nHowever, I’ve become increasingly appalled by Israel’s policies toward Palestinians. I struggle to reconcile how Israelis can live freely, travel, and pursue high‑tech or entrepreneurial careers, while Palestinians in Gaza and the West Bank are confined to fragmented enclaves with severe restrictions on movement, trade, and economic opportunity. Many Palestinians, despite being educated and capable, can only aspire to low‑wage work in Israel under precarious permits, while their communities remain underdeveloped.\n\nSettler violence in the West Bank is another major concern. Palestinians have no standing army or meaningful protection on their own land, and attacks on homes, farms, and livelihoods often go unpunished or receive minimal response. Meanwhile, even a single Palestinian attack triggers a massive military response. The imbalance is stark and deeply unfair. Settler attacks are very deadly, if someone challenges me I can easily provide statistics on the settler attacks and I can challenge the intifadas as a basis for Israel’s crippling measures. \n\nI understand that some argue that Palestinians elect extremist or militant governments, such as Hamas in Gaza, which complicates governance and security. But this cannot fully justify crippling millions of civilians. Statistically, terror attacks in Israel are relatively rare—comparable to rates of violent crime in developed countries—yet the collective restrictions placed on Palestinians vastly exceed the actual threat.\n\nThe economic and social disparity is heart-wrenching. Israelis can aspire to normal, fulfilling lives, while Palestinian communities are denied basic opportunities. Seeing Israelis live happily under these circumstances makes me feel conflicted and upset, because that happiness comes at the expense of others’ suffering.\n\nI want to do something constructive. I would like to advocate for policies that allow Palestinians greater economic freedom, trade, and mobility. I also wonder if there could be some form of neutral international protection, perhaps through the UN or other multinational arrangements, to reduce settler violence and protect civilians.\n\nI’m not posting to deny Israel’s security concerns, but I am struggling to reconcile support for Israel’s right to exist with the ongoing oppression and suffering of Palestinians. I would deeply appreciate thoughtful discussion: how can people outside the region advocate for Palestinian economic and human development effectively, without escalating conflict?\n\nI call for all Hindus to stop their unlimited support for Israel, just because of our own experience with Pakistan, at least question what is it we are supporting. ",
    "score": 0,
    "num_comments": 29,
    "created_at": "2026-01-18T14:09:35"
  },
  {
    "post_id": "1qg29ow",
    "subreddit": "IsraelPalestine",
    "title": "My 2 state solution",
    "selftext": "My 2 state solution is as follows...\n\nPalestine cedes the Gaza strip to Israel\n\nIsrael cedes the entire unannexed west bank to Palestine + Muslim land the size of the Gaza strip \n\nIsraeli settlers in the west bank will be relocated to the Gaza strip or anywhere else they choose. \n\nAll Gazans can choose to either live in Israel as Israeli Arabs or relocate to the new Palestine \n\nMinor land swaps can be done as needed.\n\nEast Jerusalem and the annexed parts of the west bank will either be under Israeli, International or joint control and remain disputed.\n\nIsrael and Palestine must illegalize any and all parties and organizations that want to wipe the other side off the map and withdraw all claims out side of their own territory and the disputed East Jerusalem and annexed west bank.\n\nPalestine must demilitarize until permission is given by Israel \n\nBoth Palestine and Israel must work with each other in catching any radicals that try to do any terror attacks or crimes. \n\n\nThe entire world will recognize Israel and Palestine \n\nPalestine will be allowed into the UN\n\nHamas and all jihad organizations and parties within Palestine must disband and all other parties within Palestine must abide by the new law of not claiming anymore territory other than the territory and the disputed East Jerusalem and annexed parts.\n\n\nIsrael and Palestine will recognize and have diplomatic relations with each other. \n\n\nIsrael and possibly the UN will pay all Palestinian refugees reputations or have the chance to move into Palestine or a certain amount (enough that Israel can keep its Jewish majority)  can move into Israel and become Israeli Arabs.\n\n\nLet me know if this is a good plan or what needs to be edited.",
    "score": 0,
    "num_comments": 114,
    "created_at": "2026-01-18T07:31:31"
  },
  {
    "post_id": "1qfx3h4",
    "subreddit": "IsraelPalestine",
    "title": "Albert Einstein - a Zionist Activist",
    "selftext": "Albert Einstein the Zionist\n\nAlbert Einstein was a Zionist. A German Jew who was ejected from Germany by the Nazis, Einstein viewed the founding of the state of Israel as a very good thing. He was a sort of a Zionist lobbyist. \n\nIndeed, Einstein lobbied for the creation of the state, as proposed in the UN General Assembly partition plan of 1947. The Arabs of course rejected the plan. Einstein passionately endorsed partition. \n\nIn the months preceding the vote for partition, Einstein wrote a letter to India’s prime minister, pleading for India to vote for partition. Einstein is often described as an “anti Zionist,” but some of the things written by him to the Indian leader would be considered “far right” by today’s leftists.\n\nIn the letter, Einstein essentially says - there is no Palestinian people. They’re part of an Arab nation. The Arabs have many lands. The Jews just want a tiny piece of the land. \n\nHe wrote to India’s prime minister\n\n “At the close of world war 1, 99% of the vast, underpopulated territories liberated from the Turks by the Allies were set aside for the national aspirations of the Arabs. Five independent Arab states have since been established in these territories.Only 1% was reserved for the Jewish people in the land of their origin. The decision which led to the proclamation of the Balfour Declaration was not arbitrary, nor the choice of territory capricious. It took into account the needs and aspirations of both Arab and Jew, and certainly, the lion’s share did not fall to the Jews. In the august scale of justice,which weighs need against need, there is not doubt as to whose is more heavy.  The “small notch” in the land of their fathers, granted the Jewish people, somewhat redresses the balance.” \n\nEinstein endorses the Balfour Declaration, universally viewed by radical leftists as evil, while saying “the Arabs have many states and they’re vast. The Jews only want one state in their ancient homeland”. \nSource: \nhttps://hvk.org/2017/0717/18.html \n\nEinstein’s Zionist lobbying continued after the founding of the state. In the 1950s, Israel’s first prime minister, David Ben Gurion, offered Einstein to become Israel’s president. Ben Gurion and Einstein were quite close. Both were Zionist and both were socialists. While Einstein was more socialistic than Ben Gurion, Ben Gurion were unironically socialist (Ben Gurion actually visited the Soviet Union once and spoke highly of Lenin. Ben Gurion later claimed his wife, Paula Ben Gurion, had a crush of Leon Trotsky when she was a young Jewish anarchist in New York City). \n\nBen Gurion would not have offered the presidency to a man who he didn’t think with a 100% certainty was not worthy of it as a Zionist. \n\nEinstein politely declined. “I’m a scientist, not a politician,” he told Ben Gurion. \n\nNevertheless, Einstein’s Zionist activism continued. In 1955, he was slated to read a speech on the radio in favor of Israel.\n\nThe speech was written by no other than Abba Eben, one of Israel’s most prominent diplomats. The speech condemned Arab hostility towards Israel. It drew a direct line between the Holocaust and Arab states’ aggression towards the Jewish state. A speech written by Abba Eben, this was an unmistakably Zionist speech. \n\nThe speech said: \n\n“The establishment of this State was internationally approved and recognised largely for the purpose of rescuing the remnant of the Jewish people from unspeakable horrors of persecution and oppression .  . Thus, the establishment of Israel is an event which actively engages the conscience of this generation,” he continued. “It is, therefore, a bitter paradox to find that a State which was destined to be a shelter for a martyred people is itself threatened by grave dangers to its own security. The universal conscience cannot be indifferent to such peril” \n\nEinstein strongly condemned Israel’s critics: “It is anomalous that world opinion should only criticize Israel’s response to hostility and should not actively seek to bring an end to the Arab hostility which is the root cause of the tension” \n\nSource \n\nhttps://www.algemeiner.com/2013/04/17/einsteins-never-before-seen-israel-independence-day-speech-revealed/\n\nEinstein died before making the address. After his death, he donated his writings to the Hebrew University in Jerusalem, where his personal files are still stored. To commemorate Einstein’s life and contributions to the Jewish state, Israel printed his image on the 5 Israeli pound bill (Israel’s currency before the shekel was called Israeli pound). \n\n\nSource \nhttps://www.globecoins.com/שטר-5-לירות-1968-איינשטיין-בנק-ישראל\n\n\nSo there you have it - Albert Einstein, a friend of Israel. Next time you read some propaganda piece about Einstein and Zionism, keep this all in mind. When you know the facts, propaganda loses its power. \n\n\n",
    "score": 58,
    "num_comments": 143,
    "created_at": "2026-01-18T03:03:36"
  },
  {
    "post_id": "1qfv46u",
    "subreddit": "IsraelPalestine",
    "title": "Mythbusting: Zionist leaders were \"expansionist\" and wanted to expand borders.",
    "selftext": "Many Pro-Palestinians have to face the reality that Jews really did want peace and were fine with partition. To contradict this well-founded fact, they have to spout out random quotes, and maybe some of the most idiotic contradictions. There are a bunch of quotes from the Israeli side, but I need to clear these up because they are the easiest copy and paste. \n\n1937 Peel Commission\n\nFollowing the publication, in 1938 the Woodhead Commission was appointed to examine it in detail and recommend an actual partition plan. The Jewish Agency accepted the idea of partition, however, didn’t agree with the borders or transfer. Prior to the report’s publication, there was indication that the Nashashibis, backed by Jordan’s Amir Abdullah, were in favor of partition. That was the reason given for the party’s reason to withdraw from the Arab Higher Committee, which were strictly opposed to partition. No Arabs came forward to submit evidence, though king Abdullah of Transjordan wrote to Woodhead giving support for partition as well as receiving the Commission in Amman. Assassination attempts against opposition leaders may have well frightened the Nashashibis too. Even in the Peel plan, it highly doubted that 200,000 Arabs could be moved to the Southern part of the Mandate. They suggested a voluntary movement by promising new opportunities. \n\nThe Woodhead Commission considered three different plans, one of which was based on the Peel plan. Reporting in 1938, the Woodhead Commission rejected the Peel plan primarily on the grounds that it could not be implemented without a massive, forced transfer of Arabs (an option that the British government had already ruled out). Had the Mufti favored the partition, the British would have preferred his rule over Abdullah. In Lebanon the Maronites initially also welcomed a Jewish state, which would break the hostile ring of Muslim Arabs. Ben Gurion thought that had the partition plan been carried out, the Holocaust could have had a different effect. If the British fully endorsed and promoted the plan, it could have been implemented with the support of the local Zionists and Arab armies forces in favor. For 1948, there was indication of certain leaders and institutions willing to cooperate with the UNCOP, however the Arab Higher Committee policy silenced any opposition. \n\nLet's start: \n\n\" I don’t understand your optimism...why would Arabs make peace? If I were an Arab leader, I would never sign an agreement with Israel. It is normal; we have taken their country. It is true God promised it to us, but how could that interest them? Our God is not theirs. There has been antisemitism, the Nazis, Hitler, Auschwitz, but was that their fault? They see but one thing: we have come and we have stolen their country. Why would they accept that?\"\n\nWe actually don’t even know if this quote is real. It’s attributed to Nahum Goldmann, who alleged Ben Gurion said this to him in his book Le Paraddoxe Juif in a private conversation. Ben Gurion was describing the Arab perspective of the conflict; he was not suggesting that he believed those things himself. In fact, Goldmann described Ben Gurion as pessimistic about the prospects for peace specifically because the Arab countries had this opinion of the Jewish state.\n\n\"Let us not ignore the truth among ourselves ... politically we are the aggressors and they defend themselves... The country is theirs, because they inhabit it, whereas we want to come here and settle down, and in their view we want to take away from them their country.\"\n\nThis quote explains the same thing. Ben Gurion definitely understood the Arab world's logic for their disapproval of Israel, but no Zionists ever took it seriously. \n\n\" I saw in the Peel Plan two positive things: the ideas of a state and compulsory transfer... I support compulsory transfer. I don't see in it anything immoral, but compulsory transfer can only be affected by England and not by the Jews... Not only is it inconceivable for us to carry it out, but it is also inconceivable for us to propose it.\"\n\nThe Woodhead Commission in 1938 noted that:\n\n\" On behalf of the Jews it was made clear to us that Jewish opinion was opposed to the exercise of any degree of compulsion.\"\n\nHe restates what he means in his letter to Amos in 1937:\n\n\" When I weigh the advantages and disadvantages of the committee's plan against my plan, I find it overall better. In two major things, whose value cannot be estimated, the committee's proposal excels: a. Handing over the entire Galilee to the Jews and placing our northern border on the Lebanon border. This neighborhood has immense political value, because Lebanon and the Jews are both interested in this neighborhood. The Christians in Lebanon can hardly exist without a Jewish state next to them, and we too are interested in an alliance with Christian Lebanon. b. The proposal of the transfer (relocation) of the Arabs from our valleys. We cannot and are not entitled to propose such a thing, because we never wanted to dispossess the Arabs. But since England is handing over a part of the land, which was promised to us, to an Arab state, it is only fair that the Arabs in our state be transferred to the Arab part.\"\n\n\"The Arabs will have to go, but one needs an opportune moment for making it happen, such as a war.\"\n\nThe reason for the strange internal quotations is likely because this quote is a fabrication. Pappe's quote appears absolutely nowhere, and Ben-Gurion does not say a war is \"necessary\" to expel the Arabs, nor does he mention a war in that sentence or the ones before or after; the quote in fuller context is that, after discussing a hypothetical where the Arab world refuses to allow a Jewish state to be populated by Jews. \n\n\" All of our ambitions are built on the assumption that has proven true throughout all of our activities in the land \\[of Israel\\] — that there is enough room for us and for the Arabs in the land \\[of Israel\\]. And if we will have to use force, not for the sake of evicting the Arabs of the Negev or Transjordan, but rather in order to secure the right that belongs to us to settle there, force will be available to us...We do not want to and we do not have to expel Arabs and take their place.\"\n\nThis fake quotation is a paraphrase by Israeli anti-Zionist Ilan Pappé, which was published in the Journal of Palestine Studies, and attributed to a 1937 letter that Ben Gurion wrote his son.\n\n\"The starting point for a solution of the question of the Arabs in the Jewish State is, in his view, the need to prepare the ground for an Arab—Jewish agreement; he supports \\[the establishment of\\] the Jewish State \\[on a small part of Palestine\\], not because he is satisfied with part of the country, but on the basis of the assumption that after we constitute a large force following the establishment of the state — we will cancel the partition \\[of the country between Jews and Arabs\\] and we will expand throughout the Land of Israel.\n\nMr. Shapira \\[a JAE member\\]: \" By force as well?\"\n\nMr. Ben-Gurion: \" \\[No\\]. Through mutual understanding and Jewish-Arab agreement.\"\n\nThis full quote can be found in Efraim Karsh's \"Falsifying the Record\". The idea was to expand land and the state throughout Palestine by working with the Arabs, not by rejecting partition or using it as a foot in the door.\n\n\" If I knew that it would be possible to save all the children in Germany by transporting them to England, and only half by transporting them to the Land of Israel, then I would opt for the second alternative. For we must weigh not only the life of these children, but also the history of the People of Israel.\"\n\nThis is very well used, so to clear it up, in this context, he's talking about Kristallnacht, during debates within the Zionist movement about how to respond to the growing Nazi threat. If all the Jews were to be taken to Britain, then there is a high chance Jews would have all be murdered because if you know history, Germany was very close to invading England, and Jews were dying in the masses. He was thinking about a permanent solution where Jews can still live.\n\n\" The acceptance of partition does not commit us to renounce Transjordan: one does not demand from anybody to give up his vision. We shall accept a state in the boundaries fixed today, but the boundaries of Zionist aspirations are the concern of the Jewish people, and no external factor will be able to limit them.\"\n\nThis quote, too, is addressed by the above clarification of Ben-Gurion's beliefs. As Karsh talks about with reference to the letter Ben-Gurion sent to his son Amos, which is frequently cited but not actually examined in totality. And again, we are still suffering from opinions made 10 years prior, before the Holocaust and WWII and the like. These things could easily have shifted Ben-Gurion's opinion, especially as he said in 1947:\n\n\" Chairman: \"Do you give preference to a federal State or a partition scheme?\"\n\nBen Gurion: \"We want to have a State of our own, and that State can be federate if the other State or States is or are willing to do so in the mutual interest, on condition that our State is in its own right a Member of the United Nations.\"\n\nNote that he accepts another state in this discussion, indicating favor towards partition and possible federation (i.e. the economic union proposed in UNSCOP). He also says later in his testimony: \n\n\" I will tell you what we told the Government last year and this year while we believe and request that our right, at least to the Western part of Palestine should be granted in full and Western Palestine be made a Jewish State, we believe it is possible. We have a right to it, but we are willing to consider an offer of a Jewish State in an area which means less than the whole of Palestine. We will consider it.\"\n\nNow, note that Ben-Gurion is one of the most prominent leaders in history, but the second-most prominent is not Menachem Begin. It was not Begin who was testifying in front of UNSCOP, it was Chaim Weizmann, who would become the first President of Israel. Weizmann is mentioned by Ben-Gurion in that same testimony.\n\n\" Dr. Weizmann is thought so well of by the Jewish people and occupies such a place in our history and among us that he is entitled to speak for himself without any public mandate.\"\n\nNow, Weizmann is recognized as instrumental in the creation of the Jewish state: he was influential with the United States, well-loved by Jews 'round the world, and a huge leader. The reason Ben-Gurion eclipses him is partially because of Ben-Gurion's leadership of the Histadrut and election as Prime Minister, and partially because Ben-Gurion stayed prominent in politics for a very, very long time, steering the country through everything from the Suez Crisis to the acquisition of arms from the French that helped Israel win in 1967, and he was prominent in commanding forces during the 1948 war. Weizmann was a diplomat and politician but spoke for far more of the Jewish populace than begin. And Weizmann was far more fervent about partition than Ben-Gurion even, as noted by the committee members themselves, who said:\n\n\" I presume that Ben-Gurion has listened to the statement of Dr. Weizmann, which was acknowledged with enthusiastic applause by the public. This statement favors a partition of Palestine into two states.\"\n\nFive days after the UN resolution, on December 3, 1947, Ben-Gurion said in a speech:\n\n\" In our state, there will be non-Jews as well, and all of them will be equal citizens, equal in everything without exception. That is, the state will be their state as well.” Ben-Gurion also called for the implementation of the partition in 1947.\"\n\nHowever, in May 1948, Ben-Gurion rightfully said:\n\n\" We accepted the UN partition, but the Arabs did not. They are preparing to make war on us. If we defeat them and capture western Galilee or territory on both sides of the road to Jerusalem, these areas will become part of the state. Why should we obligate ourselves to accept boundaries that the Arabs don’t accept?\"\n\nConclusion:\n\nThere is no doubt that Zionist leaders were clearly interested in getting more land in the partition. However, they have never stated to conquer the entire Middle East, or Palestine. In their defense, countries, like Britain, promised the Mandate to be a Jewish National Homeland (with continuous Jewish immigration). After the 1929 and 1936, there was shift in British policy, and would later battle the Zionists. \n\nI think it would be hypocritical to not mention Arab leader's ambitions to be the King of Syria like King Abdullah. At the end of the day, he still negotiated with the Jews to not participate in the 48 war (in military terms, not policy). I think if Arab leaders showed interest in negotiating, Zionists would have agreed. The idea that they would still expelled/invaded Arabs with both sides agreeing to peace is just Arab fantasy land. \n\nThough, people like Begin didn't like the partition, because he was a revisionist Zionist, who wanted Jordan to be a Jewish state. However, he was involved with a terrorist group that was hunted by the Hagenah and British. I'm going to be making a post about Britain as well, and their policies. There are a million quotes out there, so comment any I could review! I just wanted to post some about the partition specifically. \n\n",
    "score": 33,
    "num_comments": 79,
    "created_at": "2026-01-18T01:32:18"
  },
  {
    "post_id": "1qfphkt",
    "subreddit": "IsraelPalestine",
    "title": "Why are so many babies being born in Gaza?",
    "selftext": "Two disclaimers!\n\n1. I’m not super knowledgeable on the topic. I’m neither Palestinian or Israeli. I have never been to the Middle East and I do not speak Hebrew or Arabic. So I know that there’s a lot of things I do not understand. I’m asking to get more informed opinions on the topic. \n\n2. I know that life goes on and that people have the right to have children if they want to. I’m not saying that forced sterilisation should happen or anything like that. Please don’t twist my question into a call for people to stop procreating out of a weird racist belief. That’s not what I’m saying at all. \n\nAnyway … on to my question! \n\nI see so many horrific reports of babies and mothers dying in Gaza. Infants being born in active war zones and dying a few days later. So many Palestinian men are talking about their pregnant wives and newborn babies. And it’s horrific. \n\nBut I question these men who keep getting their wives pregnant in an active warzones. I’m guessing that contraception is not as accepted among Palestinians as it seems pretty conservative but the choice to keep impregnating struggling young mothers while everywhere is getting bombed is … kinda horrible? \n\nDoesn’t the safety of your wife take some priority? Or the fear of what could happen during childbirth in a place with limited medical assistance? \n\nIt makes me view all the footage of dying babies quite differently. There’s something exploitative about it. I \n\nAnd I say this as someone who hates to see any women and children suffering. I actively think they are being exploited by Palestinian men and Hamas as martyrs for the international world to see. I don’t see much of an effort to protect women and children or prevent such horrors. \n\nIf you have any opinions, I’d like to hear but please be respectful. I mean no harm towards anyone. ",
    "score": 49,
    "num_comments": 270,
    "created_at": "2026-01-17T21:31:51"
  },
  {
    "post_id": "1qfnxjg",
    "subreddit": "IsraelPalestine",
    "title": "Will the situation in Iran change anything in Gaza?",
    "selftext": "In January 2024 I wrote an opinion called Peace be on Gaza. It suggested that one way to quickly end that war would have been for the Gazans to revolt against Hamas.\n\nThe recent events in Iran where apparently people are willing to risk their lives to overthrow the dictatorship made me think of it. \n\n  \nWhat are the chances the Palestinian in Gaza will be inspired by these events and topple Hamas themselves? ",
    "score": 10,
    "num_comments": 104,
    "created_at": "2026-01-17T20:29:21"
  },
  {
    "post_id": "1qeuv1s",
    "subreddit": "IsraelPalestine",
    "title": "Many Pro-Palestinian protesters arent actually Pro-Palestine. They only want to blame America or Israel or the West for everything.",
    "selftext": "Read this news article : Why the ‘Free Palestine’ crowd goes silent on Iran https://www.afr.com/world/middle-east/why-the-free-palestine-crowd-goes-silent-on-iran-20260114-p5nu0m\n\nYamine Mohammed, a Canadian author of Egyptian and Palestinian background who at 19 was forced into marriage with an Al-Qaeda operative, says progressive left's silence on Iran is a case of mutual convenience.\n\nAn enemy of my enemy is my friend. The Islamic Republic of Iran is anti-Israel, anti-America and anti-West... hence the progressive left embrace Islamic Republic as a \"friend\". Hence the silence when it comes to Iranian people. \n\nThey don’t care about Iranian lives. They don’t care about Yemeni lives. They don’t care about Nigerian lives. They only care if they can blame America or Israel or the West. Their allegiance is to whoever is against them, not to supporting innocent people being killed. \n\nMany pro-Palestinian protesters never knew what they were protesting. They scream about anti-colonialism and then support the ideology that colonised a quarter of the planet.\n\nThey scream about queers for Palestine, not realising homosexuality is punishable by death under sharia law. \n\nI would even argue many progressive left who calls themselves Pro-Palestinian supporters are masqurading to be holier than thou, everyone is equal  but only if it fits their narrative, as long as its anti-Israel, anti-America or anti-West, then its equal, otherwise, it is not equal.\n\nIt took Hamas Ministry of Health 6 weeks into the war to accumulate a death toll of 12,000 casualties which included many Hamas fighters. It only took a few days for Islamic Republic of Iran to kill 12,000 Iranian protesters, all civilians. The silence. The hypocrisy. ",
    "score": 192,
    "num_comments": 241,
    "created_at": "2026-01-16T22:50:33"
  },
  {
    "post_id": "1qetdxc",
    "subreddit": "IsraelPalestine",
    "title": "right-wing zionists",
    "selftext": "as a palestinian non-zionist, i feel that i often share more common ground with left-wing zionists than with right-wing zionists. left-wing zionists (in my opinion) tend to be more willing to criticize israel when israel is wrong, and they show a deeper commitment to the value of human life, regardless of whether responsibility is attributed to hamas.\n\nfrom the original zionist perspective, zionism is the belief in establishing a jewish homeland in their ancestral land, where jews could govern themselves and no longer be subject to antisemitism or violence as they had been for centuries in europe and other parts of the world.\n\n**but my question is specifically for right-wing zionists since these are the kinds of comments i usually see from them:**\n\n\"palestinians are squatters on jewish land\"\n\n\"palestinians are arabs from arabia, jordan, and egypt\" (even though factually most arent and countries like jordan are recent)\n\n\"muslim behavior is the reason for islamophobia\"\n\n\"palestinians are a fake people\"\n\n\"why should palestinians get western treatment when they behave like animals\"\n\nand i can go on with the list.\n\nso right-wing zionists. if you hate the fact that \"zionist\" is used as a slur by many people, if you hate it when people call israel a supremacist state, if you want arabs and people to stop viewing israel as some kind of racist endeavor, etc. why do you say this stuff? im asking out of genuine curiosity. ",
    "score": 22,
    "num_comments": 213,
    "created_at": "2026-01-16T21:51:59"
  },
  {
    "post_id": "1qegiet",
    "subreddit": "IsraelPalestine",
    "title": "why do you think that israel voted against food becoming a human right in 2021?",
    "selftext": "In 2021 this was proposed and the only countries who voted against this were the US (unsurprisingly imo) and israel. I am curious about people’s thoughts on this choice, since i haven’t found it discussed in depth on here before.  I am personally unsurprised by their choice but i especially want to know what people who lean more towards supporting israel think of this decision.",
    "score": 2,
    "num_comments": 121,
    "created_at": "2026-01-16T13:52:29"
  },
  {
    "post_id": "1qeg8so",
    "subreddit": "IsraelPalestine",
    "title": "August 1959: The Day Palestine Was Invented",
    "selftext": "The US State Department (traditionally a hostile entity towards Israel) archives [report a very interesting tidbit:](https://history.state.gov/historicaldocuments/frus1961-63v17/d34)\n\n&gt; At Arab League meeting at Shtaura last August, **decision was made to establish Palestine “personality” or “entity” with implication of Algerian-type movement designed ultimately to eliminate Israel.** While longer range plans include military organization and Palestine government, Arabs apparently plan take steps gradually.\n\nThis is a follow up to their proposed plan in March 1959 in favor of [“reorganizing the Palestinian people and bringing it forward as an entity.\"](https://www.palquest.org/en/overallchronology?show=intro&amp;sideid=5682)\n\nNotice that the purpose of this establishment was not to establish a Palestinian state in the West Bank and Gaza or to resolve the refugee crisis, but to use the concept of a Palestine entity as a method of destroying Israel. \n\nAs every honest person knows, there was no political entity of Palestine prior to this date and for over a decade after the 1948 war, the Arab states had no interest in establishing one. But when it became clear that simply destroying Israel through military means was no longer an option, the Arab League pivoted to an \"Algerian-type movement\", shifting the conflict from Arab nationalists taking over the land of the indigenous Jewish people to an \"anti-colonial\" one along the lines of the Algerians fighting the French. \n\nThis policy created by the Arab League was reinforced by [the PLO Phased Plan](https://en.wikipedia.org/wiki/PLO%27s_Ten_Point_Program), a plan that has never been revoked or changed, in which the goal is the destruction of Israel through any means necessary.\n\nThe creation of a Palestinian entity was and always has been politically anti-Israel, not for human rights or self-determination or any of that other stuff. ",
    "score": 49,
    "num_comments": 202,
    "created_at": "2026-01-16T13:41:36"
  },
  {
    "post_id": "1qe7jn7",
    "subreddit": "IsraelPalestine",
    "title": "The Ethical and Geopolitical Implications of the Iranian Protests that the General Public is Ignoring",
    "selftext": "The current protest in Iran threatening the Islamic Republic Regime is the most inspiring geopolitical event of the 21st century.\n\nUnfortunately we live in a world where hard leftists (particularly democratic socialists) and the so-called \"woke right\" don't seem to care.  They'll scream about freeing Palestine from \"the river to the sea\" (a pejorative term and call for destruction of jews and Israelis by the way), but I only hear radio silence on this issue.\n\nNon-interventionalism is a core tenant of my political beliefs (left-leaning libertarian) but I break with that belief when it comes to gross human rights violations.  The wars in Iraq/Afghanistan/Vietnam etc. were obvious failures for example, but we have a duty as Americans to support the toppling of the Iranian regime (similarly to why fighting the Nazis was an imperative intervention).  \n\nThey have oppressed the Iranian people since the Islamic Revolution of 1979.  For the moronic liberals who dont seem to care, there are many examples of the persecution the people over there are facing.  For example, gay rights don't exist under the Islamic Republic.  At best gay people are subjected to flogging (100 lashes), imprisonment, and torture.  At its worst, they are subjected to hanging from cranes, lynchings, sexual torture, or forced hormonal and surgical transitions to the opposite sex.  Women are also treated as second class citizens.\n\nIt does make me wonder whether radical leftists are simply ignorant (a common problem), or alternatively, just as insidious as the \"America first\" woke right.  Based on their views on Israel, I'm inclined to believe its the latter.\n\nLet's not forget the additional benefits regarding the fall of the Islamic Republic: if the head of the snake is cut off, the Houthis of Yemen, Hezbollah of Lebanon, Hamas of Gaza, etc. will fall as well without the support of the regime.  There will be an unprecedented shift toward peace and prosperity across the middle east as a whole.\n\nThe Iranian people are taking back their country from the IRGC and Ayatollah Khomeini; it's unbelievably admirable that they are successfully doing it on their own, but we owe them our support.  Jews and Persians have been friends for over 2,700 years. The United States and (especially) Israel have a duty to intervene in Iran and support His Imperial Majesty, the Shahanshah of Iran, Reza Pahlavi and his vow to make Iran a democracy.\n\nAs they say, \"prove me wrong\" in the comments if you'd like to try.  My guess is that the radical leftists and woke right didn't understand most of my post anyway, so you're already at a disadvantage 😉.",
    "score": 8,
    "num_comments": 92,
    "created_at": "2026-01-16T05:35:03"
  },
  {
    "post_id": "1qe5iay",
    "subreddit": "IsraelPalestine",
    "title": "Seeing how the Pro-Palestine people are silent on Iran actually make me feel a bit better",
    "selftext": "For a long time, I thought that Pro-Palestinian protesters legitimately thought they cared about Palestinians because they genuinely cared about oppressed people around the world and wanted them to have rights. Obviously they were ignorant and naive, but at least they thought that. It was kind of maddening, seeing such morally self righteous people support such obviously bigotry and violence.\n\nBut seeing them ignore Iranian protests, and in some cases, actually support the Iranian government, I am realizing that the core of the movement never even thought they cared about oppressed people. 12,000, perhaps 20,000 people killed in a matter of days, by an oppressive government, (and unlike the horrifying events in Sudan and Yemen, FULLY in Western new) and not a peep from them.\n\nI realize now that they knew full well these were just buzzwords they were using because they were having a good time attacking their symbolic villain, the country full of \"what just so happens to be full of Jews, what a weird coincidence, that has nothing to do with my obsession at all even though I only and exclusively obsess over the one Jewish country.\"\n\nI wonder, are Pro-Palestinians on the fringes of the movement who were ignorant about the motives of the core starting to realize that the movement has nothing to do with human rights? Have they started to ask each other \"Wait a minute, why aren't we protesting this?\" Or is their need to please their community so strong, they are simply going to put this out of their minds? Either way, they can't be totally ignorant about it anymore. If they were simply naive in the past, they know better now.\n\nI'm upset that the Iranian people aren't getting more support. But it is something of a relief to know that deep down, Pro-Palestinians know they aren't part of a human rights movement.\n\nNote: Palestinian Pro-Palestinian protesters are an exception to this rule, as fairly pointed out by a Palestinian in another post. They are openly fighting for themselves, not for human rights generally.",
    "score": 193,
    "num_comments": 537,
    "created_at": "2026-01-16T03:52:17"
  },
  {
    "post_id": "1qdwkz1",
    "subreddit": "IsraelPalestine",
    "title": "Iranian Revolution would change Middle East forever",
    "selftext": "Iran is a huge country with a population of eighty million people. It has vast oil reserves. It has influence beyond its borders in neighboring countries with blood or culture ties to Iran. It was once a global power. Even today, it is a major regional power. However, it is not working out very well. \n\nRegime change can change it all. \n\nIranians don’t hate Israel. They aren’t Arab, so they don’t really care. Shiite Islam doesn’t even believe that Jerusalem is the third holiest place. In any case, many Iranians are secular. Many of them are Azeris or Kurds. Indeed, close to a third of Iranian are either Azeri or Kurdish. Azerbaijan is the friendliest Muslim state for Israel. Kurdistan remains unrecognized but it’s also quite friendly to Israel. Secular Persians in the cities are also famously friendly towards Israel. \n\nIran and Israel would be close allies in a normal world. Both have a history of hostility with the neighboring Arabs. Both have been allies in the past actually. They have a shared political interest. There’s a lot of political potential for a new Israeli, Iranian, and Emirati axis. \n\nThis new axis would counteract Turkey, another huge country in the Middle East who’s not Arab. The Turks are trying to take over, but they aren’t that great. Turkey and Qatar support the Muslim brotherhood, an Islamic Sunni movement who remains a fellow jihadi traveler of the Shiite radicals. Realigning the Middle East away from this Turkish Qatari axis towards an Israeli Iranian axis would dramatically change things for the better. \n\nSaudi Arabia would remain stuck between the two sides, struggling to decide whether it wants to become a Turkey (ie a two faced Islamic regime playing a double game) or become something new. So far, we’ve seen a mixed signals from the Saudis. \n\nThe Iranian regime is very weak. It lost all legitimacy. The war with Israel showed its military is a paper tiger unable to defend Iran’s most sensitive military installations from Israeli strikes. Its ballistic missiles have done damage, but only minimal damage. It lost its nuclear program. Its proxies have been severely mutilated. \n\n People smell the weakness because it was laid bare for everyone to see. For decades we’ve been told that Iran is so strong a war with it would cost many lives on the Israeli and American side. We see now that this was just not true. They are in fact very weak. \n\nAnd also very stupid. They have diverted billions from the economy towards a military buildup that proved absolutely useless. Spending so much on such a useless military project is only one of many stupid decisions taken by the evil regime. \n\nThe Middle East and the rest of the world have nothing but good things to gain from the collapse of this regime. It’s the best chance to create real lasting change in the Middle East. \n\n",
    "score": 40,
    "num_comments": 162,
    "created_at": "2026-01-15T21:34:36"
  },
  {
    "post_id": "1qd7n4v",
    "subreddit": "IsraelPalestine",
    "title": "How do people think Israel is in the wrong?",
    "selftext": "Correct my statements if they are wrong as I am still learning about the war.\nFrom what I know, Britain promised the region to the Jews and the Arabs at the same time, of course this will start a war! How would that be Israel’s fault for coming back to their ancestral homeland when the owner of the land tells you that you can have it? Despite this Israel tries to have a 2 state solution 4 different times. Palestine denies it every time and starts wars with Israel. Israel wins every time and Palestine loses land because of it. Again I ask, how does that make Israel the bad guy?\n\nTo add on, Israel’s ideology is not kill all Palestinians and their civilians, however the power in Palestine (Hamas) wants to kill all Jews and their civilians. In 2005 they give Palestine gaza and what happens? Hamas uses it to build miles of tunnels and send hundreds or thousands of missiles to Israel. On October 7th 3,000 Hamas members come into Israel and burn babies and r**e women. Israel starts bombing Hamas who have built their operations in with the civilians, and civilians die. Is it also true that 90% of deaths in modern urban warfare are civilian deaths, according to Hamas around 80% of deaths in gaza are civilian. A good amount of this was also done by Hamas but they don’t seem to mention that in their numbers, strange right?\n\nIf the leaders of the country next to mine wanted to kill all my civilians then I would take their country to make sure they couldn’t rebuild and try it again. What would you have done if you were Israel?",
    "score": 19,
    "num_comments": 374,
    "created_at": "2026-01-15T02:45:18"
  },
  {
    "post_id": "1dph3cc",
    "subreddit": "IsraelUnderAttack",
    "title": "Spain's leftist government blood libel-accuses Israel of \"genocide\" ? They need a mirror instead",
    "selftext": "",
    "score": 9,
    "num_comments": 12,
    "created_at": "2024-06-27T03:00:52"
  },
  {
    "post_id": "1dpel13",
    "subreddit": "IsraelUnderAttack",
    "title": "Jamaal Bowman’s Defeat Is a Fatal Blow to the Anti-Israel Left",
    "selftext": "",
    "score": 27,
    "num_comments": 5,
    "created_at": "2024-06-27T00:53:17"
  },
  {
    "post_id": "1dpd3ub",
    "subreddit": "IsraelUnderAttack",
    "title": "No famine in Gaza, previous assumptions were wrong, though risk remains, key report by UN-linked group finds",
    "selftext": "",
    "score": 21,
    "num_comments": 0,
    "created_at": "2024-06-26T23:41:25"
  },
  {
    "post_id": "1doivrn",
    "subreddit": "IsraelUnderAttack",
    "title": "Who do not want peace? It is more than obvious",
    "selftext": "",
    "score": 18,
    "num_comments": 1,
    "created_at": "2024-06-25T22:33:41"
  },
  {
    "post_id": "1doay64",
    "subreddit": "IsraelUnderAttack",
    "title": "Well done",
    "selftext": "",
    "score": 1,
    "num_comments": 0,
    "created_at": "2024-06-25T17:00:36"
  },
  {
    "post_id": "1do7o60",
    "subreddit": "IsraelUnderAttack",
    "title": "Simple as such",
    "selftext": "",
    "score": 40,
    "num_comments": 1,
    "created_at": "2024-06-25T14:41:59"
  },
  {
    "post_id": "1do6onc",
    "subreddit": "IsraelUnderAttack",
    "title": "Lest we forget –",
    "selftext": "",
    "score": 18,
    "num_comments": 1,
    "created_at": "2024-06-25T13:59:19"
  },
  {
    "post_id": "1dnbijw",
    "subreddit": "IsraelUnderAttack",
    "title": "Bring them home –",
    "selftext": "",
    "score": 14,
    "num_comments": 1,
    "created_at": "2024-06-24T11:46:43"
  },
  {
    "post_id": "1dn0wcf",
    "subreddit": "IsraelUnderAttack",
    "title": "The earliest mentions",
    "selftext": "",
    "score": 17,
    "num_comments": 1,
    "created_at": "2024-06-24T00:45:22"
  },
  {
    "post_id": "1dmnctu",
    "subreddit": "IsraelUnderAttack",
    "title": "Israeli’s: What happened to the Israeli Invincibility?",
    "selftext": "Throughout my research of the past Arab-Israeli wars, I remember reading about the Israel that won in 1948 and the stunning dominance over multiple arab countries in 1967. \n\nThe 1973 Yom Kippur war was stunning in of itself but despite the harsh first few weeks, Israel managed to still win. The IDF has the best up to date technology that any country can have. \n\nHowever, this type of Israel-Gaza war is entirely different. Gaza is choked off with a blockade from both Egypt and Israel, land, sea, and there are restrictions as much as possible. No one and I mean no one could have expected Hamas to pull off what it pulled off in October. How can Israel allow Hamas to dictate the terms and deal of a so called ceasefire? How did Israel defeat Egypt, Syria, Jordan in past wars but can’t defeat Hamas? I see that Hezbollah and Israel might go to war, and there may thousands of iran backed fighters entering Lebanon to fight. What the heck happened to Israel Invincibility? This is a serious question and I don’t pick sides here.",
    "score": 0,
    "num_comments": 4,
    "created_at": "2024-06-23T14:27:30"
  },
  {
    "post_id": "1dkrvx0",
    "subreddit": "IsraelUnderAttack",
    "title": "Western Hamasniks must come to terms with Israel’s existence",
    "selftext": "",
    "score": 11,
    "num_comments": 0,
    "created_at": "2024-06-21T01:16:13"
  },
  {
    "post_id": "1dk0rn9",
    "subreddit": "IsraelUnderAttack",
    "title": "Israel-haters, master liars",
    "selftext": "",
    "score": 22,
    "num_comments": 0,
    "created_at": "2024-06-20T02:21:03"
  },
  {
    "post_id": "1djuyvq",
    "subreddit": "IsraelUnderAttack",
    "title": "Hezbollah threatens war against Cyprus if it helps Israel",
    "selftext": "",
    "score": 5,
    "num_comments": 0,
    "created_at": "2024-06-19T21:44:41"
  },
  {
    "post_id": "1djgrw0",
    "subreddit": "IsraelUnderAttack",
    "title": "Well said",
    "selftext": "",
    "score": 7,
    "num_comments": 0,
    "created_at": "2024-06-19T11:24:42"
  },
  {
    "post_id": "1djcmfq",
    "subreddit": "IsraelUnderAttack",
    "title": "Prophecy Of A Severe Earthquake Coming To Strike The Temple Mount In Israel - June 6, 2024",
    "selftext": "",
    "score": 0,
    "num_comments": 0,
    "created_at": "2024-06-19T06:41:51"
  },
  {
    "post_id": "1dj7837",
    "subreddit": "IsraelUnderAttack",
    "title": "The more they boycott, the more we support 🇮🇱",
    "selftext": "",
    "score": 6,
    "num_comments": 0,
    "created_at": "2024-06-19T01:28:54"
  },
  {
    "post_id": "1dj6sbm",
    "subreddit": "IsraelUnderAttack",
    "title": "No wonder those Western academic Marxists concentrated in humanities' departments are getting so mad",
    "selftext": "",
    "score": 12,
    "num_comments": 0,
    "created_at": "2024-06-19T01:06:42"
  },
  {
    "post_id": "1dj25wk",
    "subreddit": "IsraelUnderAttack",
    "title": "God bless them. Salute –",
    "selftext": "",
    "score": 10,
    "num_comments": 0,
    "created_at": "2024-06-18T21:33:01"
  },
  {
    "post_id": "1diu1q9",
    "subreddit": "IsraelUnderAttack",
    "title": "Western academic Marxists concentrated in the faculty of humanities simply ignore it because of their hatred of Jews",
    "selftext": "",
    "score": 15,
    "num_comments": 0,
    "created_at": "2024-06-18T15:54:17"
  },
  {
    "post_id": "1dito9g",
    "subreddit": "IsraelUnderAttack",
    "title": "Extremist Islamist group infiltrates Australia’s pro-Palestine movement",
    "selftext": "",
    "score": 20,
    "num_comments": 5,
    "created_at": "2024-06-18T15:37:57"
  }
]