[
  {
    "post_id": "1q9y59l",
    "subreddit": "Palestine",
    "title": "Israeli soldiers mock a blindfolded Palestinian detainee inside detention.",
    "selftext": "",
    "score": 119,
    "num_comments": 6,
    "created_at": "2026-01-11T12:27:21"
  },
  {
    "post_id": "1q9xgwn",
    "subreddit": "Palestine",
    "title": "Zionism Exposes Its True Face Every Day.",
    "selftext": "",
    "score": 171,
    "num_comments": 2,
    "created_at": "2026-01-11T11:50:21"
  },
  {
    "post_id": "1q9vdxr",
    "subreddit": "Palestine",
    "title": "Original (ca. 1844) and colored: the oldest photo of the Al-Aqsa Mosque on the Temple Mount, Jerusalem.",
    "selftext": "",
    "score": 5,
    "num_comments": 2,
    "created_at": "2026-01-11T09:44:41"
  },
  {
    "post_id": "1q9uqrx",
    "subreddit": "Palestine",
    "title": "May he and all the victims of this genocide rest in eternal peace!",
    "selftext": "",
    "score": 84,
    "num_comments": 6,
    "created_at": "2026-01-11T09:04:27"
  },
  {
    "post_id": "1q9udhd",
    "subreddit": "Palestine",
    "title": "At this point, even their first Prime Minister was admitting it.",
    "selftext": "",
    "score": 119,
    "num_comments": 4,
    "created_at": "2026-01-11T08:41:32"
  },
  {
    "post_id": "1q9u6dp",
    "subreddit": "Palestine",
    "title": "From a pro-Palestinian protest in Manchester, United Kingdom",
    "selftext": "",
    "score": 308,
    "num_comments": 3,
    "created_at": "2026-01-11T08:29:14"
  },
  {
    "post_id": "1q9py0o",
    "subreddit": "Palestine",
    "title": "“Win hearts and minds”.\n\nNothing to see here, just 'The Economist' trying to rehabilitate the image of a wanted war criminal. This is how you normalize genocide.",
    "selftext": "",
    "score": 366,
    "num_comments": 27,
    "created_at": "2026-01-11T04:34:49"
  },
  {
    "post_id": "1q9lael",
    "subreddit": "Palestine",
    "title": "Israel is quietly erasing Palestinian refugee camps from existence in the West Bank",
    "selftext": "",
    "score": 212,
    "num_comments": 1,
    "created_at": "2026-01-11T00:58:24"
  },
  {
    "post_id": "1q9hzy6",
    "subreddit": "Palestine",
    "title": "Embarrassing for Blake",
    "selftext": "",
    "score": 288,
    "num_comments": 6,
    "created_at": "2026-01-10T22:38:28"
  },
  {
    "post_id": "1q9hzt1",
    "subreddit": "Palestine",
    "title": "A Polish Girl, Completely Unaware of Her Zionist Indoctrination, Ironically Claims That Palestinians Are Trying to Take Her Home Away.",
    "selftext": "",
    "score": 1876,
    "num_comments": 68,
    "created_at": "2026-01-10T22:38:19"
  },
  {
    "post_id": "1q9hg7q",
    "subreddit": "Palestine",
    "title": "You can print anything on a flyer, doesn't mean it's true. I know plenty of Jewish people currently living in good homes with loving families - and not a single one of them had to steal said home from a Palestinian family.",
    "selftext": "",
    "score": 1167,
    "num_comments": 78,
    "created_at": "2026-01-10T22:15:55"
  },
  {
    "post_id": "1q9flda",
    "subreddit": "Palestine",
    "title": "Israeli occupation forces demolish buildings in the Abu Zaytoun area of Jabalia camp, northern Gaza.",
    "selftext": "",
    "score": 260,
    "num_comments": 1,
    "created_at": "2026-01-10T21:03:43"
  },
  {
    "post_id": "1q9ff3z",
    "subreddit": "Palestine",
    "title": "Abdul Rahim is released after being locked up for years for criticizing Israel",
    "selftext": "",
    "score": 125,
    "num_comments": 1,
    "created_at": "2026-01-10T20:57:09"
  },
  {
    "post_id": "1q9feuy",
    "subreddit": "Palestine",
    "title": "making my own thobe",
    "selftext": "hello everyone, i want to make my own thobe but im not even sure where to start. i’ve been doing tatreez for 3 years now and ive only seen kits that are 600+ for simply the design and material. is there a way i can create my own thobe without having to pay for these expensive kits? does anyone have suggestions? ",
    "score": 21,
    "num_comments": 4,
    "created_at": "2026-01-10T20:56:53"
  },
  {
    "post_id": "1q9fe13",
    "subreddit": "Palestine",
    "title": "Israeli settlers with support from their army ethnically cleanse Ras Ein Al-Auja in the West Bank",
    "selftext": "",
    "score": 53,
    "num_comments": 1,
    "created_at": "2026-01-10T20:55:57"
  },
  {
    "post_id": "1q9fbvz",
    "subreddit": "Palestine",
    "title": "Israel is planning to demolish a youth football soccer field in the West Bank",
    "selftext": "",
    "score": 72,
    "num_comments": 2,
    "created_at": "2026-01-10T20:53:31"
  },
  {
    "post_id": "1q9dlx5",
    "subreddit": "Palestine",
    "title": "SANCTIONED For Criticising Israel",
    "selftext": "",
    "score": 94,
    "num_comments": 7,
    "created_at": "2026-01-10T19:47:05"
  },
  {
    "post_id": "1q99wym",
    "subreddit": "Palestine",
    "title": "Fake kufiya",
    "selftext": "Hello, I recently bought a kufiya and researched its origin. I bought it intending to support Palestine, but I didn't consider the pattern. The kufiya I bought has a generic checkered pattern. If wear it, will people see it as offensive until I can get an authentic one?\nThe one I bought has a pattern similar to the one in the first photo, and from what I understand, the Palestinian kufiya has the pattern in the second photo.",
    "score": 186,
    "num_comments": 45,
    "created_at": "2026-01-10T17:26:02"
  },
  {
    "post_id": "1q95bkc",
    "subreddit": "Palestine",
    "title": "Israel’s Use of Drones as Bait and a Tool of Psychological Warfare in Gaza.",
    "selftext": "",
    "score": 811,
    "num_comments": 12,
    "created_at": "2026-01-10T14:23:16"
  },
  {
    "post_id": "1q94l5s",
    "subreddit": "Palestine",
    "title": "Don't bulldoze our pitch - petition",
    "selftext": "This is the petition shared by Ms Rachel to stop the demolition of Aida's football pitch. FIFA won't care, but who knows, doesn't take long to sign.",
    "score": 142,
    "num_comments": 4,
    "created_at": "2026-01-10T13:52:20"
  },
  {
    "post_id": "1q9v141",
    "subreddit": "IsraelPalestine",
    "title": "No honest person can support Israel ever. And I'll prove it.",
    "selftext": "Nobody can look at the West Bank and say they support Israel ever. Israel has inflicted a disgusting military occupation in the West Bank since 1967. They hv been stealing lands and building settlement in the West Bank every year SINCE 1967 even when peace talks were being held. At no point did they ever intendto leave West Bank. Even today their is no indicatipn whatsoever from Israel that they are ever going tosstop stealing their lands and their basic human rights.TTheres no hamas in the wb, the only terrorist grp iin the wb is the iof. The iof have slaughtered over 200 children inthea past two yrs, this is china and NK levels if evil. 60% of the land has already been stolen and theyare never stopping. \n\nIt is internationally recognized that the wb does notbbelong to Israel. All USApresidents hv tried to stop themfrom stealing more land and guess what not even they could exert any pressure on Israel.Israel is US's welfare state btw and yet have no leverage over them at all. Donald Trump the most proIsrael us President ever has made it clear he would not allow Israel to annex the West Bank. When Jd vance, was in Israel couple months ago, guess what Israel did? They held a voting in the knesset to annex the  wb almost like telling the US to f off. JD was crying about being insulted by this btw. I guess if USA can't stop them from annexing the wb,then nothing can. \n\nI didn't even bring up gaza btw. Just looking at the wb can make anybody anti Israel. It's that level of evil. I\n\nIsrael believes wb belongs to them and wants the Palestinians to die or disappear. The only people in the world who will say wb belongs to Israelare jewish Zionists and paid Zionist propagandists. Not even Christian Zionist support Israels ethnic cleansing of the West bank. \n\nIt's basically one side losing their lands homes and their dignity while another side keeps stealing it. No half decent person  can look at it and say I support Israel ever. \n\nIf you want to reply to this, answer whether wb belongs to Israel at the start of your comment. \n\n[View Poll](https://www.reddit.com/poll/1q9v141)",
    "score": 0,
    "num_comments": 36,
    "created_at": "2026-01-11T09:22:20"
  },
  {
    "post_id": "1q9pgcr",
    "subreddit": "IsraelPalestine",
    "title": "I don’t understand why most Israelis/Zionists are shocked or confused by the growing hatred",
    "selftext": "I don’t understand why most Israelis/Zionists are shocked or confused by the growing hatred\n\nWith the exception of a few self-aware commentators, almost every Israeli and Zionist I encounter seems to be genuinely bewildered by the intensifying global hatred for Israel. This is honestly amazing to me.\n\nFrom my POV as a former Liberal Zionist, the reason is almost comically obvious: Israel is oppressing, expelling, and killing Palestinians for the benefit of Jews, and Israel is doing all of this with the unceasing support of virtually every Western gov’t along with nearly all organized mainstream Jewish institutions.\n\nFor anyone who is not already invested in the Zionist project, this looks absolutely insane and cruel. Israel has been bombing Gaza non-stop since the so-called “ceasefire”, with nearly 500 Palestinians killed in that time. Israel will never face any consequences for that. If another country that wasn’t aligned with the West committed the exact same actions as Israel, it would be sanctioned into oblivion and condemned unequivocally by almost every Western gov’t. Meanwhile with Israel, not only does Israel generally avoid sanction and serious condemnation, Israel receives impassioned rhetorical defenses and direct military support from the West. Most people notice this hypocrisy.\n\nThe bottom line is that the primary driver of the growing global hatred of Israelis and Zionists is sympathy for the suffering and struggle of Palestinians at the hands of Israel. Israelis don’t get that sympathy because they are not being oppressed by anyone, they themselves are doing the oppressing, and they are doing it with virtual impunity.\n\nI’m asking this seriously: Why would Israelis/Zionists expect anyone to sympathize with the Israelis in light of this context?",
    "score": 0,
    "num_comments": 98,
    "created_at": "2026-01-11T04:09:46"
  },
  {
    "post_id": "1q9n9pd",
    "subreddit": "IsraelPalestine",
    "title": "So what is going on with West Bank?",
    "selftext": "As of four days ago, there’s various videos on tik tok of people saying that IDF has removed many or all barriers, blockades in West Bank. They have removed soldiers from checkpoints that haven’t been open in twenty years. Saying Israel is gearing up for something. Is it a bad something or a good something? The tone is usually worried, cautious, ominous. \n\nDid whatever that was supposed to happen already happen or is it upcoming? ",
    "score": 2,
    "num_comments": 19,
    "created_at": "2026-01-11T02:26:03"
  },
  {
    "post_id": "1q9lkag",
    "subreddit": "IsraelPalestine",
    "title": "I’m confused if Jews are native to the land, where do Palestinians come from. Are they descendants of Canaanites who never became Jewish or Samaritan?",
    "selftext": "So from what I’ve heard and what the Bible and Jewish text say the land was originally inhabited be Canaanites and Canaanites like the Phoenicians became the ancestors of modern Lebanese people and the name itself is Canaanite leban mean white like levan in Hebrew. \n\nBut so the original land of Canaan was inhabited by Canaanites then the Jews appear who seem to be a later cultural evolution of Canaanites who started to worship the thunder god Yahweh as the one true god. \n\nSamaritans are Jews who claim to descend from Jews who were never exiled to Babylon.\n\nHowever like the Bible says the land was never fully unified and several non Jewish Canaanites still persisted in the land those Canaanites who never adopted Judaism became Palestinians. \n\nOr more accurate during the Hyksos sea people invasions pirates from southern Greece migrated to the Levant mixed with the non Jewish Canaanites in Gaza creating the philistines but the philistinism would lose their language and culture and by the time of Jesus would have been the Greek speaking non Jewish population in the area \n\nPalestinian Christian’s descend from Samaritans converts who were converted Jesus first disciples and by the time Islam came to the land the non Jews living in the land who Christian became Muslim creating Arabic speaking Palestinians \n\n",
    "score": 0,
    "num_comments": 52,
    "created_at": "2026-01-11T01:10:02"
  },
  {
    "post_id": "1q9jbub",
    "subreddit": "IsraelPalestine",
    "title": "If Israel and the USA want to intervene in Iran, they have to do so soon.",
    "selftext": "It's been 2 days since the barbaric mullah regime has cut off the internet and all other means of communication. Some reports suggest that several hundred protesters have been murdered in the last 24 hours. And the regimes' crackdown is intensifying with every passing hour. I have posted about a possible intervention by Israel and the US a few days back and as the regime has crossed Trumps red line multiple times, it seems to me that the window of oppertunity for a successful intervention might not be open for much longer.\n\nAnalysts propose some viable options before a military strike into Iran itself. Mostly seizing it's oil tankers, as this would massively decrease the regimes revenue and ability to pay its goons and militias. Especially Israel could help the protesters via cyberattacks against the IRGC and the security forces, to hinder their coordination and demoralise them as well. And lastly, striking the compounds and bases of the IRGC, basij and security forces. Supplying protesters with weapons seems far fetched at the moment and as the regime is now mercilessly mowing down protesters the best course of action is to attack these forces directly.\n\nI dearly hope that outside intervention won't be necessary. Given that the regime is being so hellbent on survival and showing no remorse and especially having its own army with the IRGC, to me it seems the protesters need some kind of outside assistance to overthrow this vile regime. If Trump doesn't intervene after all this promises he has the blood of thousands of Iranians on his hands...     Free Iran from ☪️ancer🦁🇮🇷🙏🏽",
    "score": 18,
    "num_comments": 76,
    "created_at": "2026-01-10T23:34:46"
  },
  {
    "post_id": "1q98ecg",
    "subreddit": "IsraelPalestine",
    "title": "I have lost hope, and I’m at peace with it.",
    "selftext": "I came to this sub reddit to understand the opinions of Israeli’s directly. I had another post intended to understand Smotrich and Ben Gvir in the context of how Isreali’s felt about them. It was really helpful, and I feel like learned a lot. Unfortunately, I’m also disillusioned…\n\nMany, many of the responses would reflexively pivot away from the topic to some version of the following:\n\n•\t⁠the Palestinians (generalized group) want to kill us and eliminate Israel\n•\t⁠isreali’s are exhausted with peace, and after Oct. 7th are no longer hopeful for a peaceful solution.\n•\t⁠isreal is a democracy with varying political opinion and beliefs, some of which should not be assumed to represent a sizable portion of the country. Buuuuuuut… that same thinking cannot be extended to pro-Palestinian supporters or Palestinian opinions on peace or violence as a whole.\n•\t⁠reflexive “but you know what they did?” “Here is what they think!” “What about Hamas” so on and so forth\n\nThere is no room to discuss what those you disagree with want, feel, think, etc. it is immediately assumed they all feel the same way and have the same goals. Everything is sent through the prism of “us vs. them”. It is not possible to discuss for instance, the deaths of Gazans alongside the deaths of isreali’s. One was an unprovoked attack, and the other is merely collateral damage. This of course implies that maybe there is no such thing as an innocent Palestinian.\n\nThere is so much anger. So much intrenched, rigid rhetoric. Forget peace, we can’t even acknowledge our shared humanity. Everyone is an enemy unless they support us.\n\nSome of you will read this and empathize. Others will simply respond “but what about the evil fill in the blank.\n\nWhat I think will happen: Israel will take Gaza, or at least a sizable portion of it, and displace Palestinians. Those in the West Bank will never have a sovereign country. They will eventually be killed or removed as well, possibly following another attack or just slowly by Israeli extremist provicateurs. Isreal will “win”, whatever that may mean.  There will never be peace, because there is no reason for it.\n\nThe perspective that this may not be fair or just for Palestinians, will be responded with some version of “they asked for it”, “they refused to be a partner for peace”, or “they attacked us”. Therefore, the Palestinian living in Jerusalem only has himself to blame, or his leaders.\n\nSo the same impulse that murdered Rabin is not the same impulse that planned Oct. 7th. Extremism and murder are not the same, but merely justified and defended.\n\nWe don’t believe in a shared human experience. We don’t believe all humans are created equal and deserve equal respect. We are not interested in why some people are angry or have opinions that differ from us. We believe in tribes, and you are either in the club or you’re a problem.\n\nEDIT: some of the responses here have been helpful for me (selfishly). I do feel I have a better understanding. I can appreciate now: why many Israeli’s need the dialogue to start with an acknowledgement that Hamas is responsible for the events of the last several years. I’m willing to extend that understanding as a basis for the conversation. Can we discuss our shared humanity and the plight of peoples using that as a springboard? Thank you. ",
    "score": 5,
    "num_comments": 343,
    "created_at": "2026-01-10T16:27:13"
  },
  {
    "post_id": "1q952r7",
    "subreddit": "IsraelPalestine",
    "title": "If U.S. military aid to Israel ends, will American engagement with Gaza and Israel actually decline, and what replaces the justification for caring?",
    "selftext": "For the past two years, one of the most common explanations I have heard for why Americans care so intensely about Gaza is this claim:\n\n“U.S. tax dollars are paying for the bombs being dropped on Palestinian civilians.”\n\nThat framing has been central to protests, campus activism, and political pressure, especially among people who otherwise say they oppose U.S. involvement in foreign wars.\n\nAt the same time, many people also recognize a degree of hypocrisy in this position. The United States funds or enables military actions that cause civilian harm in many places around the world, yet only Israel Palestine has generated this level of sustained moral outrage, protest culture, and personal identification. Comparable or worse humanitarian crises often receive minimal attention.\n\nPrime Minister Netanyahu has now suggested publicly that within roughly ten years Israel will no longer need or receive U.S. military aid, as Israel becomes more militarily self sufficient.\n\nThat raises a serious question:\n\nIf U.S. military aid ends, does American public engagement with the Israel Palestine conflict meaningfully decrease, or does the justification for caring simply change?\n\nSome related questions I am curious about:\n\n\t•\tIf U.S. tax dollars are no longer funding Israeli weapons, does this conflict start to resemble other foreign wars Americans largely observe at a distance, such as Ethiopia, Yemen, or Sudan?\n\n\t•\tIf not, what becomes the new pretext for prioritizing Israel Palestine above other comparable situations? Is it civilian casualties, identity politics, religious connections, symbolism, or something else?\n\n\t•\tWill the argument shift from “we are funding this” to “we are enabling this diplomatically” through UN vetoes, trade relationships, or intelligence cooperation?\n\n\t•\tAnd for supporters of the protest movement, how do they reconcile the selective focus on Israel with relative silence on other U.S. backed or U.S. adjacent conflicts that also involve large scale civilian harm?\n\nI am genuinely interested in whether U.S. taxpayer involvement is the real driver of American attention, or whether it has functioned mainly as a convenient moral framing layered on top of deeper political, cultural, and ideological commitments.\n\nCurious to hear thoughtful perspectives from all sides.",
    "score": 23,
    "num_comments": 260,
    "created_at": "2026-01-10T14:13:03"
  },
  {
    "post_id": "1q911ws",
    "subreddit": "IsraelPalestine",
    "title": "On the “Israel” and “Palestine” Nomenclature",
    "selftext": "This is a side of the debate I do not see discussed frequently.\n\nIsrael is a people. Judea is a nation. Names, borders, and empires have changed repeatedly, across Roman, Byzantine, Ottoman, and British rule, yet the people persist. It is my opinion that the current debate confuses the two, treating ancient history like a current argument.\n\n“Palestine” comes from the Hebrew Pelesheth, meaning “Land of the Philistines.” The Romans later applied it to Judea after crushing a series of major revolts, most notably Bar Kokhba, literally attempting to erase Jewish identity. Britain revived the term administratively under the Mandate, turning it into a political label for governance purposes. Arabs adopting it as a national identity is largely a 20th-century phenomenon, perhaps in part a reaction to the return of Jewish sovereignty, but the idea that this terminology is an ancient plan to erase Israel is historically absurd. Ironically, both “Palestine” and “Israel” are politically loaded labels designed to propagandize, yet few are willing to confront that fact.\n\nFinally, most Jews, Palestinians, Israelis, and Arabs do not hold personal responsibility for the decisions of political elites. Blood guilt, and collective moral essentialism are morally and intellectually bankrupt concepts and irrespective of what’s happening in the strip they have no place in the conversation. Understanding history, separating identity from politics, and rejecting collective blame is the only way to have a conversation that actually gets past propaganda, tribalism, and outrage.\n\nWhat do you guys think? Why do you think so few people are willing to confront the history behind these names? Does insisting on historical nuance actually help prevent moral essentialism in these debates? What would a debate that fully accounted for historical, linguistic, and moral nuance even look like? Or do you just think I’m full of kak? Let me know.\n\nEDIT: I love this post’s replies, even though I disagree with some of you (or you with each other), you all taught me a lot. Every time I invite discourse on subjects as complex as these, I am reminded of how little I know and the importance of listening more than I speak. I encourage everyone to listen to each other a little bit more and focus on the shared piece of humanity and the divine spark we all share. At this point in time I will let you guys take the floor, I have and will read all of the responses but do not have time to respond, nor do I feel the need to. I think listening is just fine for now.",
    "score": 2,
    "num_comments": 60,
    "created_at": "2026-01-10T10:43:02"
  },
  {
    "post_id": "1q8m3tq",
    "subreddit": "IsraelPalestine",
    "title": "When Activism Becomes a One-Sided Moral Performance",
    "selftext": "I’m honestly exhausted by the way “human rights activism” works these days. At least the version of it that only shows up when it’s convenient.\nLook at Iran. Not historically. Not academically. \n\nRight now.!!\n\nPeople are being beaten, shot, arrested, tortured, and killed in the streets for standing up to their own regime. Women are harassed and assaulted by morality police. Protesters vanish into prisons. Families are silenced through fear. None of this is controversial. None of this is unclear.\n\nAnd yet… silence.\nNo flotillas.\nNo viral hashtags.\nNo constant Instagram stories.\nNo moral outrage marathons.\n\nThe same people who suddenly find endless energy, passion, and certainty when it comes to Israel are nowhere to be found.\n\nWhen Israel is involved, the response is instant and aggressive. The world becomes black and white. There is no room for nuance, context, or even basic questions. If you hesitate or ask for balance, you’re immediately labeled immoral, complicit, or evil.\n\nBut when an authoritarian Islamist regime openly brutalizes its own civilians, those loud voices suddenly go quiet. Or worse, they hide behind vague phrases like “it’s complicated” or simply move on.\n\nLet’s be clear: this isn’t empathy.\nIt isn’t courage.\nIt isn’t moral consistency.\nIt’s selective outrage.\n\nIf your concern for civilians depends on who the oppressor is, then your values aren’t universal. Dead civilians in Tehran are not less tragic than dead civilians anywhere else. A woman beaten by Iranian morality police does not deserve less outrage because her abuser doesn’t fit a preferred activist narrative.\n\nWhat really bothers me is the hypocrisy wrapped in moral superiority. These activists speak as if they own the definition of justice, while applying it selectively. They don’t stand for humanity. They stand for a side.\n\nAnd let’s be honest about why. Criticizing Israel is socially rewarded in many activist circles. It brings applause, validation, and visibility. Criticizing Iran costs you allies, likes, and ideological comfort. So silence becomes the easier option.\n\nBut silence here is not neutrality.\nIt’s a choice.\n\nIf your activism can’t condemn oppression everywhere with the same voice and the same intensity, then stop calling it activism. Call it what it really is: politics dressed up as morality.\nReal humanism doesn’t follow trends.\n\nIt doesn’t pick enemies.\nIt picks principles.\n\nSo let me know if you agree with me or not !!!",
    "score": 81,
    "num_comments": 173,
    "created_at": "2026-01-09T22:15:12"
  },
  {
    "post_id": "1q87jtz",
    "subreddit": "IsraelPalestine",
    "title": "Protesters in Queens Chant \"Say It Loud, Say It Clear, We Support Hamas Here\"",
    "selftext": "The pro-Palestine movement has been explicitly pro-Hamas since October 7th, [but it's been somewhat rare to see such overt support as the chanting that occurred last night.](https://www.timesofisrael.com/protesters-chant-we-support-hamas-near-new-york-city-synagogue-jewish-school/)\n\n&gt; Anti-Zionist protesters in New York City chanted in support of Hamas at a rally near a synagogue and Jewish school on Thursday.\n\n&gt; The demonstration was the first significant protest under New York City Mayor Zohran Mamdani’s administration, and had raised safety concerns in the neighborhood, but police kept the protesters apart from neighborhood residents and away from the synagogue entrance.\n\n[The video of the protest](https://x.com/luketress/status/2009430503582257396?s=20), which has been posted to Twitter, clearly shows the chanting of the phrase \"Say it loud, say it clear, we support Hamas here.\"\n\nThis is far from the only example of overt support for Hamas from the pro-Palestine movement, but usually the support is things like Hamas headbands or flags or \"ambiguous\" phrases like \"we support the resistance.\"\n\nWhile I'm sure the pro-Palestine folks on here will be quick to point out that these protesters are just a few bad apples who totally don't represent anyone other than themselves, honest, I have to wonder, will any of the large pro-Palestine organizations like SJP or AMP condemn these protesters? Or will they just stay silent? ",
    "score": 198,
    "num_comments": 535,
    "created_at": "2026-01-09T12:56:50"
  },
  {
    "post_id": "1q85g7e",
    "subreddit": "IsraelPalestine",
    "title": "I think the day of Jihad debunking got muddled",
    "selftext": "\nShort version: I THINK HAMAS CALLED FOR PEACEFUL PROTESTS?\n\nThis says they called for action in the Arab and Islamic world\nhttps://www.wired.com/story/day-of-jihad-disinformation-israel-palestine/\nRumors of a ‘Global Day of Jihad’ Have Unleashed a Dangerous Wave of Disinformation | WIRED \n\nbut Hamas speak in slogans and stock phrases, when they say \"Arab and Islamic world\" they always end with a vague catchall of \"free people of the world\".\n\nTheir only localised versions speak to either Muslims or Arabs, and the latter is a fairly specific Muslim Christians solidarity thing \"the Islamic and Christian holy sites in Jerusalem\". I've not seen any recent unabridged quotes that do the ethnic and religious without throwing in a vague \"and everyone else\"\n\nAt first (given Bondi) I was wondering if It was real, but Daesh rather than Hamas, and then Hasbara decided to signal boost it (because they always help Daesh spread their propaganda)\n\nBut it's attributed to Hamas, and not Hamas as a euphemism for al Qassam, actual political wing. They often call for protests. And they very specifically don't call for violence outside of the borders of British Palestine (the only exception I've even heard of is violence against Daesh in Syria, and some vague greetings to resistance fighters in ongoing battles elsewhere).\n\nThis is actually an entirely reasonable and peaceful action that is typical of how they usually act. But I've been unsure of how much to point it out because it wouldn't get \"most of the actions Hamas take are non-violent\" instead of gets twisted into \"the protesters are terrorists\"!!\n\nBecause they actually have been calling for this since 7 October, they called for attacks on Israel, and protests / boycotts / prayer elsewhere. Even in East Jerusalem they sometimes suggested unarmed actions. There is room for disingenuous interpretation \n\nMeanwhile, the neonazi rally in Sydney in November got a police approval!?\n\nDaesh called for violence against Jews and Christians worldwide, but I don't think they had anything specific for that day. They latch onto any cause to hijack it. Previous recent recognition were the Christchurch massacre and the Uyghur genocide.\n\n",
    "score": 0,
    "num_comments": 6,
    "created_at": "2026-01-09T11:04:47"
  },
  {
    "post_id": "1q8503i",
    "subreddit": "IsraelPalestine",
    "title": "Do you have a must read book to help people side with your view over the Israeli Palestinian conflict",
    "selftext": "Sometimes this sub can get very heated (understatement of the decade!) and it feels like each side has their own evidence and literature to change the others’ views. \n\nNow, this post isn’t a request to have my view changed, there are subreddits for exactly that. What this post is though, is for both sides to convince me through literature. \n\nI had been thinking what kind of literature I would like to read; articles, history, books, etc. I finally decided on books. \n\nSo, please suggest I read a book (**one book suggestions only!**) to help see the other side’s arguments. The comment/suggestion with highest votes (from either side) is the book I will purchase. My plan is to read the book on Israel first because alphabetically speaking I comes before P. \n\nI am also aware that I have a bias which will shape my reading, but *every*one has a bias. Let’s not even pretend otherwise. I will see the upvoted suggestions and whichever one is highest voted by 23:59 Sun. 11.1.2026. \n\nI will genuinely be critically reading the books and I am happy to give photo evidence of purchase too. \n\nPlease leave the flame wars behind and thank you. \n\n_____\n\nDear Mods, I don’t think this post breaches any rules but please let me know which ones it did and what to reformat. I hope you will allow this post to remain. ",
    "score": 10,
    "num_comments": 120,
    "created_at": "2026-01-09T10:39:02"
  },
  {
    "post_id": "1q7lvt5",
    "subreddit": "IsraelPalestine",
    "title": "Muslims and Pro-Palestinians have to make up falsehoods about not just Israel, but Jewish heritage entirely",
    "selftext": "I had a conversation with a Palestinian who suddenly went full antisemite and started saying Jews were lying about their heritage, and every aspect of their heritage that they preserved for thousands of years is a lie. Edit: I've seen tons of Pro-Palestinians say these same things over and over. Specifically, they rant antisemitic conspiracy theories like:\n\n* \"Jews are just European converts pretending to be related to ancient Israelites.\" Genetic studies make it obvious this is nonsense, as anyone who has been on a DNA subreddit or looked at any genetic studies about this can tell. This conspiracy theories is often accompanied by the long debunked Khazar theory -- also disproved by the discovery of DNA. Also accompanied by the also nonsense claim that Israel makes DNA tests illegal to hide Jews' real origins — as though plenty of Jews in the disapora don't exist and can take DNA tests.)\n* \"Modern Hebrew is actually Arabic and not related to Ancient Hebrew.\" This is obvious nonsense — as any modern Hebrew speaker knows, modern Hebrew is just ancient Hebrew with more words and some mild grammatical changes. Modern Hebrew speakers can read ancient Hebrew just fine. They cannot, however, understand Arabic, because it is a totally different language, and Arabs cannot understood Hebrew either. The language had a revival, it was not invented from scratch, and certainly not from Arabic.\n* \"Jews steal Palestinian clothes.\" That was a new one for me, no idea what they mean by it. Kind of proves that they are just throwing everything at the wall to deny Jewish identity. Also, seems quite obvious that Palestinians wear Western clothes.\n* \"Jews steal Palestinian food.\" Jews have lived in Israel for thousands of years continuously and have been making and eating the food traditional to that place too. When Jewish refugees joined the Jews already living in Israel, they started eating that food too. Being a minority doesn't mean you don't eat or cook. Besides, Palestinians eat plenty of originally Turkish food ... So what?\n\n**I didn't make this post to debate these things — they're pretty obvious antisemitic garbage that folds upon any good faith examination. What I am interested in is the why.**\n\n* Why do so many Muslims and Pro-Palestinians feel so threatened by the clear indigenous Levant culture and heritage of Jews that they have to make up lies about it? If they have to lie to uphold their beliefs, doesn't that indicate their beliefs are wrong and their entire movement is based on lies?\n* Do any of them feel guilty for supporting a movement where they know they have to lie about a persecuted indigenous culture to believe in?\n* How can they say they aren't antisemites when these offensive things about Jewish heritage apply to all Jews, not just the ones in Israel?\n* And for the Pro-Palestinians who haven't gone down their heritage denying rathole — does the fact that so many of your compatriots have make you reflect on your movement, and wonder if it's based in prejudice and racial supremacy? Do you try to correct them, or do you think it's okay for them to spread racist lies about a minority \"for the greater good\" or something?\n\nEdit: Some people here say that I made up imaginary Pro-Palestinians, and Pro-Palestinians actually never say these things. Here's a quote from this very subreddit from a Pro-Palestinian:\n\n*\"You copy our clothing, you copy our food, you copy our music, you even constructed your false language using ours as a basis. You are absolutely obsessed with us ... You are absolutely obsessed with us. You are occupiers, but you are also stalkers ... \"*\n\nAnd then when I explained that hebrew is not copied Arabic, they said:\n\n*\"How amusing that you don’t even know how modern Hebrew was created. There’s no point discussing further with someone so ignorant about his own false language. I suggest you start reading instead of posting your pathetic feelings.\"*",
    "score": 139,
    "num_comments": 291,
    "created_at": "2026-01-08T19:47:22"
  },
  {
    "post_id": "1q7b1q0",
    "subreddit": "IsraelPalestine",
    "title": "Bambie Thug: \"Yeah, I would totally play in Russia if I could\"",
    "selftext": "After years of harassing and hating on Israel, Irish Eurovision loser (that's not a personal attack, they literally lost Eurovision) [Bambie Thug declared on their Instagram that she would totally play a concert in Russia if it wasn't for those pesky sanctions.](https://eurovisionfun.com/en/2026/01/bambie-thug-if-i-had-the-opportunity-to-sing-in-russia-i-would-have-already-done-so/)\n\n&gt; Ireland’s representative at Eurovision 2024, Bambie Thug, has become known not only for their participation in the contest but also for their harsh statements against Israel. In contrast to the boycott they has imposed on their own Eurovision song due to Israel’s presence in the competition, the Irish artist does not appear to have any issue with Russia, as they explicitly stated.\n\n&gt; In an Instagram story posted by Bambie Thug, they wrote:\n\n&gt; **“If I had the opportunity to sing in Russia, I would have already done so. I love my Russian fans and I do not ignore them.”**\n\nThis individual had demanded that Israel be kept out of the competition and refused to perform their song from it until Israel is removed. Apparently, though, their high minded principles don't prevent their from performing, in theory, for an aggressor state trying to take over its neighbor and killing thousands in the process. They \"loves their Russian fans\", presumably they hates their Israeli fans (if they even had any?)\n\nAre there any anti-Israel people out there that aren't total hypocrites?",
    "score": 69,
    "num_comments": 162,
    "created_at": "2026-01-08T12:54:46"
  },
  {
    "post_id": "1q6tw3c",
    "subreddit": "IsraelPalestine",
    "title": "Unpopular Opinion: \"Indigenous\" is not a valid argument",
    "selftext": "I have heard people use term \"Indigenous\" to argue their heritage and right to live in a country. Saying things like \"I am Native American, I am Indigenous to this country\". Or more recently, \"Palestinians/Jews are/are not indigenous to the Levant\". At this point, I don't even think people realize that \"Indigenous\" has no valid meaning.\n\nHuman history and settlement are not as straightforward as they may seem. Humans have moved across this planet and settled on every chunk of habitable land they can find. People Groups have fought and intermixed with each other for thousands of years. Given this information, what exactly defines \"Indigenous\"? Are the English indigenous to England? Or are the Finns indigenous to Finland? Trick question, both of these ethnicities immigrated to what is now their respective countries from different parts of the world, yet today they are seen as \"indigenous\" to these lands.\n\nMoreover, are all humans technically indigenous to Africa since that's where the earliest humans originated from? By that logic, Afrikaners are not technically colonizers, then, since they are returning to the \"respective homelands\" of their ancestors. By now, you see how inconsistent the definition of \"Indigenous\" is. A more accurate statement would be the longevity of your specific ethnicity and its connection to said land. Assuming you are Ashkenazi Jewish or a 5th-generation descendant of Palestinian Refugees, that does not make you \"Indigenous\" to Israel or Palestine. It means you have ancestors who historically lived in these areas, but that does not mean you automatically have an unquestionable right to live there because you are \"indigenous\".",
    "score": 13,
    "num_comments": 244,
    "created_at": "2026-01-07T22:31:04"
  },
  {
    "post_id": "1q6ktt1",
    "subreddit": "IsraelPalestine",
    "title": "Somaliland’s Strategic Importance",
    "selftext": "“Look at Somaliland’s strategic location and you will understand everything.” (Israeli political official)\n\n\n\nAfter recognizing Somaliland’s independence, Israeli Foreign Minister Gideon Sa’ar revealed that Somaliland President Abdirahman Mohamed Abdullahi secretly visited Israel last summer, meeting with Prime Minister Benjamin Netanyahu, Foreign Minister Sa’ar, Defense Minister Israel Katz, and Mossad Director David Barnea.  Sa’ar arrived on an official visit to Somaliland on January 6, 2026, where he also met with the country’s president.\n\nSince Israel announced its recognition of Somaliland on December 26, 2025, a wave of condemnatory statements has swept across the Arab world, expressing support for the Somali state and its right to self-determination. As part of the growing backlash, Somalia has requested an urgent debate in the United Nations Security Council on Israeli recognition of Somaliland; the debate took place on December 29, 2025 and did not result in any condemnatory resolutions or even votes.\n\nSomaliland was historically a British protectorate and briefly gained independence in 1960 before merging with Somalia. Due to political instability and conflict, it later declared independence.\n\nSomaliland is located near the Bab el-Mandeb Strait, a major global shipping route; an estimated 12% of world trade passes through it. Now, the port of Berbera is becoming a strategically important trade and logistics hub. The port and military base are seen as a vantage point for monitoring the Red Sea and the Bab el-Mandab Strait, monitoring Yemeni military activity, including missile and drone launches, and monitoring Iranian naval movements.\n\nThis role fits in with Israel’s broader efforts to balance the influence of key regional powers, particularly Egypt and Saudi Arabia, and Turkey’s expanding strategic presence in Somalia. In particular, the recognition of Somaliland creates a new – Hamas, Gaza, Syria, Kurds – confrontation between Israel and Turkey.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nThis is an English summary of my Finnish article.[*”Somalimaan strateginen merkitys”*](https://arielfi.wordpress.com/2026/01/06/somalimaan-strateginen-merkitys/) ",
    "score": 11,
    "num_comments": 58,
    "created_at": "2026-01-07T16:59:55"
  },
  {
    "post_id": "1q69fiz",
    "subreddit": "IsraelPalestine",
    "title": "What does Free Palestine mean? Let me know your thoughts",
    "selftext": "I was originally in favor of a two-state solution but as time went on I realized that it sounds like a terrible idea.\n\nMy opinion is, that it's better to tackle any social injustices happing in Israel. If Palestine was left to it's own devices, they would be left to the mercy of Hamas and that's where the real social injustice begins. For instance: women and LGBT are safe in Israel. Under Islamist regime, however, there is a problem. \nIsrael has no state religion and that gives a lot of freedom and self-determination to people, especially ones that would otherwise be oppressed or persecuted for religious reasons.\n\nFurthermore, I'm not convinced Palestine as a state would last very long against its Muslim neighbors, who would probably incorporate it very quickly.\n\nI've stumbled across this [video](https://youtu.be/1RNBdBBx19c?si=clX3zk07KVyQnbxq) and I found many of my opinions expressed. Let me know your thoughts and how you imagine this conflict to be resolved.\n\nNowadays, I'm not sure what the stance of most Pro-Palestinians is on what they actually want. I support all the civilians that are part of this conflict, no matter what ethnicity and want them safe. \n\nZionism, to me, is self-determination of Jews in the homeland but that does not exclude the same for the other ethnicities whose homeland it also is.\n\nWhat is your ideal future? \n\nI'm honestly interested in a civilized discussion. War sucks and people are justifiably emotional about it BUT we are not the ones responsible and that's why I said that I support the civilians on Israels and Palestines sides.",
    "score": 28,
    "num_comments": 466,
    "created_at": "2026-01-07T07:51:35"
  },
  {
    "post_id": "1q604gn",
    "subreddit": "IsraelPalestine",
    "title": "Unpopular Opinion: The Modern State of Israel, U.S. Christian Nationalism, and the Antichrist/ False Prophet",
    "selftext": "Unfortunately I feel I must preface this by saying this is obviously NOT about Jewish people, Judaism, or Individual Israelis.Unfortunately I feel I must preface this by saying this is obviously an opinion not a declaration of fact, made about a state apparatus; NOT about Jewish people, Judaism, or Individual Israelis.\n\nIn Christian theology, the antichrist isn’t defined simply as something violent or evil. It’s defined by contradiction, claiming moral righteousness while acting in direct opposition to the values it invokes (justice, mercy, restraint, and protection of the innocent), while demanding loyalty and suppressing dissent. Taken symbolically, that framework is useful for evaluating how modern states justify their use of power.\n\nFrom that perspective, the modern Israeli state increasingly operates as a system that places itself above accountability. Its actions are consistently framed as defensive and necessary, historical trauma is treated as a standing moral exemption, and international law is applied selectively, if at all. Civilian casualties are minimized, legal criticism is reframed as hostility, and external scrutiny is treated as persecution rather than oversight. These are not isolated incidents; they are patterns of behavior.\n\nU.S. Christian nationalism plays a central role in sustaining this dynamic. By turning a modern nation-state into a sacred cause, it blurs the line between faith and policy. Criticism becomes heresy/ antisemitism, accountability becomes betrayal, and unconditional support becomes a moral requirement. As someone who spent decades inside hierarchical institutions, this logic is familiar. When authority wraps itself in moral absolutism, questioning it is treated as disloyalty rather than responsibility.\n\nWhen a state demands belief instead of evidence, exemption instead of law, and loyalty instead of accountability... while invoking sacred language to justify real world harm; it fits the antichrist archetype in the way the concept was originally intended. A warning about systems that claim righteousness while operating beyond restraint.\n\nIf the antichrist or false prophet is understood symbolically as a system that cloaks power in moral righteousness while placing itself beyond accountability, then it is at least plausible to apply that lens to the modern state of Israel. The persistent demand for unconditional loyalty, the framing of criticism as moral deviance, and the selective suspension of law are not theological claims but observable patterns of state behavior. At minimum, that alignment makes the comparison analytically defensible, even if one ultimately rejects the conclusion.",
    "score": 0,
    "num_comments": 14,
    "created_at": "2026-01-07T00:21:31"
  },
  {
    "post_id": "1q5zwpm",
    "subreddit": "IsraelPalestine",
    "title": "Why be Pro-Israel?",
    "selftext": "Hi y'all. I'm Pro-Palestinian, and I really want to have a good faith discussion about the ongoing conflict between Hamas and Israel. A lot of the discussions I have typically end in a screaming match, and we don't get anywhere in understanding the other person's position; I genuinely want to understand your POV. I'll list some Pro-Israel arguments that I've heard (I'm honestly trying not to present a strawman, but like I said, I don't fully understand your position) and my argument against it. Please rebut any argument I have made that you disagree with and be open to a civil discussion.\n\n1. Israel ought to exist as a nation for Jewish people.\n   * I don't believe an ethno-religious-state has a right to exist. Please note my wording. I am *not* saying that \"Israel has no right to exist,\" but that Israel as a country established strictly for Jewish people has no right to exist. This claim is not catered for a Jewish state; I oppose any state that aims for its entire population to be that of a single racial or religious group: Afghanistan, Iran, China, Pakistan, Egypt, etc.\n2. All Palestinians are terrorists who want to kill the Jews.\n   * To make such a broad-sweeping claim is disingenuous to the issue at hand. Of course, there are some Palestinians who want to eradicate all the Jews, just as there are some Israelis who want to eradicate all the Palestinians (I say some, but in a conflict as large and ongoing as this, it's likely that \"most\" could be applied to both parties). But to say \"all\" feels like an attempt by those in power to sway the opinion of the people.\n3. Palestinians started this conflict.\n   * The conflict started in 1917 when England established \"in Palestine... a national home for the Jewish people\" (Balfour Declaration, 1917) and was furthered in 1948 when Israeli Prime Minister David Ben-Gurion said, \"We must expel Arabs and take their places…and, if we have to use force...then we have force at our disposal.\" (Nur Masahla, Expulsion of the Palestinians, p. 66) During which, over 700,000 Palestinians fled or were expelled from British-controlled Mandatory Palestine. Since then, Palestine's borders and population have been shrinking.\n4. This is the price of war. \n   * From October 7, 2023–November 19, 2025 Israel has endured 1,654 fatalities and 8,295 injuries while Palestine has endured 61,158 fatalities and 151,442 injuries (Statista, 2025). This hardly feels justifiable. I'd be more inclined to agree if the numbers were similar, but Palestine has experience nearly 21x more damage than Israel. It feels like indiscriminate killing. Not to mention that Gaza has been flattened and now the Palestinians are living in tents because their homes are unlivable.\n\nThis post is taking longer than I anticipated, so I'll leave it at this. I hope we can have a constructive conversation. If you'd like me to elaborate on anything or if you have any sources for me to look up please share.",
    "score": 0,
    "num_comments": 185,
    "created_at": "2026-01-07T00:12:54"
  },
  {
    "post_id": "1q5xjte",
    "subreddit": "IsraelPalestine",
    "title": "As an Israeli - the Rapid Ascension of Kahanism Frightens Me",
    "selftext": "I was banned for trying to post this in the \"Jewish\" subreddit for some strange reason so I am posting this here in the hopes that it generates a productive discussion:\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nWhen the xenophobic, racist, and fascist demagogue Meir Kahane entered the Knesset in the 1980s with his Kach Party, it was the right-wing Likud that forcefully condemned him and played a key role in ensuring his party was ultimately banned. In 1988, Israel’s Central Election Commission disqualified Kach from participating in elections on the grounds that it was racist and undemocratic, acting under legislation specifically designed to bar Kahane’s movement. Likud MK Dan Meridor publicly expressed shock at Kahane’s proposals, which included banning sexual relations between Jews and non-Jews, segregating Jewish and Arab neighborhoods, and prohibiting any meetings between Jewish and Arab youth.\n\nSee this 1988 NYT Article: [https://www.nytimes.com/1988/10/06/world/israel-bans-kahane-party-from-election.html](https://www.nytimes.com/1988/10/06/world/israel-bans-kahane-party-from-election.html)\n\n\"The Central Election Commission today banned Rabbi Meir Kahane's party from parliamentary elections next month on the grounds that it is racist and undemocratic. The commission ruling, on a vote of 28 to 5, was made under a law written three years ago specifically to disqualify Rabbi Kahane's Kach party from elections. Rabbi Kahane, an American emigre, advocates forcible expulsion of all 2.2 million Arabs from Israel and its occupied territories...Dan Meridor, a Parliament member from Likud, said he had been shocked by some of the bills and motions Rabbi Kahane placed before Parliament in the last four years. Among them were bills, all of them unsuccessful, that would have prohibited sexual relations between Jews and non-Jews. Another would have separated Arab and Jewish neighborhoods. And still another would have forbidden meetings of any sort between Arab and Jewish youths.\"\n\nToday, however, ideological heirs of Kahane, such as Itamar Ben-Gvir and Bezalel Smotrich, hold senior ministerial positions in the Israeli government. These figures openly embrace Jewish supremacist, authoritarian, and homophobic views, and promote a fanatical messianic vision that demands Jewish settlement of the entire biblical Land of Israel to hasten the coming of the Messiah.\n\nThe danger is that these once-fringe ideas are now being normalized. Likud, having sidelined or expelled many of its more liberal and pragmatic voices (previous moderates like Meridor, Begin, Ya-aalon etc. have been purged by Netanyahu from the Likud) increasingly supports or enables these extremists, allowing their rhetoric to enter the political mainstream.\n\nThis trajectory is deeply damaging: it is bad for Israel, bad for Jews worldwide, and likely to fuel both antisemitism and further radicalization.\n\nI am deeply worried.",
    "score": 67,
    "num_comments": 131,
    "created_at": "2026-01-06T22:38:40"
  },
  {
    "post_id": "1dph3cc",
    "subreddit": "IsraelUnderAttack",
    "title": "Spain's leftist government blood libel-accuses Israel of \"genocide\" ? They need a mirror instead",
    "selftext": "",
    "score": 10,
    "num_comments": 12,
    "created_at": "2024-06-27T03:00:52"
  },
  {
    "post_id": "1dpel13",
    "subreddit": "IsraelUnderAttack",
    "title": "Jamaal Bowman’s Defeat Is a Fatal Blow to the Anti-Israel Left",
    "selftext": "",
    "score": 28,
    "num_comments": 5,
    "created_at": "2024-06-27T00:53:17"
  },
  {
    "post_id": "1dpd3ub",
    "subreddit": "IsraelUnderAttack",
    "title": "No famine in Gaza, previous assumptions were wrong, though risk remains, key report by UN-linked group finds",
    "selftext": "",
    "score": 20,
    "num_comments": 0,
    "created_at": "2024-06-26T23:41:25"
  },
  {
    "post_id": "1doivrn",
    "subreddit": "IsraelUnderAttack",
    "title": "Who do not want peace? It is more than obvious",
    "selftext": "",
    "score": 17,
    "num_comments": 1,
    "created_at": "2024-06-25T22:33:41"
  },
  {
    "post_id": "1doay64",
    "subreddit": "IsraelUnderAttack",
    "title": "Well done",
    "selftext": "",
    "score": 1,
    "num_comments": 0,
    "created_at": "2024-06-25T17:00:36"
  },
  {
    "post_id": "1do7o60",
    "subreddit": "IsraelUnderAttack",
    "title": "Simple as such",
    "selftext": "",
    "score": 37,
    "num_comments": 1,
    "created_at": "2024-06-25T14:41:59"
  },
  {
    "post_id": "1do6onc",
    "subreddit": "IsraelUnderAttack",
    "title": "Lest we forget –",
    "selftext": "",
    "score": 20,
    "num_comments": 1,
    "created_at": "2024-06-25T13:59:19"
  },
  {
    "post_id": "1dnbijw",
    "subreddit": "IsraelUnderAttack",
    "title": "Bring them home –",
    "selftext": "",
    "score": 14,
    "num_comments": 1,
    "created_at": "2024-06-24T11:46:43"
  },
  {
    "post_id": "1dn0wcf",
    "subreddit": "IsraelUnderAttack",
    "title": "The earliest mentions",
    "selftext": "",
    "score": 15,
    "num_comments": 1,
    "created_at": "2024-06-24T00:45:22"
  },
  {
    "post_id": "1dmnctu",
    "subreddit": "IsraelUnderAttack",
    "title": "Israeli’s: What happened to the Israeli Invincibility?",
    "selftext": "Throughout my research of the past Arab-Israeli wars, I remember reading about the Israel that won in 1948 and the stunning dominance over multiple arab countries in 1967. \n\nThe 1973 Yom Kippur war was stunning in of itself but despite the harsh first few weeks, Israel managed to still win. The IDF has the best up to date technology that any country can have. \n\nHowever, this type of Israel-Gaza war is entirely different. Gaza is choked off with a blockade from both Egypt and Israel, land, sea, and there are restrictions as much as possible. No one and I mean no one could have expected Hamas to pull off what it pulled off in October. How can Israel allow Hamas to dictate the terms and deal of a so called ceasefire? How did Israel defeat Egypt, Syria, Jordan in past wars but can’t defeat Hamas? I see that Hezbollah and Israel might go to war, and there may thousands of iran backed fighters entering Lebanon to fight. What the heck happened to Israel Invincibility? This is a serious question and I don’t pick sides here.",
    "score": 0,
    "num_comments": 4,
    "created_at": "2024-06-23T14:27:30"
  },
  {
    "post_id": "1dkrvx0",
    "subreddit": "IsraelUnderAttack",
    "title": "Western Hamasniks must come to terms with Israel’s existence",
    "selftext": "",
    "score": 12,
    "num_comments": 0,
    "created_at": "2024-06-21T01:16:13"
  },
  {
    "post_id": "1dk0rn9",
    "subreddit": "IsraelUnderAttack",
    "title": "Israel-haters, master liars",
    "selftext": "",
    "score": 22,
    "num_comments": 0,
    "created_at": "2024-06-20T02:21:03"
  },
  {
    "post_id": "1djuyvq",
    "subreddit": "IsraelUnderAttack",
    "title": "Hezbollah threatens war against Cyprus if it helps Israel",
    "selftext": "",
    "score": 4,
    "num_comments": 0,
    "created_at": "2024-06-19T21:44:41"
  },
  {
    "post_id": "1djgrw0",
    "subreddit": "IsraelUnderAttack",
    "title": "Well said",
    "selftext": "",
    "score": 6,
    "num_comments": 0,
    "created_at": "2024-06-19T11:24:42"
  },
  {
    "post_id": "1djcmfq",
    "subreddit": "IsraelUnderAttack",
    "title": "Prophecy Of A Severe Earthquake Coming To Strike The Temple Mount In Israel - June 6, 2024",
    "selftext": "",
    "score": 0,
    "num_comments": 0,
    "created_at": "2024-06-19T06:41:51"
  },
  {
    "post_id": "1dj7837",
    "subreddit": "IsraelUnderAttack",
    "title": "The more they boycott, the more we support 🇮🇱",
    "selftext": "",
    "score": 7,
    "num_comments": 0,
    "created_at": "2024-06-19T01:28:54"
  },
  {
    "post_id": "1dj6sbm",
    "subreddit": "IsraelUnderAttack",
    "title": "No wonder those Western academic Marxists concentrated in humanities' departments are getting so mad",
    "selftext": "",
    "score": 12,
    "num_comments": 0,
    "created_at": "2024-06-19T01:06:42"
  },
  {
    "post_id": "1dj25wk",
    "subreddit": "IsraelUnderAttack",
    "title": "God bless them. Salute –",
    "selftext": "",
    "score": 9,
    "num_comments": 0,
    "created_at": "2024-06-18T21:33:01"
  },
  {
    "post_id": "1diu1q9",
    "subreddit": "IsraelUnderAttack",
    "title": "Western academic Marxists concentrated in the faculty of humanities simply ignore it because of their hatred of Jews",
    "selftext": "",
    "score": 16,
    "num_comments": 0,
    "created_at": "2024-06-18T15:54:17"
  },
  {
    "post_id": "1dito9g",
    "subreddit": "IsraelUnderAttack",
    "title": "Extremist Islamist group infiltrates Australia’s pro-Palestine movement",
    "selftext": "",
    "score": 24,
    "num_comments": 5,
    "created_at": "2024-06-18T15:37:57"
  },
  {
    "post_id": "1q9y59l",
    "subreddit": "Palestine",
    "title": "Israeli soldiers mock a blindfolded Palestinian detainee inside detention.",
    "selftext": "",
    "score": 195,
    "num_comments": 7,
    "created_at": "2026-01-11T12:27:21"
  },
  {
    "post_id": "1q9xgwn",
    "subreddit": "Palestine",
    "title": "Zionism Exposes Its True Face Every Day.",
    "selftext": "",
    "score": 194,
    "num_comments": 2,
    "created_at": "2026-01-11T11:50:21"
  }
]